#include "dev/kof/master/development/source/baseproject/jni/game/player/chara/actoroption.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/internal/internal_functions.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/cameracheck.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xfacet"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdio.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/globalheapmemory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstdio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/freecameracheck.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_stdio_config.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threadcheck.h"
#include "dev/silverware/git/sdk/agcondition.inl"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_battleonline.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_textlayout.h"

#include "dev/kof/master/development/source/ps4project/baseproject/extension/asyncjob.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/ogllight.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/player/battleplayerinfo.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/threading/exthread.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/util/cfile.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglrender.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/future_asset.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglvec3.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglmodel.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/main.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/pcdummy.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/data/gamedatainfo.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_battleonline.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/onlineui/scene_roommember.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/battlehud/easingnumber.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/onlineui/roommembers.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/appmain.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/rapper/graphicsopt.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/ag/kofanticheat.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/lib/etc/randommt.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/effect/effectmanager/effecttaskmanager.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/network/netbattle.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/heapmemory.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_battleonlinewatching.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/gfx-integrate/gfxi_movie.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/gfx/gfxmanager.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/system/battlecontroller.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/util/easyindicator.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/stage/fileformat/stageprojectdata.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/data/savedata.cpp"

class AppMain::ShaderLoadThreadHost :
	AgSimpleThreadHost
{
public:
	ShaderLoadThreadHost(AppMain::ShaderLoadThreadHost &);
	ShaderLoadThreadHost(const AppMain::ShaderLoadThreadHost &);
	ShaderLoadThreadHost(AppMain *);
	virtual void onExecuteThread();
private:
	AppMain * m_appMain; // 0x10
public:
	virtual ~ShaderLoadThreadHost();
	AppMain::ShaderLoadThreadHost & operator=(AppMain::ShaderLoadThreadHost &);
	AppMain::ShaderLoadThreadHost & operator=(const AppMain::ShaderLoadThreadHost &);
};
void AppMain::ShaderLoadThreadHost::onExecuteThread(); // 0x1401AAB90
class AppMain::ShaderEnsureThreadHost :
	AgSimpleThreadHost
{
public:
	ShaderEnsureThreadHost(AppMain *);
	virtual void onExecuteThread();
	virtual void onJoinThread();
	void ensureShaders(CHARACTER_NO *, long, STAGE_ID);
	void waitComplete();
private:
	AppMain * m_appMain; // 0x10
	CHARACTER_NO m_chars[4]; // 0x18
	long m_numChars; // 0x28
	STAGE_ID m_stage; // 0x2C
	AgConditionVariable m_wakeCondition; // 0x30
	AgMutex m_wakeMutex; // 0x40
	AgMutex m_workMutex; // 0x68
public:
	virtual ~ShaderEnsureThreadHost();
};
void AppMain::ShaderEnsureThreadHost::onExecuteThread(); // 0x1401AABE0
void AppMain::ShaderEnsureThreadHost::onJoinThread(); // 0x1401AAEA0
void AppMain::SetBattleSetting(bool bDevMode); // 0x1401AAF10
struct AppMain::SetBattleSetting::__l2::CharIDCheck
{
	long id; // 0x0
	CHARACTER_NO orgID; // 0x4
	long color; // 0x8
};
class AppMain::SetBattleSetting::__l2::<lambda_5511106c140da0d2fed20907a815cda1>
{
public:
	long operator()(long, long);
	<lambda_5511106c140da0d2fed20907a815cda1>(AppMain::SetBattleSetting::__l2::<lambda_5511106c140da0d2fed20907a815cda1> &);
	<lambda_5511106c140da0d2fed20907a815cda1>();
	<lambda_5511106c140da0d2fed20907a815cda1>(AppMain *);
private:
	AppMain * __this; // 0x0
public:
	AppMain::SetBattleSetting::__l2::<lambda_5511106c140da0d2fed20907a815cda1> & operator=(const AppMain::SetBattleSetting::__l2::<lambda_5511106c140da0d2fed20907a815cda1> &);
};
void <lambda_e4d56513a02af634611ce83b65c578d3>::operator()(long p1count, long p2count); // 0x1401ABCB0
class AppMain::SetBattleSetting::__l2::<lambda_e4d56513a02af634611ce83b65c578d3>
{
public:
	void operator()(long, long);
	<lambda_e4d56513a02af634611ce83b65c578d3>(AppMain::SetBattleSetting::__l2::<lambda_e4d56513a02af634611ce83b65c578d3> &);
	<lambda_e4d56513a02af634611ce83b65c578d3>();
	<lambda_e4d56513a02af634611ce83b65c578d3>(AppMain::SetBattleSetting::__l2::CharIDCheck[3][2] &);
private:
	AppMain::SetBattleSetting::__l2::CharIDCheck[3][2] & charIDCheck; // 0x0
public:
	AppMain::SetBattleSetting::__l2::<lambda_e4d56513a02af634611ce83b65c578d3> & operator=(const AppMain::SetBattleSetting::__l2::<lambda_e4d56513a02af634611ce83b65c578d3> &);
};
unsigned char AppMain::battleShaderLoad(); // 0x1401ABD50
void AppMain::battleShaderUnloadCharacterShaders(); // 0x1401ABF30
void AppMain::ST_BattleLoadingInit(); // 0x1401ABFB0
enum BATTLE_LOADING_INDEX
{
	INIT = 0,
	SETUP_ASSETS = 1,
	CHARA_LOADING = 2,
	STAGE_LOADING = 3,
	MODEL_ROOM_LOAD = 4,
	HUD_STAGE_INIT = 5,
	HUD_STAGE_LOAD = 6,
	BATTLE_DATA_INIT = 7,
	BATTLE_DATA_LOAD = 8,
	BATTLE_DATA_FLASH = 9,
	BATTLE_DATA_TPOSE_INIT = 10,
	BATTLE_DATA_TPOSE = 11,
	FINISH = 12,
};
void AppMain::InitLightData(); // 0x1401AC4B0
void AppMain::SetUpPlayerAsset(extension::BasicFutureObject<extension::AsyncAsset,extension::FutureAssetOption> & asset, long charNo, long colorNo, bool bDisableEffect); // 0x1401AC7D0
