#include "program files (x86)/microsoft visual studio 14.0/vc/include/xmemory"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thr/xthread"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/globalheapmemory.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.h"
#include "dev/silverware/git/sdk/input/agsdlmappingparser.h"
#include "dev/kof/master/development/source/ps4project/toolkit/geommath/matrix4unaligned.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/scalar_cpp/quat_aos.h"
#include "dev/silverware/git/sdk/platforms/pc/system/agpcsysteminfo.h"
#include "dev/silverware/git/sdk/agreferencecountinl.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_refcount.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memoryheap.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/internal/internal_sse.h"
#include "dev/silverware/git/sdk/3rdparty/steam/steamclientpublic.h"

#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xstddef"
#include "dev/silverware/git/sdk/agvector2.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/type_traits"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/internal/internal_vec64.h"
#include "dev/silverware/git/sdk/agmath.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "dev/silverware/git/sdk/input/agcontroller.h"
#include "dev/silverware/git/sdk/system/aguser.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/cmath"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "dev/silverware/git/sdk/agstring.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/math.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/internal/internal_math.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/mutex"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/string"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/chrono"
#include "dev/kof/master/development/source/baseproject/jni/framework/libcommon.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/scalar_cpp/vec_aos.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/limits"
#include "dev/silverware/git/sdk/3rdparty/steam/matchmakingtypes.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/ios"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocnum"
#include "dev/silverware/git/sdk/system/agsysteminfo.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xiosbase"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocale"
#include "program files (x86)/windows kits/8.1/include/um/winbase.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocinfo"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/mat_aos.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/debug/logging.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vector"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/heapmemory.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/thread/mutex.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thread"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/memory"

struct Codebook
{
	long dimensions; // 0x0
	long entries; // 0x4
	unsigned char * codeword_lengths; // 0x8
	float minimum_value; // 0x10
	float delta_value; // 0x14
	unsigned char value_bits; // 0x18
	unsigned char lookup_type; // 0x19
	unsigned char sequence_p; // 0x1A
	unsigned char sparse; // 0x1B
	unsigned long lookup_values; // 0x1C
	float * multiplicands; // 0x20
	unsigned long * codewords; // 0x28
	short fast_huffman[1024]; // 0x30
	unsigned long * sorted_codewords; // 0x830
	long * sorted_values; // 0x838
	long sorted_entries; // 0x840
};
struct Floor0
{
	unsigned char order; // 0x0
	unsigned short rate; // 0x2
	unsigned short bark_map_size; // 0x4
	unsigned char amplitude_bits; // 0x6
	unsigned char amplitude_offset; // 0x7
	unsigned char number_of_books; // 0x8
	unsigned char book_list[16]; // 0x9
};
struct Floor1
{
	unsigned char partitions; // 0x0
	unsigned char partition_class_list[32]; // 0x1
	unsigned char class_dimensions[16]; // 0x21
	unsigned char class_subclasses[16]; // 0x31
	unsigned char class_masterbooks[16]; // 0x41
	short subclass_books[8][16]; // 0x52
	unsigned short Xlist[250]; // 0x152
	unsigned char sorted_order[250]; // 0x346
	unsigned char neighbors[2][250]; // 0x440
	unsigned char floor1_multiplier; // 0x634
	unsigned char rangebits; // 0x635
	long values; // 0x638
};
union Floor
{
public:
	Floor0 floor0; // 0x0
	Floor1 floor1; // 0x0
};
struct Residue
{
	unsigned long begin; // 0x0
	unsigned long end; // 0x4
	unsigned long part_size; // 0x8
	unsigned char classifications; // 0xC
	unsigned char classbook; // 0xD
	unsigned char * * classdata; // 0x10
	short[8] * residue_books; // 0x18
};
struct MappingChannel
{
	unsigned char magnitude; // 0x0
	unsigned char angle; // 0x1
	unsigned char mux; // 0x2
};
struct Mapping
{
	unsigned short coupling_steps; // 0x0
	MappingChannel * chan; // 0x8
	unsigned char submaps; // 0x10
	unsigned char submap_floor[15]; // 0x11
	unsigned char submap_residue[15]; // 0x20
};
struct Mode
{
	unsigned char blockflag; // 0x0
	unsigned char mapping; // 0x1
	unsigned short windowtype; // 0x2
	unsigned short transformtype; // 0x4
};
struct CRCscan
{
	unsigned long goal_crc; // 0x0
	long bytes_left; // 0x4
	unsigned long crc_so_far; // 0x8
	long bytes_done; // 0xC
	unsigned long sample_loc; // 0x10
};
struct ProbedPage
{
	unsigned long page_start; // 0x0
	unsigned long page_end; // 0x4
	unsigned long after_previous_page_start; // 0x8
	unsigned long first_decoded_sample; // 0xC
	unsigned long last_decoded_sample; // 0x10
};
struct stb_vorbis
{
	unsigned long sample_rate; // 0x0
	long channels; // 0x4
	unsigned long setup_memory_required; // 0x8
	unsigned long temp_memory_required; // 0xC
	unsigned long setup_temp_memory_required; // 0x10
	_iobuf * f; // 0x18
	unsigned long f_start; // 0x20
	long close_on_free; // 0x24
	unsigned char * stream; // 0x28
	unsigned char * stream_start; // 0x30
	unsigned char * stream_end; // 0x38
	unsigned long stream_len; // 0x40
	unsigned char push_mode; // 0x44
	unsigned long first_audio_page_offset; // 0x48
	ProbedPage p_first; // 0x4C
	ProbedPage p_last; // 0x60
	_stb_vorbis_alloc alloc; // 0x78
	long setup_offset; // 0x88
	long temp_offset; // 0x8C
	long eof; // 0x90
	STBVorbisError error; // 0x94
	long blocksize[2]; // 0x98
	long blocksize_0; // 0xA0
	long blocksize_1; // 0xA4
	long codebook_count; // 0xA8
	Codebook * codebooks; // 0xB0
	long floor_count; // 0xB8
	unsigned short floor_types[64]; // 0xBC
	Floor * floor_config; // 0x140
	long residue_count; // 0x148
	unsigned short residue_types[64]; // 0x14C
	Residue * residue_config; // 0x1D0
	long mapping_count; // 0x1D8
	Mapping * mapping; // 0x1E0
	long mode_count; // 0x1E8
	Mode mode_config[64]; // 0x1EC
	unsigned long total_samples; // 0x36C
	float * channel_buffers[16]; // 0x370
	float * outputs[16]; // 0x3F0
	float * previous_window[16]; // 0x470
	long previous_length; // 0x4F0
	short * finalY[16]; // 0x4F8
	unsigned long current_loc; // 0x578
	long current_loc_valid; // 0x57C
	float * A[2]; // 0x580
	float * B[2]; // 0x590
	float * C[2]; // 0x5A0
	float * window[2]; // 0x5B0
	unsigned short * bit_reverse[2]; // 0x5C0
	unsigned long serial; // 0x5D0
	long last_page; // 0x5D4
	long segment_count; // 0x5D8
	unsigned char segments[255]; // 0x5DC
	unsigned char page_flag; // 0x6DB
	unsigned char bytes_in_seg; // 0x6DC
	unsigned char first_decode; // 0x6DD
	long next_seg; // 0x6E0
	long last_seg; // 0x6E4
	long last_seg_which; // 0x6E8
	unsigned long acc; // 0x6EC
	long valid_bits; // 0x6F0
	long packet_bytes; // 0x6F4
	long end_seg_with_known_loc; // 0x6F8
	unsigned long known_loc_for_packet; // 0x6FC
	long discard_samples_deferred; // 0x700
	unsigned long samples_output; // 0x704
	long page_crc_tests; // 0x708
	CRCscan scan[4]; // 0x70C
	long channel_buffer_start; // 0x75C
	long channel_buffer_end; // 0x760
};
void * setup_malloc(stb_vorbis * f, long sz); // 0x140039AD0
void * setup_temp_malloc(stb_vorbis * f, long sz); // 0x140039B20
void crc32_init(); // 0x140039B60
long ilog(long n); // 0x140039C20
float float32_unpack(unsigned long x); // 0x140039CE0
long compute_codewords(Codebook * c, unsigned char * len, long n, unsigned long * values); // 0x140039D30
void compute_accelerated_huffman(Codebook * c); // 0x140039F90
long uint32_compare(const void * p, const void * q); // 0x14003A0B0
void compute_sorted_huffman(Codebook * c, unsigned char * lengths, unsigned long * values); // 0x14003A0D0
long lookup1_values(long entries, long dim); // 0x14003A400
void compute_twiddle_factors(long n, float * A, float * B, float * C); // 0x14003A490
void compute_window(long n, float * window); // 0x14003A630
void compute_bitreverse(long n, unsigned short * rev); // 0x14003A7E0
long init_blocksize(stb_vorbis * f, long b, long n); // 0x14003A8A0
struct PointOGG
{
	unsigned short x; // 0x0
	unsigned short y; // 0x2
};
long point_compare(const void * p, const void * q); // 0x14003AA80
unsigned char get8(stb_vorbis * z); // 0x14003AAA0
unsigned long get32(stb_vorbis * f); // 0x14003AAF0
long getn(stb_vorbis * z, unsigned char * data, long n); // 0x14003AC20
void skip(stb_vorbis * z, long n); // 0x14003ACB0
long set_file_offset(stb_vorbis * f, unsigned long loc); // 0x14003AD10
long capture_pattern(stb_vorbis * f); // 0x14003ADD0
long start_page_no_capturepattern(stb_vorbis * f); // 0x14003AEB0
long start_page(stb_vorbis * f); // 0x14003B0D0
long start_packet(stb_vorbis * f); // 0x14003B110
long maybe_start_packet(stb_vorbis * f); // 0x14003B1B0
long next_segment(stb_vorbis * f); // 0x14003B2C0
long get8_packet_raw(stb_vorbis * f); // 0x14003B3D0
void flush_packet(stb_vorbis * f); // 0x14003B450
unsigned long get_bits(stb_vorbis * f, long n); // 0x14003B4D0
enum <unnamed-enum-VORBIS_packet_id>
{
	VORBIS_packet_id = 1,
	VORBIS_packet_comment = 3,
	VORBIS_packet_setup = 5,
};
long codebook_decode_scalar_raw(stb_vorbis * f, Codebook * c); // 0x14003B5B0
long codebook_decode_start(stb_vorbis * f, Codebook * c, long len); // 0x14003B860
long codebook_decode(stb_vorbis * f, Codebook * c, float * output, long len); // 0x14003B9F0
long codebook_decode_step(stb_vorbis * f, Codebook * c, float * output, long len, long step); // 0x14003BD50
long codebook_decode_deinterleave_repeat(stb_vorbis * f, Codebook * c, float * * outputs, long ch, long * c_inter_p, long * p_inter_p, long len, long total_decode); // 0x14003BF20
long codebook_decode_deinterleave_repeat_2(stb_vorbis * f, Codebook * c, float * * outputs, long * c_inter_p, long * p_inter_p, long len, long total_decode); // 0x14003C430
long residue_decode(stb_vorbis * f, Codebook * book, float * target, long offset, long n, long rtype); // 0x14003C920
void decode_residue(stb_vorbis * f, float * * residue_buffers, long ch, long n, long rn, unsigned char * do_not_decode); // 0x14003CA00
void imdct_step3_iter0_loop(long n, float * e, long i_off, long k_off, float * A); // 0x14003D380
void imdct_step3_inner_r_loop(long lim, float * e, long d0, long k_off, float * A, long k1); // 0x14003D540
void imdct_step3_inner_s_loop(long n, float * e, long i_off, long k_off, float * A, long a_off, long k0); // 0x14003D710
void imdct_step3_inner_s_loop_ld654(long n, float * e, long i_off, float * A, long base_n); // 0x14003D980
void inverse_mdct(float * buffer, long n, stb_vorbis * f, long blocktype); // 0x14003DC90
long do_floor(stb_vorbis * f, Mapping * map, long i, long n, float * target, short * finalY, unsigned char * step2_flag); // 0x14003ECB0
long vorbis_decode_initial(stb_vorbis * f, long * p_left_start, long * p_left_end, long * p_right_start, long * p_right_end, long * mode); // 0x14003F0F0
long vorbis_decode_packet_rest(stb_vorbis * f, long * len, Mode * m, long left_start, long left_end, long right_start, long right_end, long * p_left); // 0x14003F410
long vorbis_finish_frame(stb_vorbis * f, long len, long left, long right); // 0x1400400C0
void vorbis_pump_first_frame(stb_vorbis * f); // 0x1400403D0
long is_whole_packet_present(stb_vorbis * f, long end_page); // 0x140040470
long start_decoder(stb_vorbis * f); // 0x1400405F0
void vorbis_deinit(stb_vorbis * p); // 0x140041DC0
unsigned long stb_vorbis_get_file_offset(stb_vorbis * f); // 0x1400420A0
unsigned long vorbis_find_page(stb_vorbis * f, unsigned long * end, unsigned long * last); // 0x1400420E0
unsigned long stb_vorbis_stream_length_in_samples(stb_vorbis * f); // 0x1400424F0
long stb_vorbis_get_frame_float(stb_vorbis * f, long * channels, float * * * output); // 0x140042700
stb_vorbis * stb_vorbis_open_memory(unsigned char * data, long len, long * error, _stb_vorbis_alloc * alloc); // 0x140042850
union float_conv
{
public:
	float f; // 0x0
	long i; // 0x0
};
void copy_samples(short * dest, float * src, long len); // 0x140042A10
void compute_samples(long mask, short * output, long num_c, float * * data, long d_offset, long len); // 0x140042BB0
void compute_stereo_samples(short * output, long num_c, float * * data, long d_offset, long len); // 0x140042FC0
void convert_samples_short(long buf_c, short * * buffer, long b_offset, long data_c, float * * data, long d_offset, long samples); // 0x1400434D0
void convert_channels_short_interleaved(long buf_c, short * buffer, long data_c, float * * data, long d_offset, long len); // 0x1400435F0
long stb_vorbis_get_frame_short_interleaved(stb_vorbis * f, long num_c, short * buffer, long num_shorts); // 0x140043850
class oggCallBackInfo :
	AgSimpleThreadHost
{
public:
	stb_vorbis * v; // 0x10
	long * * state; // 0x18
	long * loadCount; // 0x20
	AgPointer<AgSharedInstance<AgMutex> > pMutex; // 0x28
	short * data; // 0x38
	unsigned char * data_in; // 0x40
	AgThread me; // 0x48
	oggCallBackInfo(oggCallBackInfo &);
	oggCallBackInfo(const oggCallBackInfo &);
	oggCallBackInfo();
	virtual void onExecuteThread();
	virtual ~oggCallBackInfo();
	oggCallBackInfo & operator=(oggCallBackInfo &);
	oggCallBackInfo & operator=(const oggCallBackInfo &);
};
unsigned long crc_table[256]; // 0x140AC2300
char channel_position[6][7]; // 0x140888BC0
std::piecewise_construct_t std::piecewise_construct; // 0x140888B19
unsigned char ogg_page_header[4]; // 0x140A2B1B8
float inverse_db_table[256]; // 0x140888BF0
void * oggCallBack(void * ptr); // 0x140043950
void oggCallBackInfo::onExecuteThread(); // 0x140043AD0
long stb_vorbis_decode_memory_plus(unsigned char * mem, long len, long * channels, long * sample, long * * threadState, long * loadCount, AgPointer<AgSharedInstance<AgMutex> > pThreadMutex, short * * output); // 0x140043AE0//decompilation failure at 140AC2300!
//decompilation failure at 140888BC0!
//decompilation failure at 140888B19!
