#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_sgmlparser.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/math.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_core.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_image.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_texturecache.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_refcount.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_threadcommandqueue.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threads.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/sys/stat.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/wchar.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wconio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_file.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_font.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_alg.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memcpy_s.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_hash.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_cxform.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_color.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix2x4.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/heapmh/heapmh_sysallocmalloc.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/malloc.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_types2d.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_std.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdlib.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_range.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_log.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/gfx/text/text_stylesheet.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_styledtext.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memoryheap.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_wstring.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_ampinterface.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_string.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"

struct Scaleform::GFx::Text::CSSToken<char>
{
	enum TokenType
	{
		TT_Name = 0,
		TT_QString = 1,
		TT_WhiteSpace = 2,
		TT_Number = 3,
		TT_HexNumber = 4,
		TT_Comma = 5,
		TT_OpenBrace = 6,
		TT_CloseBrace = 7,
		TT_SemiColon = 8,
		TT_Colon = 9,
		TT_EOF = 10,
		TT_Unknown = 11,
	};
	Scaleform::GFx::Text::CSSToken<char>::TokenType Type; // 0x0
	const char * pBase; // 0x8
	unsigned long long Length; // 0x10
	CSSToken<char>(Scaleform::GFx::Text::CSSToken<char>::TokenType, const char *, unsigned long long);
	CSSToken<char>(Scaleform::GFx::Text::CSSToken<char>::TokenType);
	CSSToken<char>();
	bool operator==(Scaleform::GFx::Text::CSSToken<char>::TokenType);
	void operator+=(const Scaleform::GFx::Text::CSSToken<char> &);
};
struct Scaleform::GFx::Text::CSSToken<wchar_t>
{
	enum TokenType
	{
		TT_Name = 0,
		TT_QString = 1,
		TT_WhiteSpace = 2,
		TT_Number = 3,
		TT_HexNumber = 4,
		TT_Comma = 5,
		TT_OpenBrace = 6,
		TT_CloseBrace = 7,
		TT_SemiColon = 8,
		TT_Colon = 9,
		TT_EOF = 10,
		TT_Unknown = 11,
	};
	Scaleform::GFx::Text::CSSToken<wchar_t>::TokenType Type; // 0x0
	const wchar_t * pBase; // 0x8
	unsigned long long Length; // 0x10
	CSSToken<wchar_t>(Scaleform::GFx::Text::CSSToken<wchar_t>::TokenType, const wchar_t *, unsigned long long);
	CSSToken<wchar_t>(Scaleform::GFx::Text::CSSToken<wchar_t>::TokenType);
	CSSToken<wchar_t>();
	bool operator==(Scaleform::GFx::Text::CSSToken<wchar_t>::TokenType);
	void operator+=(const Scaleform::GFx::Text::CSSToken<wchar_t> &);
};
class Scaleform::GFx::Text::CSSTokenizer<char>
{
public:
	CSSTokenizer<char>(const char *, unsigned long long);
	Scaleform::GFx::Text::CSSToken<char> GetNextToken();
	unsigned long long GetLineNo();
	unsigned long long GetColNo();
private:
	const char * pCurr; // 0x0
	const char * pEnd; // 0x8
	Scaleform::GFx::Text::CSSToken<char> CurrentToken; // 0x10
	unsigned long long LineNo; // 0x28
	unsigned long long ColNo; // 0x30
	unsigned long long LineDev; // 0x38
	unsigned long long ColDev; // 0x40
	long IsSpace(char);
	long IsDigit(char);
	long IsXDigit(char);
	long IsAlpha(char);
	long IsAlNum(char);
};
class Scaleform::GFx::Text::CSSTokenizer<wchar_t>
{
public:
	CSSTokenizer<wchar_t>(const wchar_t *, unsigned long long);
	Scaleform::GFx::Text::CSSToken<wchar_t> GetNextToken();
	unsigned long long GetLineNo();
	unsigned long long GetColNo();
private:
	const wchar_t * pCurr; // 0x0
	const wchar_t * pEnd; // 0x8
	Scaleform::GFx::Text::CSSToken<wchar_t> CurrentToken; // 0x10
	unsigned long long LineNo; // 0x28
	unsigned long long ColNo; // 0x30
	unsigned long long LineDev; // 0x38
	unsigned long long ColDev; // 0x40
	long IsSpace(wchar_t);
	long IsDigit(wchar_t);
	long IsXDigit(wchar_t);
	long IsAlpha(wchar_t);
	long IsAlNum(wchar_t);
};
long Scaleform::GFx::Text::CSSTokenizer<wchar_t>::IsDigit(wchar_t c); // 0x1406FA380
long Scaleform::GFx::Text::CSSTokenizer<wchar_t>::IsXDigit(wchar_t c); // 0x1406FA3D0
long Scaleform::GFx::Text::CSSTokenizer<wchar_t>::IsAlpha(wchar_t c); // 0x1406FA330
Scaleform::GFx::Text::CSSToken<wchar_t> Scaleform::GFx::Text::CSSTokenizer<wchar_t>::GetNextToken(); // 0x1406F8F30
class Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> :
	Scaleform::ArrayBase<Scaleform::ArrayData<Scaleform::GFx::Text::CSSToken<wchar_t>,Scaleform::AllocatorGH<Scaleform::GFx::Text::CSSToken<wchar_t>,2>,Scaleform::ArrayDefaultPolicy> >
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	class SelfType;
	class BaseType;
public:
	Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy>(const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> &);
	Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy>(long);
	Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy>();
	const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & operator=(const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> &);
	~Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy>();
};
class Scaleform::GFx::Text::CSSHandler<wchar_t>
{
public:
	~CSSHandler<wchar_t>();
	void OpenCSSSelectorBlock(const Scaleform::GFx::Text::CSSToken<wchar_t> &, void *);
	void CloseCSSSelectorBlock(void *);
	void PushCSSSelectorProperty(const Scaleform::GFx::Text::CSSToken<wchar_t> &, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> &, void *);
	CSSHandler<wchar_t>(const Scaleform::GFx::Text::CSSHandler<wchar_t> &);
	CSSHandler<wchar_t>();
	Scaleform::GFx::Text::CSSHandler<wchar_t> & operator=(const Scaleform::GFx::Text::CSSHandler<wchar_t> &);
};
bool Scaleform::GFx::Text::CSSParser<wchar_t>::Parse(const wchar_t * buffer, unsigned long long len, Scaleform::GFx::Text::CSSHandler<wchar_t> * handler, void * pdata); // 0x1406FA620
class Scaleform::GFx::Text::TextStyleParserHandlerBase
{
protected:
	TextStyleParserHandlerBase(Scaleform::GFx::Text::StyleManager *);
	Scaleform::Render::Text::Style * GetStyle(const Scaleform::GFx::Text::StyleKey &);
	void AddStyle(const Scaleform::GFx::Text::StyleKey &, Scaleform::Render::Text::Style *);
	const Scaleform::GFx::Text::StyleKey & GetTempStyleKey(Scaleform::Render::Text::StyleManagerBase::KeyType, const Scaleform::String &);
	Scaleform::GFx::Text::StyleManager * GetTextStyleManager();
private:
	Scaleform::GFx::Text::StyleManager * pManager; // 0x0
};
Scaleform::Render::Text::Style * Scaleform::GFx::Text::TextStyleParserHandlerBase::GetStyle(const Scaleform::GFx::Text::StyleKey & key); // 0x1406F9600
class Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> :
	Scaleform::ArrayBase<Scaleform::ArrayData<Scaleform::Render::Text::Style *,Scaleform::AllocatorGH<Scaleform::Render::Text::Style *,2>,Scaleform::ArrayDefaultPolicy> >
{
	typedef Scaleform::Render::Text::Style ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	class SelfType;
	class BaseType;
public:
	Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy>(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> &);
	Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy>(long);
	Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy>();
	const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & operator=(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> &);
	~Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy>();
};
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::OpenCSSSelectorBlock(const Scaleform::GFx::Text::CSSToken<wchar_t> & name, void * pdata); // 0x1406FA420
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::CloseCSSSelectorBlock(void * pdata); // 0x1406F8EC0
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::PushCSSSelectorProperty(const Scaleform::GFx::Text::CSSToken<wchar_t> & name, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value, void * pdata); // 0x1406FAA60
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleColor(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9670
class Scaleform::Render::Text::SGMLParser<wchar_t>
{
protected:
	Scaleform::MemoryHeap * pHeap; // 0x0
	long CurState; // 0x8
	Scaleform::Render::Text::SGMLCharIter<wchar_t> Iter; // 0x10
	wchar_t * pBuffer; // 0x30
	unsigned long long BufSize; // 0x38
	unsigned long long BufPos; // 0x40
	bool CondenseWhite; // 0x48
	void SkipName();
	void SkipSpaces();
	void SkipComment();
	void SkipAttribute();
	void ParseName(const wchar_t * *, unsigned long long *);
public:
	SGMLParser<wchar_t>(Scaleform::MemoryHeap *, const wchar_t *, unsigned long long);
	~SGMLParser<wchar_t>();
	void ResetBuf();
	void AppendToBuf(const wchar_t *, unsigned long long);
	void AppendCharToBuf(unsigned long);
	long GetNext();
	bool GetNextAttribute(const wchar_t * *, unsigned long long *);
	bool GetNextAttributeValue(const wchar_t * *, unsigned long long *);
	bool ParseStartElement(const wchar_t * *, unsigned long long *);
	bool ParseEndElement(const wchar_t * *, unsigned long long *);
	bool ParseContent(const wchar_t * *, unsigned long long *);
	bool HasAttributes();
	void SetCondenseWhite();
	static long StrCompare(const wchar_t *, unsigned long long, const wchar_t *, unsigned long long);
	static long StrCompare(const wchar_t *, const char *, unsigned long long);
	static bool ParseInt(long *, const wchar_t *, unsigned long long);
	static bool ParseHexInt(unsigned long *, const wchar_t *, unsigned long long);
	static bool ParseFloat(float *, const wchar_t *, unsigned long long);
};
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleDisplay(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9700
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleFontFamily(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9840
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleFontSize(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9990
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleFontStyle(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9A50
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleFontWeight(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9B50
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleKerning(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9C50
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleLeading(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9D50
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleLetterSpacing(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9DF0
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleMarginLeft(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9E90
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleMarginRight(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9F30
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleTextAlign(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406F9FD0
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleTextDecoration(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406FA190
void Scaleform::GFx::Text::TextStyleParserHandler<wchar_t>::HandleTextIndent(const Scaleform::Array<Scaleform::Render::Text::Style *,2,Scaleform::ArrayDefaultPolicy> & styles, const Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & value); // 0x1406FA290
Scaleform::GFx::Text::StyleManager::~StyleManager(); // 0x1406F8A30
bool Scaleform::GFx::Text::StyleManager::ParseCSSImpl<wchar_t>(const wchar_t * buffer, unsigned long long len); // 0x1406F8340
class Scaleform::GFx::Text::CSSParser<wchar_t>
{
	enum ParseState
	{
		PS_ReadStyleName = 0,
		PS_ReadPropertyName = 1,
		PS_ReadPropertyValue = 2,
		PS_Success = 3,
		PS_Error = 4,
	};
private:
	Scaleform::GFx::Text::CSSToken<wchar_t> SelectorName; // 0x0
	Scaleform::GFx::Text::CSSToken<wchar_t> PropertyName; // 0x18
	Scaleform::Array<Scaleform::GFx::Text::CSSToken<wchar_t>,2,Scaleform::ArrayDefaultPolicy> PropertyValue; // 0x30
	bool bPseudoClass; // 0x48
	bool bPropValSpool; // 0x49
	unsigned long long PropValLinePos; // 0x50
	unsigned long long PropValColPos; // 0x58
public:
	CSSParser<wchar_t>(Scaleform::GFx::Text::CSSParser<wchar_t> &);
	CSSParser<wchar_t>(const Scaleform::GFx::Text::CSSParser<wchar_t> &);
	CSSParser<wchar_t>();
	bool Parse(const wchar_t *, unsigned long long, Scaleform::GFx::Text::CSSHandler<wchar_t> *, void *);
	~CSSParser<wchar_t>();
	Scaleform::GFx::Text::CSSParser<wchar_t> & operator=(Scaleform::GFx::Text::CSSParser<wchar_t> &);
	Scaleform::GFx::Text::CSSParser<wchar_t> & operator=(const Scaleform::GFx::Text::CSSParser<wchar_t> &);
};
class Scaleform::GFx::Text::TextStyleParserHandler<wchar_t> :
	Scaleform::GFx::Text::CSSHandler<wchar_t>,
	Scaleform::GFx::Text::TextStyleParserHandlerBase
{
public:
	TextStyleParserHandler<wchar_t>(const Scaleform::GFx::Text::TextStyleParserHandler<wchar_t> &);
	TextStyleParserHandler<wchar_t>(Scaleform::GFx::Text::StyleManager *);
	virtual ~TextStyleParserHandler<wchar_t>();
