#pragma once

struct EffectListNodeData
{
	std::basic_string<char,std::char_traits<char>,std::allocator<char> > id; // 0x0
	long index; // 0x20
	EffectData * effectData; // 0x28
	EffectListNodeData(EffectListNodeData &);
	EffectListNodeData(const EffectListNodeData &);
	EffectListNodeData();
	~EffectListNodeData();
	EffectListNodeData & operator=(EffectListNodeData &);
	EffectListNodeData & operator=(const EffectListNodeData &);
};
struct EffectDataList
{
	long category; // 0x0
	long subCategory; // 0x4
	std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > effectDataList; // 0x8
	EffectDataList(EffectDataList &);
	EffectDataList(const EffectDataList &);
	EffectDataList();
	~EffectDataList();
	EffectDataList & operator=(EffectDataList &);
	EffectDataList & operator=(const EffectDataList &);
};
struct StlAllocator<EffectListNodeData,&g_EffectHeap0> :
	std::allocator<EffectListNodeData>
{
	StlAllocator<EffectListNodeData,&g_EffectHeap0>(const StlAllocator<EffectListNodeData,&g_EffectHeap0> &);
	StlAllocator<EffectListNodeData,&g_EffectHeap0>();
	EffectListNodeData * allocate(unsigned long long);
	void deallocate(EffectListNodeData *, unsigned long long);
	struct ?$rebind@UEffectListNodeData@@;
};
class std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > :
	std::_Vector_alloc<std::_Vec_base_types<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > >
{
	class _Myt;
	class _Mybase;
	struct allocator_type;
	struct _Alty;
	struct value_type;
	typedef unsigned long long size_type;
	typedef long long difference_type;
	typedef EffectListNodeData pointer;
	typedef const EffectListNodeData const_pointer;
	typedef EffectListNodeData reference;
	typedef const EffectListNodeData const_reference;
	class iterator;
	class const_iterator;
	class reverse_iterator;
	class const_reverse_iterator;
public:
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >(std::initializer_list<EffectListNodeData>, const StlAllocator<EffectListNodeData,&g_EffectHeap0> &);
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >(std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &, const StlAllocator<EffectListNodeData,&g_EffectHeap0> &);
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >(std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &);
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >(const std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &, const StlAllocator<EffectListNodeData,&g_EffectHeap0> &);
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >(const std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &);
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >(unsigned long long, const EffectListNodeData &, const StlAllocator<EffectListNodeData,&g_EffectHeap0> &);
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >(unsigned long long, const EffectListNodeData &);
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >(unsigned long long);
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >(const StlAllocator<EffectListNodeData,&g_EffectHeap0> &);
	vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >();
	void _Construct_n(unsigned long long, const EffectListNodeData *);
	std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > & operator=(const std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &);
	std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > & operator=(std::initializer_list<EffectListNodeData>);
	std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > & operator=(std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &);
	void _Assign_rv(std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &);
	void _Assign_rv(std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &, std::integral_constant<bool,0>);
	void _Assign_rv(std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &, std::integral_constant<bool,1>);
	void push_back(const EffectListNodeData &);
	void push_back(EffectListNodeData &);
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > insert(std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > >, unsigned long long, const EffectListNodeData &);
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > insert(std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > >, const EffectListNodeData &);
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > insert(std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > >, std::initializer_list<EffectListNodeData>);
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > insert(std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > >, EffectListNodeData &);
	void assign(unsigned long long, const EffectListNodeData &);
	void assign(std::initializer_list<EffectListNodeData>);
	~vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> >();
	void reserve(unsigned long long);
	unsigned long long capacity();
	unsigned long long _Unused_capacity();
	unsigned long long _Has_unused_capacity();
	std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > begin();
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > begin();
	std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > end();
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > end();
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > _Make_iter(std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > >);
	std::reverse_iterator<std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > > rbegin();
	std::reverse_iterator<std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > > rbegin();
	std::reverse_iterator<std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > > rend();
	std::reverse_iterator<std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > > rend();
	std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > cbegin();
	std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > cend();
	std::reverse_iterator<std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > > crbegin();
	std::reverse_iterator<std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > > crend();
	void shrink_to_fit();
	void resize(unsigned long long, const EffectListNodeData &);
	void resize(unsigned long long);
	unsigned long long size();
	unsigned long long max_size();
	bool empty();
	StlAllocator<EffectListNodeData,&g_EffectHeap0> get_allocator();
	EffectListNodeData & at(unsigned long long);
	const EffectListNodeData & at(unsigned long long);
	EffectListNodeData & operator[](unsigned long long);
	const EffectListNodeData & operator[](unsigned long long);
	const EffectListNodeData * data();
	EffectListNodeData * data();
	const EffectListNodeData & front();
	EffectListNodeData & front();
	const EffectListNodeData & back();
	EffectListNodeData & back();
	void pop_back();
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > erase(std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > >, std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > >);
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > erase(std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > >);
	void _Pop_back_n(unsigned long long);
	void clear();
	void swap(std::vector<EffectListNodeData,StlAllocator<EffectListNodeData,&g_EffectHeap0> > &);
protected:
	bool _Buy(unsigned long long);
	void _Destroy(EffectListNodeData *, EffectListNodeData *);
	unsigned long long _Grow_to(unsigned long long);
	bool _Inside(const EffectListNodeData *);
	void _Reallocate(unsigned long long);
	void _Reserve(unsigned long long);
	void _Tidy();
	std::_Vector_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > > _Insert_n(std::_Vector_const_iterator<std::_Vector_val<std::_Simple_types<EffectListNodeData> > >, unsigned long long, const EffectListNodeData &);
	EffectListNodeData * _Ufill(EffectListNodeData *, unsigned long long, const EffectListNodeData *);
	void _Xlen();
	void _Xran();
	void _Orphan_range(EffectListNodeData *, EffectListNodeData *);
};
struct EffectListNode
{
	long deleteMarginCount; // 0x0
	long index; // 0x4
	Effect * pEffect; // 0x8
	EffectListNode();
};
enum CharaIdType
{
	NAME_ID = 0,
	NUM_ID = 1,
};
class extension::BasicFutureObject<OGLCurve,void> :
	extension::AsyncContentConstants,
	extension::FutureObjectSpec
{
	class Content_t;
	class Body;
	class BodySharedPtr_t;
	class BodyWeakPtr_t;
private:
	bool m_isNoCache; // 0x1
	extension::RefCountablePtr<extension::BasicFutureObject<OGLCurve,void>::Body> m_body; // 0x8
public:
	BasicFutureObject<OGLCurve,void>(const extension::BasicFutureObject<OGLCurve,void> &);
	BasicFutureObject<OGLCurve,void>(extension::FutureObjectSpec::NoCache_t, const std::string &, const void *);
	BasicFutureObject<OGLCurve,void>(const std::string &, const void *);
	BasicFutureObject<OGLCurve,void>();
	~BasicFutureObject<OGLCurve,void>();
	extension::BasicFutureObject<OGLCurve,void> & operator=(const extension::BasicFutureObject<OGLCurve,void> &);
	bool isEmpty();
	bool isReady();
	void waitForReady();
	const OGLCurve * get();
	bool hasData();
	extension::AsyncContentConstants::ErrorCode getErrorCode();
	const char * getErrorString();
	void reset();
	void dispose();
	OGLCurve * releaseData();
	OGLCurve * operator->();
	OGLCurve & operator*();
	OGLCurve * operator class OGLCurve *const();
	std::string contentPath();
	static extension::BasicFutureObject<OGLCurve,void> MakeDataHolder(OGLCurve *);
	class AssetCache;
private:
	static extension::BasicFutureObject<OGLCurve,void>::AssetCache s_cacheManager; // 0xFFFFFFFFFFFFFFFF
};
class EffectDataListManager
{
public:
	EffectDataListManager(const EffectDataListManager &);
	EffectDataListManager();
	~EffectDataListManager();
	void recursiveDelEffect(Effect *);
	void recursiveDelEffectData(EffectData *);
	void terminate();
	void update();
	void clearEffectData();
	void clearEffect();
	void clearResourceData();
	bool isReady();
	bool loadEffectData(std::string);
	void loadRoundData();
	void singleDataLoad(std::string, std::basic_istream<char,std::char_traits<char> > *, long);
	void recursiveRenameResource(std::string, EffectData *);
	void recursiveRenameResourceCharaID(EffectData *);
	bool checkName(std::string *, EffectData *);
	bool checkRenameTexture(std::string *);
	void renameAddCharaIDBack(std::string *);
	bool checkChinaSupport(long);
	void addCharaIDBack(std::string *, long, long);
	void texDataLoad(std::string, std::string);
	void figureDataLoad(std::string, std::string, long);
	void figureDataLoadToGpu(std::string, std::string);
	long figureDataLoadToCpu(std::string, std::string);
	void curveDataLoad(std::string, std::string);
	void * getCpuFigure(long);
	long getIndex(std::string);
	long getIndexSize();
	long getIdSize(long);
	char * getId(long);
	Effect * createEffect(EffectData *, Effect *, Effect *);
	Effect * createEffect(std::string);
	Effect * createEffect(long);
	void recursiveLoadResource(std::string, EffectData *);
	std::string createFilePath(long, long, long);
	unsigned long getEffectIndexSize();
	long getDeleteTime(long);
	void setEffectSystem(EffectTaskManager *);
	void setBindModel(OGLModel *);
	OGLModel * getBindModel();
	void setPlayerNum(long);
	long getPlayerNum();
	void createBlurEffectTexture();
	void setFillColor(OGLVec4 *);
	OGLVec4 * getFillColor();
	void calcAllBindUVPosition();
	void recursiveCalcBindUVPosition(EffectData *);
	void updateStack();
	void renderStack();
private:
	OGLModel * m_pBindModel; // 0x8
	long m_PlayerNum; // 0x10
	bool m_LittleEndian; // 0x14
	long m_Align; // 0x18
	OGLEffectVec4 m_FillColor; // 0x20
	std::vector<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,std::allocator<std::basic_string<char,std::char_traits<char>,std::allocator<char> > > > loadTexPathName; // 0x38
	std::vector<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,std::allocator<std::basic_string<char,std::char_traits<char>,std::allocator<char> > > > loadFigurePathName; // 0x50
	std::vector<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,std::allocator<std::basic_string<char,std::char_traits<char>,std::allocator<char> > > > loadCpuFigurePathName; // 0x68
	std::vector<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,std::allocator<std::basic_string<char,std::char_traits<char>,std::allocator<char> > > > loadCurvePathName; // 0x80
	std::vector<void *,std::allocator<void *> > loadTexData; // 0x98
	std::vector<void *,std::allocator<void *> > loadFigureData; // 0xB0
	std::vector<void *,std::allocator<void *> > loadCpuFigureData; // 0xC8
	std::vector<extension::BasicFutureObject<OGLCurve,void>,std::allocator<extension::BasicFutureObject<OGLCurve,void> > > loadCurveData; // 0xE0
	std::vector<EffectListNodeData,std::allocator<EffectListNodeData> > m_EffectDataList; // 0xF8
	std::vector<EffectDataList,std::allocator<EffectDataList> > m_CharaEffectDataLists; // 0x110
	std::vector<EffectListNode,std::allocator<EffectListNode> > m_EffectList; // 0x128
	BinaryFileInput m_BinaryFileInput; // 0x140
public:
	EffectDataListManager & operator=(const EffectDataListManager &);
};
class std::vector<void *,std::allocator<void *> > :
	std::_Vector_alloc<std::_Vec_base_types<void *,std::allocator<void *> > >
{
	class _Myt;
	class _Mybase;
	class allocator_type;
	struct _Alty;
	typedef void *value_type;
	typedef unsigned long long size_type;
	typedef long long difference_type;
	typedef void * pointer;
	typedef void * const_pointer;
	typedef void * reference;
	typedef void * const_reference;
	class iterator;
	class const_iterator;
	class reverse_iterator;
	class const_reverse_iterator;
public:
	vector<void *,std::allocator<void *> >(std::initializer_list<void *>, const std::allocator<void *> &);
	vector<void *,std::allocator<void *> >(std::vector<void *,std::allocator<void *> > &, const std::allocator<void *> &);
	vector<void *,std::allocator<void *> >(std::vector<void *,std::allocator<void *> > &);
