#include "dev/kof/master/development/source/ps4project/baseproject/extension/bilinkable.h"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_battleloading.h"
#include "dev/kof/master/development/source/baseproject/jni/game/player/shot/actorshot.h"
#include "dev/kof/master/development/source/baseproject/jni/game/player/chara/actorchara.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_states.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/scalar_cpp/mat_aos.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vcruntime_exception.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/commandcheck.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/imagefiles/tga_imagefile.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_statebag.h"
#include "dev/kof/master/development/source/baseproject/jni/game/util/restrictringbuffer.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/titlestoragesystem.h"
#include "program files (x86)/windows kits/8.1/include/shared/stralign.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thread"
#include "dev/silverware/git/sdk/agreferenceinl.h"
#include "dev/kof/master/development/source/ps4project/baseproject/pcutil/pccontrolsmanager.h"

#include "program files (x86)/microsoft visual studio 14.0/vc/include/algorithm"
#include "dev/kof/master/development/source/baseproject/jni/game/player/actionblackout.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_shapedatapacked.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/wchar.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_pathdatapacker.h"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_battleonlinewatching.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_linebuffer.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/thread/jobmanager.h"
#include "dev/silverware/git/sdk/system/agsysteminfo.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wconio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_highlight.h"
#include "dev/kof/master/development/source/baseproject/jni/game/player/charafileformat/cpusequencedataformat.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_shapedatafloat.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_profiler.h"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/threading/exthread.h"
#include "program files (x86)/windows kits/8.1/include/shared/guiddef.h"
#include "dev/kof/master/development/source/baseproject/jni/game/stage/battlestagedatas.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/stage/fileformat/tkndatas.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/threading/exlockable.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/asyncjob.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/threading/exthread.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglrender.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/future_asset.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/stage/fileformat/fileutil.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglmotion.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/util/cfile.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/ogltexture.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/stage/fonttexture.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/core/glstate.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/pcdummy.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/stage/fileformat/stageprojectdata.cpp"

class StageResources
{
public:
	TknFileDataDesc tkn; // 0x0
	extension::BasicFutureObject<extension::AsyncAsset,extension::FutureAssetOption> * pOGLModels; // 0x170
	long modelCount; // 0x178
	OGLMotion * * pOGLMotions; // 0x180
	long motionCount; // 0x188
	OGLTexture * * pOGLTextures; // 0x190
	long textureCount; // 0x198
	EffectDataListManager * * pEffectManagers; // 0x1A0
	long effectManagerCount; // 0x1A8
	StageResources();
	~StageResources();
	void dispose();
	bool createTknFile(const char *, const char *);
};
void StageResources::dispose(); // 0x140213D40
bool StageResources::createTknFile(const char * pTknFilePath, const char * pBasePath); // 0x140213F70
struct extension::FutureStageOption
{
	std::basic_string<char,std::char_traits<char>,std::allocator<char> > basePath; // 0x0
	FutureStageOption(const extension::FutureStageOption &);
	FutureStageOption();
	~FutureStageOption();
	bool operator==(const extension::FutureStageOption &);
	std::string stringize();
	extension::FutureStageOption & operator=(const extension::FutureStageOption &);
};
extension::FutureStageOption::~FutureStageOption(); // 0x140124610
std::string extension::FutureStageOption::stringize(); // 0x1402144B0
class extension::FutureObjectJob<StageResources> :
	extension::ExThread::Runnable,
	extension::AsyncContentConstants,
	extension::FutureObjectSpec
{
public:
	FutureObjectJob<StageResources>(extension::RefCountablePtr<extension::AsyncContent<StageResources> >);
private:
	FutureObjectJob<StageResources>(const extension::FutureObjectJob<StageResources> &);
	extension::FutureObjectJob<StageResources> & operator=(const extension::FutureObjectJob<StageResources> &);
	class ContentSharedPtr_t;
public:
	virtual ~FutureObjectJob<StageResources>();
	void setResult(std::unique_ptr<StageResources,std::default_delete<StageResources> > &);
	void setErrorResult(extension::AsyncContentConstants::ErrorCode);
	const std::string & contentPath();
	bool isCancelRequested();
	extension::RefCountablePtr<extension::AsyncContent<StageResources> > releaseContent();
	long run() = 0;
private:
	std::unique_ptr<StageResources,std::default_delete<StageResources> > createOnErrorData();
	extension::RefCountablePtr<extension::AsyncContent<StageResources> > m_content; // 0x18
};
class extension::future_asset_detail::FutureStageJob :
	extension::FutureObjectJob<StageResources>
{
	class Base_t;
private:
	extension::FutureStageOption options; // 0x20
public:
	FutureStageJob(extension::RefCountablePtr<extension::AsyncContent<StageResources> >, const extension::FutureStageOption *);
	virtual long run();
	virtual ~FutureStageJob();
};
extension::future_asset_detail::FutureStageJob::FutureStageJob(extension::RefCountablePtr<extension::AsyncContent<StageResources> > c, const extension::FutureStageOption * pOpt); // 0x140214590
long extension::future_asset_detail::FutureStageJob::run(); // 0x140214670
void extension::future_asset_detail::EnqueueFutureStageJob(extension::RefCountablePtr<extension::AsyncContent<StageResources> > shared, const extension::FutureStageOption * pOpt); // 0x140214820
struct extension::FutureObjectJobManager<StageResources,extension::FutureStageOption>
{
	class Content_t;
	class ContentSharedPtr_t;
	static extension::RefCountablePtr<extension::AsyncContent<StageResources> > LoadStart(const std::string &, const std::string &, const extension::FutureStageOption *);
	static std::string Stringize(const extension::FutureStageOption *);
private:
	static void EnqueueAsyncJob(extension::RefCountablePtr<extension::AsyncContent<StageResources> >, const extension::FutureStageOption *);
};
class extension::BasicFutureObject<StageResources,extension::FutureStageOption> :
	extension::AsyncContentConstants,
	extension::FutureObjectSpec
{
	class Content_t;
	class Body;
	class BodySharedPtr_t;
	class BodyWeakPtr_t;
private:
	bool m_isNoCache; // 0x1
	extension::RefCountablePtr<extension::BasicFutureObject<StageResources,extension::FutureStageOption>::Body> m_body; // 0x8
public:
	BasicFutureObject<StageResources,extension::FutureStageOption>(const extension::BasicFutureObject<StageResources,extension::FutureStageOption> &);
	BasicFutureObject<StageResources,extension::FutureStageOption>(extension::FutureObjectSpec::NoCache_t, const std::string &, const extension::FutureStageOption *);
	BasicFutureObject<StageResources,extension::FutureStageOption>(const std::string &, const extension::FutureStageOption *);
	BasicFutureObject<StageResources,extension::FutureStageOption>();
	~BasicFutureObject<StageResources,extension::FutureStageOption>();
	extension::BasicFutureObject<StageResources,extension::FutureStageOption> & operator=(const extension::BasicFutureObject<StageResources,extension::FutureStageOption> &);
	bool isEmpty();
	bool isReady();
	void waitForReady();
	const StageResources * get();
	bool hasData();
	extension::AsyncContentConstants::ErrorCode getErrorCode();
	const char * getErrorString();
	void reset();
	void dispose();
	StageResources * releaseData();
	StageResources * operator->();
	StageResources & operator*();
	StageResources * operator class StageResources *const();
	std::string contentPath();
	static extension::BasicFutureObject<StageResources,extension::FutureStageOption> MakeDataHolder(StageResources *);
	class AssetCache;
private:
	static extension::BasicFutureObject<StageResources,extension::FutureStageOption>::AssetCache s_cacheManager; // 0xFFFFFFFFFFFFFFFF
};
struct BattleStageResourcePack
{
	extension::BasicFutureObject<extension::AsyncAsset,extension::FutureAssetOption> * pStageModels; // 0x0
	extension::BasicFutureObject<StageResources,extension::FutureStageOption> datas; // 0x8
	BattleStageResourcePack(BattleStageResourcePack &);
	BattleStageResourcePack(const BattleStageResourcePack &);
	BattleStageResourcePack();
	~BattleStageResourcePack();
	BattleStageResourcePack & operator=(BattleStageResourcePack &);
	BattleStageResourcePack & operator=(const BattleStageResourcePack &);
};
extension::BasicFutureObject<StageResources,extension::FutureStageOption>::AssetCache extension::BasicFutureObject<StageResources,extension::FutureStageOption>::s_cacheManager; // 0x140ACDAA0
void(*??s_cacheManager$initializer$@?$BasicFutureObject@VStageResources@@UFutureStageOption@extension@@@extension@@0P6AXXZEA@@3P6AXXZEA)(); // 0x140740830
std::piecewise_construct_t std::piecewise_construct; // 0x1408A0B39
bool BattleStageResourceContainer::loadResources(const StageProjectData & stageProj, STAGE_ID stageID); // 0x140214920
void BattleStageResourceContainer::dispose(); // 0x140214C20
