#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/time.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_ampinterface.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_string.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_utf8util.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/sys/stat.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_sysalloc.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/wchar.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wconio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstdio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_stdio_config.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_sync.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_types2d.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_alg.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdlib.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wtime.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/string.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_resizeimage.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memcpy_s.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_arrayunsafe.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_memorymanager.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_std.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/heapmh/heapmh_sysallocmalloc.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/malloc.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_file.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memoryheap.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_texturecache.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_refcount.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/imagefiles/png_imagefile.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/imagefiles/render_imagefile.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/imagefiles/render_imagefileutil.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_log.h"

struct Scaleform::Render::PNG::PngContext
{
	png_struct_def * png_ptr; // 0x0
	png_info_def * info_ptr; // 0x8
	unsigned long width; // 0x10
	unsigned long height; // 0x14
	long bitDepth; // 0x18
	long colorType; // 0x1C
	long interlaceType; // 0x20
	unsigned long ulRowBytes; // 0x24
	char errorMessage[100]; // 0x28
	char filePath[256]; // 0x8C
};
void Scaleform::Render::PNG::png_error_handler(png_struct_def * png_ptr, const char * msg); // 0x14037E5B0
void Scaleform::Render::PNG::png_read_data(png_struct_def * png_ptr, unsigned char * data, unsigned long long length); // 0x14037E620
long Scaleform::Render::PNG::GFxPngReadInfo(Scaleform::Render::PNG::PngContext * context); // 0x14037E220
class Scaleform::Render::PNG::LibPNGInput :
	Scaleform::Render::PNG::Input
{
private:
	Scaleform::Render::PNG::PngContext Context; // 0x8
	Scaleform::Ptr<Scaleform::File> pFile; // 0x198
public:
	LibPNGInput(const Scaleform::Render::PNG::LibPNGInput &);
	LibPNGInput(Scaleform::File *);
private:
	LibPNGInput();
public:
	bool IsInitialized; // 0x1A0
	virtual long ReadData(void * *);
	virtual long ReadScanline(unsigned char *);
	bool IsValid();
	bool StartImage();
	virtual Scaleform::Render::Size<unsigned long> GetSize();
	virtual bool Decode(Scaleform::Render::ImageFormat, Scaleform::Render::ImageData *, void(*)(unsigned char *, const unsigned char *, unsigned long long, Scaleform::Render::Palette *, void *), void *);
	virtual ~LibPNGInput();
	Scaleform::Render::PNG::LibPNGInput & operator=(const Scaleform::Render::PNG::LibPNGInput &);
};
long Scaleform::Render::PNG::LibPNGInput::ReadData(void * * ppData); // 0x14037E3B0
long Scaleform::Render::PNG::LibPNGInput::ReadScanline(unsigned char * prgbData); // 0x14037E480
Scaleform::Render::PNG::LibPNGInput::LibPNGInput(Scaleform::File * pin); // 0x14037D980
bool Scaleform::Render::PNG::LibPNGInput::StartImage(); // 0x14037E4A0
Scaleform::Render::Size<unsigned long> Scaleform::Render::PNG::LibPNGInput::GetSize(); // 0x14065E700
bool Scaleform::Render::PNG::LibPNGInput::Decode(Scaleform::Render::ImageFormat format, Scaleform::Render::ImageData * pdest, void(*copyScanline)(unsigned char *, const unsigned char *, unsigned long long, Scaleform::Render::Palette *, void *), void * arg); // 0x14037DD10
class Scaleform::Render::ImageScanlineBuffer<4096> :
	Scaleform::Render::ImageScanlineBufferImpl
{
private:
	unsigned char TempBuffer[4096]; // 0x40
public:
	ImageScanlineBuffer<4096>(Scaleform::Render::ImageFormat, unsigned long, Scaleform::Render::ImageFormat);
	~ImageScanlineBuffer<4096>();
};
Scaleform::Render::PNG::FileReader Scaleform::Render::PNG::FileReader::Instance; // 0x1409F99E8
Scaleform::Render::PNG::FileWriter Scaleform::Render::PNG::FileWriter::Instance; // 0x1409F99F0
void(*Scaleform::Render::PNG::FileReader::nstance$initializer$::operator&)(); // 0x140739CE8
void(*Scaleform::Render::PNG::FileWriter::nstance$initializer$::operator&)(); // 0x140739CF0
class Scaleform::Render::PNG::MemoryBufferImage :
	Scaleform::Render::MemoryBufferImage
{
public:
	MemoryBufferImage(Scaleform::Render::PNG::MemoryBufferImage &);
	MemoryBufferImage(const Scaleform::Render::PNG::MemoryBufferImage &);
	MemoryBufferImage(Scaleform::Render::ImageFormat, const Scaleform::Render::Size<unsigned long> &, unsigned long, Scaleform::Render::ImageUpdateSync *, Scaleform::File *, long long, unsigned long long);
	virtual bool Decode(Scaleform::Render::ImageData *, void(*)(unsigned char *, const unsigned char *, unsigned long long, Scaleform::Render::Palette *, void *), void *);
	virtual ~MemoryBufferImage();
	Scaleform::Render::PNG::MemoryBufferImage & operator=(Scaleform::Render::PNG::MemoryBufferImage &);
	Scaleform::Render::PNG::MemoryBufferImage & operator=(const Scaleform::Render::PNG::MemoryBufferImage &);
};
bool Scaleform::Render::PNG::MemoryBufferImage::Decode(Scaleform::Render::ImageData * pdest, void(*copyScanline)(unsigned char *, const unsigned char *, unsigned long long, Scaleform::Render::Palette *, void *), void * arg); // 0x14037E070
class Scaleform::Render::PNG::PNGFileImageSource :
	Scaleform::Render::FileImageSource
{
private:
	Scaleform::Render::PNG::Input * pOriginalInput; // 0x38
public:
	PNGFileImageSource(const Scaleform::Render::PNG::PNGFileImageSource &);
	PNGFileImageSource(Scaleform::File *, Scaleform::Render::ImageFormat);
	virtual ~PNGFileImageSource();
	virtual bool Decode(Scaleform::Render::ImageData *, void(*)(unsigned char *, const unsigned char *, unsigned long long, Scaleform::Render::Palette *, void *), void *);
	virtual Scaleform::Render::Image * CreateCompatibleImage(const Scaleform::Render::ImageCreateArgs &);
	bool ReadHeader();
	virtual unsigned long GetMipmapCount();
	Scaleform::Render::PNG::PNGFileImageSource & operator=(const Scaleform::Render::PNG::PNGFileImageSource &);
};
unsigned long Scaleform::Render::MemoryBufferImage::GetMipmapCount(); // 0x1400482A0
bool Scaleform::Render::PNG::PNGFileImageSource::Decode(Scaleform::Render::ImageData * pdest, void(*copyScanline)(unsigned char *, const unsigned char *, unsigned long long, Scaleform::Render::Palette *, void *), void * arg); // 0x14037E1E0
bool Scaleform::Render::PNG::PNGFileImageSource::ReadHeader(); // 0x14037E3D0
Scaleform::Render::Image * Scaleform::Render::PNG::PNGFileImageSource::CreateCompatibleImage(const Scaleform::Render::ImageCreateArgs & args); // 0x14037DBD0
bool Scaleform::Render::PNG::FileReader::MatchFormat(Scaleform::File * file, unsigned char * headerArg, unsigned long long headerArgSize); // 0x14037D5B0
class Scaleform::Render::FileHeaderReader<8> :
	Scaleform::Render::FileHeaderReaderImpl
{
private:
	unsigned char Buffer[8]; // 0x8
public:
	FileHeaderReader<8>(Scaleform::File *, unsigned char *, unsigned long long);
	unsigned char operator[](unsigned long);
	bool operator bool();
	bool operator!();
};
Scaleform::Render::ImageSource * Scaleform::Render::PNG::FileReader::ReadImageSource(Scaleform::File * file, const Scaleform::Render::ImageCreateArgs & args); // 0x14037D620
Scaleform::Render::PNG::Input * Scaleform::Render::PNG::FileReader::CreateInput(Scaleform::File * pin); // 0x14037D540
void Scaleform::Render::PNG::png_write_data(png_struct_def * png_ptr, unsigned char * data, unsigned long long length); // 0x14037E680
bool Scaleform::Render::PNG::FileWriter::Write(Scaleform::File * file, const Scaleform::Render::ImageData & imageData, const Scaleform::Render::ImageWriteArgs * args); // 0x14037D6F0//decompilation failure at 1409F99E8!
//decompilation failure at 1409F99F0!
//decompilation failure at 140739CE8!
//decompilation failure at 140739CF0!
