#pragma once

struct std::binary_function<AgString,AgString,bool>
{
	class first_argument_type;
	class second_argument_type;
	typedef bool result_type;
};
struct AgArchiveMapCompare :
	std::binary_function<AgString,AgString,bool>
{
	bool operator()(const AgString &, const AgString &);
};
class AgArchive :
	AgMount
{
public:
	AgArchive(const AgString &, const AgString &);
	long containsFile(const AgString &);
	virtual AgPointer<AgDirectory> openDirectory(const AgPath &, AgStringRef, unsigned long);
	virtual AgPointer<AgFile> open(const AgPath &, unsigned long);
	virtual long exists(const AgPath &);
	void addOverlay(AgPointer<AgArchive>);
	void removeOverlay(AgPointer<AgArchive>);
protected:
	AgPointer<AgStream> createSourceStreamPtr();
	long isEncrypted();
	struct ArchiveEntry;
	struct DirectoryEntry;
private:
	virtual void mount();
	void _create(AgPointer<AgStream>);
	AgString m_sourceFileName; // 0x128
	std::map<AgString,AgArchive::ArchiveEntry,AgArchiveMapCompare,std::allocator<std::pair<AgString const ,AgArchive::ArchiveEntry> > > m_archiveEntries; // 0x138
	std::map<AgString,std::vector<AgArchive::DirectoryEntry,std::allocator<AgArchive::DirectoryEntry> >,AgArchiveMapCompare,std::allocator<std::pair<AgString const ,std::vector<AgArchive::DirectoryEntry,std::allocator<AgArchive::DirectoryEntry> > > > > m_directories; // 0x148
	class DirectoryMap;
	long m_isEncrypted; // 0x158
	unsigned long long m_archiveSize; // 0x160
	unsigned long long m_dataOffset; // 0x168
	class OverlayList;
	std::list<AgPointer<AgArchive>,std::allocator<AgPointer<AgArchive> > > m_overlays; // 0x170
public:
	virtual ~AgArchive();
};
long AgArchive::exists(const AgPath & path); // 0x14066EE10
class AgPointer<AgArchive>
{
public:
	AgPointer<AgArchive>(const AgReference<AgArchive> &);
	AgPointer<AgArchive>(AgPointer<AgArchive> &);
	AgPointer<AgArchive>(const AgPointer<AgArchive> &);
	AgPointer<AgArchive>(AgArchive *);
	AgPointer<AgArchive>();
	~AgPointer<AgArchive>();
	AgPointer<AgArchive> & operator=(AgPointer<AgArchive> &);
	AgPointer<AgArchive> & operator=(const AgReference<AgArchive> &);
	AgPointer<AgArchive> & operator=(const AgPointer<AgArchive> &);
	AgPointer<AgArchive> & operator=(AgArchive *);
	bool operator<(const AgPointer<AgArchive> &);
	AgArchive * operator->();
	AgArchive & operator*();
	bool operator==(const AgPointer<AgArchive> &);
	bool operator==(AgArchive *);
	bool operator!=(const AgPointer<AgArchive> &);
	bool operator!=(AgArchive *);
	AgArchive * getObject();
	void swap(AgPointer<AgArchive> &);
private:
	AgReferenceCount * m_ref; // 0x0
	AgArchive * m_ptr; // 0x8
};
class AgPointer<AgArchive>
{
public:
	AgPointer<AgArchive>(const AgReference<AgArchive> &);
	AgPointer<AgArchive>(AgPointer<AgArchive> &);
	AgPointer<AgArchive>(const AgPointer<AgArchive> &);
	AgPointer<AgArchive>(AgArchive *);
	AgPointer<AgArchive>();
	~AgPointer<AgArchive>();
	AgPointer<AgArchive> & operator=(AgPointer<AgArchive> &);
	AgPointer<AgArchive> & operator=(const AgReference<AgArchive> &);
	AgPointer<AgArchive> & operator=(const AgPointer<AgArchive> &);
	AgPointer<AgArchive> & operator=(AgArchive *);
	bool operator<(const AgPointer<AgArchive> &);
	AgArchive * operator->();
	AgArchive & operator*();
	bool operator==(const AgPointer<AgArchive> &);
	bool operator==(AgArchive *);
	bool operator!=(const AgPointer<AgArchive> &);
	bool operator!=(AgArchive *);
	AgArchive * getObject();
	void swap(AgPointer<AgArchive> &);
private:
	AgReferenceCount * m_ref; // 0x0
	AgArchive * m_ptr; // 0x8
public:
	AgPointer<AgMount> operator class AgPointer<class AgMount>();
};
struct AgArchive::ArchiveEntry
{
	AgString m_fileName; // 0x0
	unsigned long long m_offset; // 0x10
	unsigned long long m_size; // 0x18
	ArchiveEntry(AgArchive::ArchiveEntry &);
	ArchiveEntry(const AgArchive::ArchiveEntry &);
	ArchiveEntry();
	~ArchiveEntry();
	AgArchive::ArchiveEntry & operator=(AgArchive::ArchiveEntry &);
	AgArchive::ArchiveEntry & operator=(const AgArchive::ArchiveEntry &);
};
struct AgArchive::DirectoryEntry
{
	DirectoryEntry(AgArchive::DirectoryEntry &);
	DirectoryEntry(const AgArchive::DirectoryEntry &);
	DirectoryEntry(AgStringRef, long);
	AgString m_name; // 0x0
	long m_isDirectory; // 0x10
	~DirectoryEntry();
	AgArchive::DirectoryEntry & operator=(AgArchive::DirectoryEntry &);
	AgArchive::DirectoryEntry & operator=(const AgArchive::DirectoryEntry &);
};
class std::map<AgString,AgArchive::ArchiveEntry,AgArchiveMapCompare,std::allocator<std::pair<AgString const ,AgArchive::ArchiveEntry> > > :
	std::_Tree<std::_Tmap_traits<AgString,AgArchive::ArchiveEntry,AgArchiveMapCompare,std::allocator<std::pair<AgString const ,AgArchive::ArchiveEntry> >,0> >
{
	class _Myt;
	class _Mybase;
	class key_type;
	struct mapped_type;
	struct key_compare;
	class value_compare;
	class allocator_type;
	typedef unsigned long long size_type;
	typedef long long difference_type;
	typedef std::pair<AgString const ,AgArchive::ArchiveEntry> pointer;
	typedef const std::pair<AgString const ,AgArchive::ArchiveEntry> const_pointer;
	typedef std::pair<AgString const ,AgArchive::ArchiveEntry> reference;
