#include "dev/kof/master/development/source/baseproject/jni/game/effect/effectdata/effectdata.h"
#include "dev/kof/master/development/source/baseproject/jni/game/player/charafileformat/commanddataformat.h"
#include "dev/kof/master/development/source/baseproject/jni/game/network/netmanager.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_primitivebundle.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/thread/mutex.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thread"
#include "dev/kof/master/development/source/baseproject/jni/game/network/leaderboard.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_treecachenode.h"
#include "dev/kof/master/development/source/baseproject/jni/game/effect/chartdata.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/memory"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xmemory"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/unordered_map"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_treenode.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/gfx/gfx_loader.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thr/xthread"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_texturecache.h"
#include "program files (x86)/windows kits/8.1/include/um/winbase.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocinfo"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/mat_aos.h"
#include "dev/kof/master/development/source/baseproject/jni/game/battlehud/battlecall/battlecall.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/debug/logging.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vector"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_debug.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/baseproject/jni/game/collision/bodypush.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_shapedatadefs.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/heapmemory.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/cameracheck.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/player/materialshowcontrol.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/player/actionblackout.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/sound/ex_sound_manager.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/util/soundutil.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/system/battlecontroller.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/lib/etc/randommt.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/sound/ex_sound_bank.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglvec3.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/data/sounddata.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/collision/hitrectcollection.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/player/actor.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglmodel.cpp"

bool ActionSystem::Init(long maxPri); // 0x140173DA0
void ActionSystem::Final(); // 0x140174150
Actor * ActionSystem::Entry(Actor::ACTOR_TYPE type, long iPriority); // 0x140174390
void ActionSystem::Delete(ActionSystem::ActorList * pActorList); // 0x1401746B0
void ActionSystem::AllDelete(); // 0x140174AF0
void ActionSystem::SystemInit(); // 0x140174DE0
void ActionSystem::SystemUpdate(); // 0x1401750F0
void ActionSystem::PreCaller(long pri); // 0x140175220
void ActionSystem::MainCaller(long pri); // 0x1401752C0
void ActionSystem::LateCaller(long pri); // 0x140175350
void ActionSystem::PreCaller(long start, long end); // 0x1401753D0
void ActionSystem::MainCaller(long start, long end); // 0x1401754A0
class ActionSystem::DrawSort::__l2::<lambda_289fcd7df6e8d1f6025297f7637c435f>
{
public:
	bool operator()(Actor *, Actor *);
private:
	static bool <lambda_invoker_cdecl>(Actor *, Actor *);
	typedef char16_t(*<lambda_typedef_cdecl>)(Actor *, Actor *);
public:
	bool(*)(Actor *, Actor *) operator bool (__cdecl *)(class Actor *,class Actor *)();
private:
	static bool <lambda_invoker_vectorcall>(Actor *, Actor *);
	typedef char16_t(*<lambda_typedef_vectorcall>)(Actor *, Actor *);
public:
	bool(*)(Actor *, Actor *) operator bool (__vectorcall *)(class Actor *,class Actor *)();
	<lambda_289fcd7df6e8d1f6025297f7637c435f>(ActionSystem::DrawSort::__l2::<lambda_289fcd7df6e8d1f6025297f7637c435f> &);
	<lambda_289fcd7df6e8d1f6025297f7637c435f>();
	ActionSystem::DrawSort::__l2::<lambda_289fcd7df6e8d1f6025297f7637c435f> & operator=(const ActionSystem::DrawSort::__l2::<lambda_289fcd7df6e8d1f6025297f7637c435f> &);
};
void ActionSystem::DrawReqClear(); // 0x140175580
void ActionSystem::DrawCaller(long pri); // 0x1401755E0
void ActionSystem::DrawCaller(long start, long end); // 0x1401756A0
void ActionSystem::Run(Actor & actor); // 0x140175770
void ActionSystem::SetPlaySpeed(float speed); // 0x140176F30
ActorChara * ActionSystem::GetPlayerActor(long playerID); // 0x140176F60
MaterialShowControl & ActionSystem::GetDefaultMaterialData(Actor * pActor); // 0x140176F80
void ActionSystem::CheckThrowChildPlayer(long playerID); // 0x140176FC0
void ActionSystem::FuncCallRequest(long pri, std::function<void __cdecl(Actor &)> func); // 0x1401770C0
void ActionSystem::RequestSound(Actor & actor, const CharaActionData::Sound::Type::Play & sound); // 0x140177150
void <lambda_6a1020abf1e2e0c82b0c36eebbe62cd4>::operator()(long commonID, long uniqueID); // 0x140177500
class ActionSystem::RequestSound::__l2::<lambda_6a1020abf1e2e0c82b0c36eebbe62cd4>
{
public:
	void operator()(long, long);
	<lambda_6a1020abf1e2e0c82b0c36eebbe62cd4>(ActionSystem::RequestSound::__l2::<lambda_6a1020abf1e2e0c82b0c36eebbe62cd4> &);
	<lambda_6a1020abf1e2e0c82b0c36eebbe62cd4>();
	<lambda_6a1020abf1e2e0c82b0c36eebbe62cd4>(Actor &, long &, ActionSystem *, AppMain * &, const CharaActionData::Sound::Type::Play &, SoundUserFlag &, long &);
private:
	Actor & actor; // 0x0
	long & bankID; // 0x8
	ActionSystem * __this; // 0x10
	AppMain * & p; // 0x18
	const CharaActionData::Sound::Type::Play & sound; // 0x20
	SoundUserFlag & flag; // 0x28
	long & playerID; // 0x30
public:
	ActionSystem::RequestSound::__l2::<lambda_6a1020abf1e2e0c82b0c36eebbe62cd4> & operator=(const ActionSystem::RequestSound::__l2::<lambda_6a1020abf1e2e0c82b0c36eebbe62cd4> &);
};
const DamageAnnounceTerm damageAnnounceTerm[20]; // 0x14089FEA0
std::piecewise_construct_t std::piecewise_construct; // 0x14089E3AE
void ActionSystem::RequestSoundStop(Actor & actor, const CharaActionData::Sound::Type::Stop & sound); // 0x1401777B0
void ActionSystem::RequestSoundStop(unsigned long tagMask, float fadeSec); // 0x140177860
void ActionSystem::RequestSoundStopActionChange(Actor & actor); // 0x1401778C0
void ActionSystem::RequestSoundStopDamaged(Actor & actor); // 0x140177980
void ActionSystem::RequestSoundStopSuperCancel(Actor & actor); // 0x1401779F0
bool ActionSystem::CheckDependSound(const CharaBaseStatus * pStat, const extension::SoundHashKey & hash, Actor & actor, const long priority, const float volume, const unsigned long flag); // 0x140177A60
float ActionSystem::GetSoundPanPosition(float posX); // 0x140177E30
struct DamageAnnounceTerm
{
	long iDamage; // 0x0
	long iAnnounceID[2][2]; // 0x4
};
void ActionSystem::CheckComboDamageAnnounce(); // 0x140177EC0//decompilation failure at 14089FEA0!
//decompilation failure at 14089E3AE!
void __fastcall std::_Guess_median_unchecked<Actor * *,_lambda_289fcd7df6e8d1f6025297f7637c435f_>(
        Actor **_First,
        Actor **_Mid,
        Actor **_Last,
        ActionSystem::DrawSort::__l2::<lambda_289fcd7df6e8d1f6025297f7637c435f> *_Pred)
{
  signed __int64 v6; // rax
  __int64 v7; // rax
  unsigned __int64 v8; // rsi
  unsigned __int64 v9; // rdi
  Actor **v10; // rbp
  ActionSystem::DrawSort::__l2::<lambda_289fcd7df6e8d1f6025297f7637c435f> *v11; // r9
  ActionSystem::DrawSort::__l2::<lambda_289fcd7df6e8d1f6025297f7637c435f> *v12; // r9
  ActionSystem::DrawSort::__l2::<lambda_289fcd7df6e8d1f6025297f7637c435f> *v13; // r9

  v6 = _Last - _First;
  if ( v6 <= 40 )
  {
    std::_Med3_unchecked<Actor * *,_lambda_289fcd7df6e8d1f6025297f7637c435f_>(_First, _Mid, _Last, _Pred);
  }
  else
  {
