#pragma once

struct Scaleform::ArrayDefaultPolicy
{
	ArrayDefaultPolicy(const Scaleform::ArrayDefaultPolicy &);
	ArrayDefaultPolicy();
	unsigned long long GetMinCapacity();
	unsigned long long GetGranularity();
	bool NeverShrinking();
	unsigned long long GetCapacity();
	void SetCapacity(unsigned long long);
private:
	unsigned long long Capacity; // 0x0
};
Scaleform::ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy>(); // 0x1403E3710
Scaleform::ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy>(); // 0x140348920
Scaleform::ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1402EEA80
Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1402DD5A0
Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1402DD610
Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1402DD6A0
Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy>(); // 0x1403DF8A0
Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy>(); // 0x1403DF920
Scaleform::ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>(); // 0x14036DE00
Scaleform::ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy>(); // 0x140301780
Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1402F9850
Scaleform::ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::~ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(); // 0x140318210
Scaleform::ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::~ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(); // 0x1403182A0
Scaleform::ArrayDataBase<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::~ArrayDataBase<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(); // 0x140318320
Scaleform::ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy>(); // 0x140397940
Scaleform::ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1403979B0
Scaleform::ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1403979B0
Scaleform::ArrayDataBase<Scaleform::Render::MatrixPoolImpl::HMatrix,Scaleform::AllocatorLH<Scaleform::Render::MatrixPoolImpl::HMatrix,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::MatrixPoolImpl::HMatrix,Scaleform::AllocatorLH<Scaleform::Render::MatrixPoolImpl::HMatrix,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1403EC520
Scaleform::ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1403FDFD0
Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy>(); // 0x140574190
Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy>(); // 0x140556090
Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy>(); // 0x140348920
Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1404CD380
Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Object>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Object>,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Object>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Object>,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1404534D0
Scaleform::ArrayDataBase<Scaleform::Pair<Scaleform::GFx::ASString,unsigned long>,Scaleform::AllocatorDH<Scaleform::Pair<Scaleform::GFx::ASString,unsigned long>,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Pair<Scaleform::GFx::ASString,unsigned long>,Scaleform::AllocatorDH<Scaleform::Pair<Scaleform::GFx::ASString,unsigned long>,2>,Scaleform::ArrayDefaultPolicy>(); // 0x140598F30
Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::ASStringNode>,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::ASStringNode>,2>,Scaleform::ArrayDefaultPolicy>(); // 0x140598FA0
Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Impl::Triple<Scaleform::GFx::ASString,Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Impl::Triple<Scaleform::GFx::ASString,Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::AS3::Impl::Triple<Scaleform::GFx::ASString,Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Impl::Triple<Scaleform::GFx::ASString,Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1404EB8A0
Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1404534D0
Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1404EB910
Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy>(); // 0x1404533E0
Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy>(); // 0x140453460
Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>(); // 0x1404534D0
Scaleform::ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,2>,Scaleform::ArrayDefaultPolicy>::~ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,2>,Scaleform::ArrayDefaultPolicy>(); // 0x140453550
void Scaleform::ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>::ClearAndRelease(); // 0x1403FE720
void Scaleform::ArrayDataBase<Scaleform::RangeData<void * __ptr64>,Scaleform::AllocatorLH<Scaleform::RangeData<void * __ptr64>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14042C000
void Scaleform::ArrayDataBase<Scaleform::Render::Text::Style * __ptr64,Scaleform::AllocatorGH<Scaleform::Render::Text::Style * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<Scaleform::GFx::Text::CSSToken<wchar_t>,Scaleform::AllocatorGH<Scaleform::GFx::Text::CSSToken<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140370D00
void Scaleform::ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403E4160
void Scaleform::ArrayDataBase<Scaleform::GFx::DisplayList::DepthToIndexMapElem,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DepthToIndexMapElem,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14036E730
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorDH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14035B230
void Scaleform::ArrayDataBase<Scaleform::GFx::FontGlyphPacker::GlyphInfo,Scaleform::AllocatorGH<Scaleform::GFx::FontGlyphPacker::GlyphInfo,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14038BD50
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<int,Scaleform::AllocatorGH<int,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403DA7B0
void Scaleform::ArrayDataBase<Scaleform::GFx::FontData::AdvanceEntry,Scaleform::AllocatorLH<Scaleform::GFx::FontData::AdvanceEntry,261>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403DA860
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,261>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403DA910
void Scaleform::ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::GFx::ExecuteTag * __ptr64,Scaleform::AllocatorGH<Scaleform::GFx::ExecuteTag * __ptr64,2>,Scaleform::ArrayConstPolicy<32,16,0> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140347970
void Scaleform::ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<unsigned long,Scaleform::AllocatorGH<unsigned long,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403DA7B0
void Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140390890
void Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403FCA90
void Scaleform::ArrayDataBase<Scaleform::GFx::FontResource * __ptr64,Scaleform::AllocatorGH<Scaleform::GFx::FontResource * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14036E730
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieDataDef::FrameLabelInfo,Scaleform::AllocatorDH<Scaleform::GFx::MovieDataDef::FrameLabelInfo,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140342810
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieDataDef::SceneInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieDataDef::SceneInfo,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403428C0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140342970
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140342A20
void Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140392700
void Scaleform::ArrayDataBase<Scaleform::GFx::DisplayObject * __ptr64,Scaleform::AllocatorDH<Scaleform::GFx::DisplayObject * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A23E0
void Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14036E730
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140399D10
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::LevelInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::LevelInfo,327>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1402E8A40
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::MDKillListEntry,Scaleform::AllocatorGH<Scaleform::GFx::MovieImpl::MDKillListEntry,327>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1402E8AF0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,327>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1402E8C50
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1402E8BA0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403E3000
void Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403E30B0
void Scaleform::ArrayDataBase<Scaleform::GFx::TimelineSnapshot::SnapshotElement * __ptr64,Scaleform::AllocatorDH_POD<Scaleform::GFx::TimelineSnapshot::SnapshotElement * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A23E0
void Scaleform::ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,264>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403DD810
void Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextRecord * __ptr64,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord * __ptr64,258>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403F04B0
void Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14036E730
void Scaleform::ArrayDataBase<char,Scaleform::AllocatorGH<char,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140392700
void Scaleform::ArrayDataBase<Scaleform::GFx::ImportData::Symbol,Scaleform::AllocatorLH<Scaleform::GFx::ImportData::Symbol,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14036E730
void Scaleform::ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorGH<Scaleform::Render::TextureGlyph,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14038BD50
void Scaleform::ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14036E7E0
void Scaleform::ArrayDataBase<Scaleform::GFx::Task * __ptr64,Scaleform::AllocatorGH<Scaleform::GFx::Task * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403F6970
void Scaleform::ArrayDataBase<Scaleform::GFx::TextKeyMap::KeyMapEntry,Scaleform::AllocatorGH<Scaleform::GFx::TextKeyMap::KeyMapEntry,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140390890
void Scaleform::ArrayDataBase<Scaleform::MsgFormat::fmt_record,Scaleform::AllocatorGH_POD<Scaleform::MsgFormat::fmt_record,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140370D00
void Scaleform::ArrayDataBase<Scaleform::Waitable::HandlerStruct,Scaleform::AllocatorGH<Scaleform::Waitable::HandlerStruct,2>,Scaleform::ArrayConstPolicy<0,16,1> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140393040
void Scaleform::ArrayDataBase<Scaleform::Render::ImageFileHandler * __ptr64,Scaleform::AllocatorGH<Scaleform::Render::ImageFileHandler * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14040A580
void Scaleform::ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403428C0
void Scaleform::ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorGH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14038BD50
void Scaleform::ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorLH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14038BE00
void Scaleform::ArrayDataBase<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,Scaleform::AllocatorDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14038A8A0
void Scaleform::ArrayDataBase<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,Scaleform::AllocatorDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140400760
void Scaleform::ArrayDataBase<Scaleform::Render::Text::LineBuffer::Line * __ptr64,Scaleform::AllocatorLH<Scaleform::Render::Text::LineBuffer::Line * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14042C000
void Scaleform::ArrayDataBase<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,Scaleform::AllocatorLH<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<char,Scaleform::AllocatorLH<char,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14040A580
void Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,75>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140370C60
void Scaleform::ArrayDataBase<Scaleform::Render::ExternalFontWinAPI::GlyphType,Scaleform::AllocatorLH<Scaleform::Render::ExternalFontWinAPI::GlyphType,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140399D10
void Scaleform::ArrayDataBase<Scaleform::Render::Font::NativeHintingType,Scaleform::AllocatorGH<Scaleform::Render::Font::NativeHintingType,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140370D00
void Scaleform::ArrayDataBase<tagKERNINGPAIR,Scaleform::AllocatorGH<tagKERNINGPAIR,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<wchar_t,Scaleform::AllocatorLH<wchar_t,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140370DB0
void Scaleform::ArrayDataBase<Scaleform::Render::BundleEntry * __ptr64,Scaleform::AllocatorLH<Scaleform::Render::BundleEntry * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::Render::TreeRoot * __ptr64,Scaleform::AllocatorLH<Scaleform::Render::TreeRoot * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::Render::Point<long>,Scaleform::AllocatorGH<Scaleform::Render::Point<long>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Filter>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::Render::Filter>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<float,Scaleform::AllocatorLH_POD<float,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403506A0
void Scaleform::ArrayDataBase<Scaleform::Render::UserDataState::Data const * __ptr64,Scaleform::AllocatorLH<Scaleform::Render::UserDataState::Data const * __ptr64,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14031BA40
void Scaleform::ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14031BAF0
void Scaleform::ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14031BBA0
void Scaleform::ArrayDataBase<Scaleform::Render::HAL::RenderTargetEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::RenderTargetEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14031BC50
void Scaleform::ArrayDataBase<Scaleform::Render::Matrix3x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix3x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14031BD00
void Scaleform::ArrayDataBase<Scaleform::Render::Matrix4x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix4x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14031BDB0
void Scaleform::ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH<unsigned __int64,72>,Scaleform::ArrayConstPolicy<4,4,0> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140326AF0
void Scaleform::ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403428C0
void Scaleform::ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14036E730
void Scaleform::ArrayDataBase<Scaleform::Render::Matrix2x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix2x4<float>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140399D10
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Image>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Image>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14036E730
void Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14040A580
void Scaleform::ArrayDataBase<unsigned int,Scaleform::AllocatorLH_POD<unsigned int,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403506A0
void Scaleform::ArrayDataBase<Scaleform::Render::ShapeMeshProvider::DrawLayerType,Scaleform::AllocatorLH_POD<Scaleform::Render::ShapeMeshProvider::DrawLayerType,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140350750
void Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140350800
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Fence>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Fence>,2>,Scaleform::ArrayConstPolicy<128,64,1> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140396910
void Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,74>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14037FDD0
void Scaleform::ArrayDataBase<Scaleform::Render::TextNotifier * __ptr64,Scaleform::AllocatorDH_POD<Scaleform::Render::TextNotifier * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A23E0
void Scaleform::ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404006B0
void Scaleform::ArrayDataBase<Scaleform::Render::TextMeshLayer,Scaleform::AllocatorDH<Scaleform::Render::TextMeshLayer,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140400760
void Scaleform::ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,339>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14058DA10
void Scaleform::ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,340>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14058DAC0
void Scaleform::ArrayDataBase<unsigned char const * __ptr64,Scaleform::AllocatorLH_POD<unsigned char const * __ptr64,339>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14058DB70
void Scaleform::ArrayDataBase<Scaleform::Pair<unsigned __int64,unsigned char const * __ptr64>,Scaleform::AllocatorDH_POD<Scaleform::Pair<unsigned __int64,unsigned char const * __ptr64>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A2490
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::Multiname,340>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14058DC20
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::NamespaceInfo,340>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14058DCD0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,340>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14058DD80
void Scaleform::ArrayDataBase<long,Scaleform::AllocatorDH<long,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140510680
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140579C50
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140350800
void Scaleform::ArrayDataBase<double,Scaleform::AllocatorDH<double,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A23E0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::ASStringNode>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A23E0
void Scaleform::ArrayDataBase<long const * __ptr64,Scaleform::AllocatorDH<long const * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A23E0
void Scaleform::ArrayDataBase<Scaleform::Pair<double,unsigned long>,Scaleform::AllocatorDH<Scaleform::Pair<double,unsigned long>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A2490
void Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,328>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405105E0
void Scaleform::ArrayDataBase<unsigned long,Scaleform::AllocatorDH<unsigned long,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140510680
void Scaleform::ArrayDataBase<Scaleform::Pair<Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,Scaleform::AllocatorDH<Scaleform::Pair<Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A2490
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Impl::Triple<double,Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Impl::Triple<double,Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140342810
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A23E0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<long,Scaleform::AllocatorDH_POD<long,348>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A28C0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer * __ptr64,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::TR::Def * __ptr64,Scaleform::AllocatorDH_POD<Scaleform::GFx::AS3::TR::Def * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405A23E0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMAbcFile * __ptr64,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::VMAbcFile * __ptr64,329>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2970
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::ReadArgs::AlignedStruct,Scaleform::AllocatorDH<Scaleform::GFx::AS3::ReadArgs::AlignedStruct,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2FA0
void Scaleform::ArrayDataBase<Scaleform::GFx::Button::CharToRec,Scaleform::AllocatorLH<Scaleform::GFx::Button::CharToRec,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x14036E730
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2A20
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMExceptionInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionInfo,341>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2AD0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMMethodBodyInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMMethodBodyInfo,346>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2B80
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,323>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2C30
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2CE0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,343>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2D90
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,341>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2E40
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1406FAD40
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Multiname,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A2EF0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403F6970
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x140399D10
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,331>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A3050
void Scaleform::ArrayDataBase<Scaleform::GFx::Value,Scaleform::AllocatorGH_CPP<Scaleform::GFx::Value,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A3100
void Scaleform::ArrayDataBase<unsigned __int64,Scaleform::AllocatorDH_POD<unsigned __int64,348>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A32A0
void Scaleform::ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH_POD<unsigned __int64,347>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1404A3350
void Scaleform::ArrayDataBase<Scaleform::Render::GL::MeshBuffer * __ptr64,Scaleform::AllocatorLH<Scaleform::Render::GL::MeshBuffer * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,Scaleform::AllocatorLH<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,68>,Scaleform::ArrayConstPolicy<0,8,1> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405ED880
void Scaleform::ArrayDataBase<Scaleform::Render::TextureFormat * __ptr64,Scaleform::AllocatorLH<Scaleform::Render::TextureFormat * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1403652E0
void Scaleform::ArrayDataBase<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,Scaleform::AllocatorLH<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,67>,Scaleform::ArrayConstPolicy<8,8,0> >::Reserve(const void * pheapAddr, unsigned long long newCapacity); // 0x1405F7200
void Scaleform::ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403E4210
void Scaleform::ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403D0440
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14034A200
void Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorDH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14035B2E0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14030AF90
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,261>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403DABA0
void Scaleform::ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403653B0
void Scaleform::ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402EF4E0
void Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403FCB40
void Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403FCC00
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieDataDef::FrameLabelInfo,Scaleform::AllocatorDH<Scaleform::GFx::MovieDataDef::FrameLabelInfo,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140342B60
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieDataDef::SceneInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieDataDef::SceneInfo,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140342C00
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14030AF90
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140342CA0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140342D50
void Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402E9140
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::FontDesc,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::FontDesc,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402E9200
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402E92D0
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::LevelInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::LevelInfo,327>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402E9370
void Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::MDKillListEntry,Scaleform::AllocatorGH<Scaleform::GFx::MovieImpl::MDKillListEntry,327>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402E9430
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,327>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402E94F0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402E95A0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402E9650
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402E9700
void Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403E31D0
void Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403E3290
void Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403D0440
void Scaleform::ArrayDataBase<Scaleform::GFx::ImportData::Symbol,Scaleform::AllocatorLH<Scaleform::GFx::ImportData::Symbol,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14036E930
void Scaleform::ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorGH<Scaleform::Render::TextureGlyph,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14036E9D0
void Scaleform::ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14036EA90
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Task>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Task>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14031FD40
void Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403F6B20
void Scaleform::ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403093D0
void Scaleform::ArrayDataBase<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,Scaleform::AllocatorDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14038A950
void Scaleform::ArrayDataBase<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,Scaleform::AllocatorDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14038AA20
void Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402FFCA0
void Scaleform::ArrayDataBase<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,Scaleform::AllocatorLH<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1402FFD40
void Scaleform::ArrayDataBase<Scaleform::Render::Font::NativeHintingType,Scaleform::AllocatorGH<Scaleform::Render::Font::NativeHintingType,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140370FE0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14034A200
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Filter>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::Render::Filter>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14031FD40
void Scaleform::ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14031C130
void Scaleform::ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14031C210
void Scaleform::ArrayDataBase<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14031C2E0
void Scaleform::ArrayDataBase<Scaleform::Render::HAL::RenderTargetEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::RenderTargetEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14031C3A0
void Scaleform::ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140399E60
void Scaleform::ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140399F20
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Image>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Image>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140399FC0
void Scaleform::ArrayDataBase<Scaleform::Render::MatrixPoolImpl::HMatrix,Scaleform::AllocatorLH<Scaleform::Render::MatrixPoolImpl::HMatrix,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14039A070
void Scaleform::ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140399F20
void Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403508B0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Fence>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Fence>,2>,Scaleform::ArrayConstPolicy<128,64,1> >::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403969D0
void Scaleform::ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140400810
void Scaleform::ArrayDataBase<Scaleform::Render::TextMeshLayer,Scaleform::AllocatorDH<Scaleform::Render::TextMeshLayer,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404008D0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140579E40
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14055E770
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::ASStringNode>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x14058B2F0
void Scaleform::ArrayDataBase<Scaleform::Pair<Scaleform::GFx::ASString,unsigned long>,Scaleform::AllocatorDH<Scaleform::Pair<Scaleform::GFx::ASString,unsigned long>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1405A2890
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Impl::Triple<Scaleform::GFx::ASString,Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Impl::Triple<Scaleform::GFx::ASString,Scaleform::GFx::AS3::Value const * __ptr64,unsigned long>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1405109A0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140510A60
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140510B30
void Scaleform::ArrayDataBase<Scaleform::GFx::Button::CharToRec,Scaleform::AllocatorLH<Scaleform::GFx::Button::CharToRec,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403D0440
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A3800
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMExceptionTypeInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionTypeInfo,341>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A38D0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMMethodBodyInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMMethodBodyInfo,346>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A39A0
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::DisplayObjectBase>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::DisplayObjectBase>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A3A40
void Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,323>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A3AF0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A3BA0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140510B30
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,343>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A3C70
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Object>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Object>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x140510A60
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,341>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A3D40
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A3E10
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,329>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A3EE0
void Scaleform::ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1403653B0
void Scaleform::ArrayDataBase<Scaleform::GFx::ASString,Scaleform::AllocatorDH<Scaleform::GFx::ASString,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A3FB0
void Scaleform::ArrayDataBase<Scaleform::GFx::ASString,Scaleform::AllocatorLH<Scaleform::GFx::ASString,323>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A4060
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Multiname,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A4110
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A41D0
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A4270
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A4310
void Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,331>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A43B0
void Scaleform::ArrayDataBase<Scaleform::GFx::Value,Scaleform::AllocatorGH_CPP<Scaleform::GFx::Value,2>,Scaleform::ArrayDefaultPolicy>::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1404A4450
void Scaleform::ArrayDataBase<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,Scaleform::AllocatorLH<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,67>,Scaleform::ArrayConstPolicy<8,8,0> >::ResizeNoConstruct(const void * pheapAddr, unsigned long long newSize); // 0x1405F7350
struct Scaleform::ArrayDataBase<Scaleform::Waitable::HandlerStruct,Scaleform::AllocatorGH<Scaleform::Waitable::HandlerStruct,2>,Scaleform::ArrayConstPolicy<0,16,1> >
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Waitable::HandlerStruct,Scaleform::AllocatorGH<Scaleform::Waitable::HandlerStruct,2>,Scaleform::ArrayConstPolicy<0,16,1> >(const Scaleform::ArrayDataBase<Scaleform::Waitable::HandlerStruct,Scaleform::AllocatorGH<Scaleform::Waitable::HandlerStruct,2>,Scaleform::ArrayConstPolicy<0,16,1> > &);
	ArrayDataBase<Scaleform::Waitable::HandlerStruct,Scaleform::AllocatorGH<Scaleform::Waitable::HandlerStruct,2>,Scaleform::ArrayConstPolicy<0,16,1> >(const Scaleform::ArrayConstPolicy<0,16,1> &);
	ArrayDataBase<Scaleform::Waitable::HandlerStruct,Scaleform::AllocatorGH<Scaleform::Waitable::HandlerStruct,2>,Scaleform::ArrayConstPolicy<0,16,1> >();
	~ArrayDataBase<Scaleform::Waitable::HandlerStruct,Scaleform::AllocatorGH<Scaleform::Waitable::HandlerStruct,2>,Scaleform::ArrayConstPolicy<0,16,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Waitable::HandlerStruct * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,16,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,74>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,74>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,74>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,74>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,74>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,74>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<char,Scaleform::AllocatorLH<char,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<char,Scaleform::AllocatorLH<char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<char,Scaleform::AllocatorLH<char,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<char,Scaleform::AllocatorLH<char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<char,Scaleform::AllocatorLH<char,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<char,Scaleform::AllocatorLH<char,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::UserDataState::Data const *,Scaleform::AllocatorLH<Scaleform::Render::UserDataState::Data const *,2>,Scaleform::ArrayConstPolicy<0,8,1> >
{
	typedef const Scaleform::Render::UserDataState::Data ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::UserDataState::Data const *,Scaleform::AllocatorLH<Scaleform::Render::UserDataState::Data const *,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayDataBase<Scaleform::Render::UserDataState::Data const *,Scaleform::AllocatorLH<Scaleform::Render::UserDataState::Data const *,2>,Scaleform::ArrayConstPolicy<0,8,1> > &);
	ArrayDataBase<Scaleform::Render::UserDataState::Data const *,Scaleform::AllocatorLH<Scaleform::Render::UserDataState::Data const *,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayConstPolicy<0,8,1> &);
	ArrayDataBase<Scaleform::Render::UserDataState::Data const *,Scaleform::AllocatorLH<Scaleform::Render::UserDataState::Data const *,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	~ArrayDataBase<Scaleform::Render::UserDataState::Data const *,Scaleform::AllocatorLH<Scaleform::Render::UserDataState::Data const *,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	const Scaleform::Render::UserDataState::Data * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,8,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::HAL::RenderTargetEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::RenderTargetEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::HAL::RenderTargetEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::RenderTargetEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayDataBase<Scaleform::Render::HAL::RenderTargetEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::RenderTargetEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> > &);
	ArrayDataBase<Scaleform::Render::HAL::RenderTargetEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::RenderTargetEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayConstPolicy<0,8,1> &);
	ArrayDataBase<Scaleform::Render::HAL::RenderTargetEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::RenderTargetEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	~ArrayDataBase<Scaleform::Render::HAL::RenderTargetEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::RenderTargetEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::HAL::RenderTargetEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,8,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Matrix3x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix3x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Matrix3x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix3x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayDataBase<Scaleform::Render::Matrix3x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix3x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> > &);
	ArrayDataBase<Scaleform::Render::Matrix3x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix3x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayConstPolicy<0,8,1> &);
	ArrayDataBase<Scaleform::Render::Matrix3x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix3x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	~ArrayDataBase<Scaleform::Render::Matrix3x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix3x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Matrix3x4<float> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,8,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> > &);
	ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayConstPolicy<0,8,1> &);
	ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	~ArrayDataBase<Scaleform::Render::HAL::BlendModeStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::BlendModeStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::HAL::BlendModeStackEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,8,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH<unsigned __int64,72>,Scaleform::ArrayConstPolicy<4,4,0> >
{
	typedef unsigned long long ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH<unsigned __int64,72>,Scaleform::ArrayConstPolicy<4,4,0> >(const Scaleform::ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH<unsigned __int64,72>,Scaleform::ArrayConstPolicy<4,4,0> > &);
	ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH<unsigned __int64,72>,Scaleform::ArrayConstPolicy<4,4,0> >(const Scaleform::ArrayConstPolicy<4,4,0> &);
	ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH<unsigned __int64,72>,Scaleform::ArrayConstPolicy<4,4,0> >();
	~ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH<unsigned __int64,72>,Scaleform::ArrayConstPolicy<4,4,0> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned long long * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<4,4,0> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::Render::ContextImpl::ContextCaptureNotify> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::TextureFormat *,Scaleform::AllocatorLH<Scaleform::Render::TextureFormat *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::Render::TextureFormat ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::TextureFormat *,Scaleform::AllocatorLH<Scaleform::Render::TextureFormat *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::TextureFormat *,Scaleform::AllocatorLH<Scaleform::Render::TextureFormat *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::TextureFormat *,Scaleform::AllocatorLH<Scaleform::Render::TextureFormat *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::TextureFormat *,Scaleform::AllocatorLH<Scaleform::Render::TextureFormat *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::TextureFormat *,Scaleform::AllocatorLH<Scaleform::Render::TextureFormat *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::TextureFormat * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::MemberValue,Scaleform::AllocatorGH_CPP<Scaleform::GFx::MemberValue,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::MemberValue,Scaleform::AllocatorGH_CPP<Scaleform::GFx::MemberValue,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::MemberValue,Scaleform::AllocatorGH_CPP<Scaleform::GFx::MemberValue,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::MemberValue,Scaleform::AllocatorGH_CPP<Scaleform::GFx::MemberValue,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::MemberValue,Scaleform::AllocatorGH_CPP<Scaleform::GFx::MemberValue,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::MemberValue,Scaleform::AllocatorGH_CPP<Scaleform::GFx::MemberValue,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::MemberValue * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<char,Scaleform::AllocatorGH<char,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<char,Scaleform::AllocatorGH<char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<char,Scaleform::AllocatorGH<char,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<char,Scaleform::AllocatorGH<char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<char,Scaleform::AllocatorGH<char,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<char,Scaleform::AllocatorGH<char,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<wchar_t,Scaleform::AllocatorLH<wchar_t,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef wchar_t ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<wchar_t,Scaleform::AllocatorLH<wchar_t,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<wchar_t,Scaleform::AllocatorLH<wchar_t,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<wchar_t,Scaleform::AllocatorLH<wchar_t,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<wchar_t,Scaleform::AllocatorLH<wchar_t,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<wchar_t,Scaleform::AllocatorLH<wchar_t,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	wchar_t * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::ExternalFontWinAPI::GlyphType,Scaleform::AllocatorLH<Scaleform::Render::ExternalFontWinAPI::GlyphType,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::ExternalFontWinAPI::GlyphType,Scaleform::AllocatorLH<Scaleform::Render::ExternalFontWinAPI::GlyphType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::ExternalFontWinAPI::GlyphType,Scaleform::AllocatorLH<Scaleform::Render::ExternalFontWinAPI::GlyphType,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::ExternalFontWinAPI::GlyphType,Scaleform::AllocatorLH<Scaleform::Render::ExternalFontWinAPI::GlyphType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::ExternalFontWinAPI::GlyphType,Scaleform::AllocatorLH<Scaleform::Render::ExternalFontWinAPI::GlyphType,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::ExternalFontWinAPI::GlyphType,Scaleform::AllocatorLH<Scaleform::Render::ExternalFontWinAPI::GlyphType,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::ExternalFontWinAPI::GlyphType * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Font::NativeHintingType,Scaleform::AllocatorGH<Scaleform::Render::Font::NativeHintingType,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Font::NativeHintingType,Scaleform::AllocatorGH<Scaleform::Render::Font::NativeHintingType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Font::NativeHintingType,Scaleform::AllocatorGH<Scaleform::Render::Font::NativeHintingType,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Font::NativeHintingType,Scaleform::AllocatorGH<Scaleform::Render::Font::NativeHintingType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Font::NativeHintingType,Scaleform::AllocatorGH<Scaleform::Render::Font::NativeHintingType,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Font::NativeHintingType,Scaleform::AllocatorGH<Scaleform::Render::Font::NativeHintingType,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Font::NativeHintingType * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayDataBase<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> > &);
	ArrayDataBase<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayConstPolicy<0,8,1> &);
	ArrayDataBase<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	~ArrayDataBase<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::HAL::MaskStackEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,8,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::TextKeyMap::KeyMapEntry,Scaleform::AllocatorGH<Scaleform::GFx::TextKeyMap::KeyMapEntry,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::TextKeyMap::KeyMapEntry,Scaleform::AllocatorGH<Scaleform::GFx::TextKeyMap::KeyMapEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::TextKeyMap::KeyMapEntry,Scaleform::AllocatorGH<Scaleform::GFx::TextKeyMap::KeyMapEntry,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::TextKeyMap::KeyMapEntry,Scaleform::AllocatorGH<Scaleform::GFx::TextKeyMap::KeyMapEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::TextKeyMap::KeyMapEntry,Scaleform::AllocatorGH<Scaleform::GFx::TextKeyMap::KeyMapEntry,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::TextKeyMap::KeyMapEntry,Scaleform::AllocatorGH<Scaleform::GFx::TextKeyMap::KeyMapEntry,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::TextKeyMap::KeyMapEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Image>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Image>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Image>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Image>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Image>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Image>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Image>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Image>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Image>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Image>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Image>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Image>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::Render::Image> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> > * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> > &);
	ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayConstPolicy<0,8,1> &);
	ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	~ArrayDataBase<Scaleform::Render::HAL::FilterStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::FilterStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::HAL::FilterStackEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,8,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorLH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::StrokeStyleType * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<float,Scaleform::AllocatorLH_POD<float,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef float ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<float,Scaleform::AllocatorLH_POD<float,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<float,Scaleform::AllocatorLH_POD<float,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<float,Scaleform::AllocatorLH_POD<float,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<float,Scaleform::AllocatorLH_POD<float,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<float,Scaleform::AllocatorLH_POD<float,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	float * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::TreeRoot *,Scaleform::AllocatorLH<Scaleform::Render::TreeRoot *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::Render::TreeRoot ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::TreeRoot *,Scaleform::AllocatorLH<Scaleform::Render::TreeRoot *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::TreeRoot *,Scaleform::AllocatorLH<Scaleform::Render::TreeRoot *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::TreeRoot *,Scaleform::AllocatorLH<Scaleform::Render::TreeRoot *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::TreeRoot *,Scaleform::AllocatorLH<Scaleform::Render::TreeRoot *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::TreeRoot *,Scaleform::AllocatorLH<Scaleform::Render::TreeRoot *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::TreeRoot * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::BundleEntry *,Scaleform::AllocatorLH<Scaleform::Render::BundleEntry *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::Render::BundleEntry ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::BundleEntry *,Scaleform::AllocatorLH<Scaleform::Render::BundleEntry *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::BundleEntry *,Scaleform::AllocatorLH<Scaleform::Render::BundleEntry *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::BundleEntry *,Scaleform::AllocatorLH<Scaleform::Render::BundleEntry *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::BundleEntry *,Scaleform::AllocatorLH<Scaleform::Render::BundleEntry *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::BundleEntry *,Scaleform::AllocatorLH<Scaleform::Render::BundleEntry *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::BundleEntry * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,Scaleform::AllocatorLH<Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::ComplexPrimitiveBundle::InstanceEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Matrix4x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix4x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Matrix4x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix4x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayDataBase<Scaleform::Render::Matrix4x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix4x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> > &);
	ArrayDataBase<Scaleform::Render::Matrix4x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix4x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayConstPolicy<0,8,1> &);
	ArrayDataBase<Scaleform::Render::Matrix4x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix4x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	~ArrayDataBase<Scaleform::Render::Matrix4x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix4x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Matrix4x4<float> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,8,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Filter>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::Render::Filter>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Filter>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::Render::Filter>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Filter>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::Render::Filter>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Filter>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::Render::Filter>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Filter>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::Render::Filter>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Filter>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::Render::Filter>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::Render::Filter> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,75>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,75>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,75>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,75>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,75>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,75>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::ComplexMesh::FillRecord,Scaleform::AllocatorLH<Scaleform::Render::ComplexMesh::FillRecord,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::ComplexMesh::FillRecord * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Text::LineBuffer::Line *,Scaleform::AllocatorLH<Scaleform::Render::Text::LineBuffer::Line *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::Render::Text::LineBuffer::Line ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Text::LineBuffer::Line *,Scaleform::AllocatorLH<Scaleform::Render::Text::LineBuffer::Line *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Text::LineBuffer::Line *,Scaleform::AllocatorLH<Scaleform::Render::Text::LineBuffer::Line *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Text::LineBuffer::Line *,Scaleform::AllocatorLH<Scaleform::Render::Text::LineBuffer::Line *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Text::LineBuffer::Line *,Scaleform::AllocatorLH<Scaleform::Render::Text::LineBuffer::Line *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Text::LineBuffer::Line *,Scaleform::AllocatorLH<Scaleform::Render::Text::LineBuffer::Line *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Text::LineBuffer::Line * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned int,Scaleform::AllocatorLH_POD<unsigned int,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned long ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned int,Scaleform::AllocatorLH_POD<unsigned int,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned int,Scaleform::AllocatorLH_POD<unsigned int,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned int,Scaleform::AllocatorLH_POD<unsigned int,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned int,Scaleform::AllocatorLH_POD<unsigned int,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned int,Scaleform::AllocatorLH_POD<unsigned int,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned long * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorLH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorLH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorLH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorLH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorLH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorLH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Text::HighlightDesc * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,Scaleform::AllocatorLH<Scaleform::Render::Text::DocView::ImageSubstitutor::Element,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Text::DocView::ImageSubstitutor::Element * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,Scaleform::AllocatorLH<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,Scaleform::AllocatorLH<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,Scaleform::AllocatorLH<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,Scaleform::AllocatorLH<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,Scaleform::AllocatorLH<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,Scaleform::AllocatorLH<Scaleform::Render::Text::StyledText::ParagraphPtrWrapper,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Text::StyledText::ParagraphPtrWrapper * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::MatrixPoolImpl::HMatrix,Scaleform::AllocatorLH<Scaleform::Render::MatrixPoolImpl::HMatrix,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::MatrixPoolImpl::HMatrix,Scaleform::AllocatorLH<Scaleform::Render::MatrixPoolImpl::HMatrix,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::MatrixPoolImpl::HMatrix,Scaleform::AllocatorLH<Scaleform::Render::MatrixPoolImpl::HMatrix,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::MatrixPoolImpl::HMatrix,Scaleform::AllocatorLH<Scaleform::Render::MatrixPoolImpl::HMatrix,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::MatrixPoolImpl::HMatrix,Scaleform::AllocatorLH<Scaleform::Render::MatrixPoolImpl::HMatrix,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::MatrixPoolImpl::HMatrix,Scaleform::AllocatorLH<Scaleform::Render::MatrixPoolImpl::HMatrix,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::MatrixPoolImpl::HMatrix * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Fence>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Fence>,2>,Scaleform::ArrayConstPolicy<128,64,1> >
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Fence>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Fence>,2>,Scaleform::ArrayConstPolicy<128,64,1> >(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Fence>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Fence>,2>,Scaleform::ArrayConstPolicy<128,64,1> > &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Fence>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Fence>,2>,Scaleform::ArrayConstPolicy<128,64,1> >(const Scaleform::ArrayConstPolicy<128,64,1> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Fence>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Fence>,2>,Scaleform::ArrayConstPolicy<128,64,1> >();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::Render::Fence>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::Render::Fence>,2>,Scaleform::ArrayConstPolicy<128,64,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::Render::Fence> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<128,64,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Matrix2x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix2x4<float>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Matrix2x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix2x4<float>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Matrix2x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix2x4<float>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Matrix2x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix2x4<float>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Matrix2x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix2x4<float>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Matrix2x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix2x4<float>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Matrix2x4<float> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::ShapeMeshProvider::DrawLayerType,Scaleform::AllocatorLH_POD<Scaleform::Render::ShapeMeshProvider::DrawLayerType,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::ShapeMeshProvider::DrawLayerType,Scaleform::AllocatorLH_POD<Scaleform::Render::ShapeMeshProvider::DrawLayerType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::ShapeMeshProvider::DrawLayerType,Scaleform::AllocatorLH_POD<Scaleform::Render::ShapeMeshProvider::DrawLayerType,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::ShapeMeshProvider::DrawLayerType,Scaleform::AllocatorLH_POD<Scaleform::Render::ShapeMeshProvider::DrawLayerType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::ShapeMeshProvider::DrawLayerType,Scaleform::AllocatorLH_POD<Scaleform::Render::ShapeMeshProvider::DrawLayerType,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::ShapeMeshProvider::DrawLayerType,Scaleform::AllocatorLH_POD<Scaleform::Render::ShapeMeshProvider::DrawLayerType,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::ShapeMeshProvider::DrawLayerType * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Primitive::MeshEntry,Scaleform::AllocatorLH<Scaleform::Render::Primitive::MeshEntry,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Primitive::MeshEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::ImageFileHandler *,Scaleform::AllocatorGH<Scaleform::Render::ImageFileHandler *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::Render::ImageFileHandler ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::ImageFileHandler *,Scaleform::AllocatorGH<Scaleform::Render::ImageFileHandler *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::ImageFileHandler *,Scaleform::AllocatorGH<Scaleform::Render::ImageFileHandler *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::ImageFileHandler *,Scaleform::AllocatorGH<Scaleform::Render::ImageFileHandler *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::ImageFileHandler *,Scaleform::AllocatorGH<Scaleform::Render::ImageFileHandler *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::ImageFileHandler *,Scaleform::AllocatorGH<Scaleform::Render::ImageFileHandler *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::ImageFileHandler * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorLH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::FillStyleType * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,Scaleform::AllocatorLH<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,68>,Scaleform::ArrayConstPolicy<0,8,1> >
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,Scaleform::AllocatorLH<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,68>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayDataBase<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,Scaleform::AllocatorLH<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,68>,Scaleform::ArrayConstPolicy<0,8,1> > &);
	ArrayDataBase<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,Scaleform::AllocatorLH<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,68>,Scaleform::ArrayConstPolicy<0,8,1> >(const Scaleform::ArrayConstPolicy<0,8,1> &);
	ArrayDataBase<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,Scaleform::AllocatorLH<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,68>,Scaleform::ArrayConstPolicy<0,8,1> >();
	~ArrayDataBase<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,Scaleform::AllocatorLH<Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry,68>,Scaleform::ArrayConstPolicy<0,8,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::MeshBuffer::MeshBufferUpdateEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,8,1> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,Scaleform::AllocatorLH<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,67>,Scaleform::ArrayConstPolicy<8,8,0> >
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,Scaleform::AllocatorLH<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,67>,Scaleform::ArrayConstPolicy<8,8,0> >(const Scaleform::ArrayDataBase<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,Scaleform::AllocatorLH<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,67>,Scaleform::ArrayConstPolicy<8,8,0> > &);
	ArrayDataBase<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,Scaleform::AllocatorLH<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,67>,Scaleform::ArrayConstPolicy<8,8,0> >(const Scaleform::ArrayConstPolicy<8,8,0> &);
	ArrayDataBase<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,Scaleform::AllocatorLH<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,67>,Scaleform::ArrayConstPolicy<8,8,0> >();
	~ArrayDataBase<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,Scaleform::AllocatorLH<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,67>,Scaleform::ArrayConstPolicy<8,8,0> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<8,8,0> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::GL::MeshBuffer *,Scaleform::AllocatorLH<Scaleform::Render::GL::MeshBuffer *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::Render::GL::MeshBuffer ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::GL::MeshBuffer *,Scaleform::AllocatorLH<Scaleform::Render::GL::MeshBuffer *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::GL::MeshBuffer *,Scaleform::AllocatorLH<Scaleform::Render::GL::MeshBuffer *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::GL::MeshBuffer *,Scaleform::AllocatorLH<Scaleform::Render::GL::MeshBuffer *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::GL::MeshBuffer *,Scaleform::AllocatorLH<Scaleform::Render::GL::MeshBuffer *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::GL::MeshBuffer *,Scaleform::AllocatorLH<Scaleform::Render::GL::MeshBuffer *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::GL::MeshBuffer * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::AmpMovieObjectDesc>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::AmpMovieObjectDesc> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::MovieDefImpl> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::FontData::AdvanceEntry,Scaleform::AllocatorLH<Scaleform::GFx::FontData::AdvanceEntry,261>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::FontData::AdvanceEntry,Scaleform::AllocatorLH<Scaleform::GFx::FontData::AdvanceEntry,261>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::FontData::AdvanceEntry,Scaleform::AllocatorLH<Scaleform::GFx::FontData::AdvanceEntry,261>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::FontData::AdvanceEntry,Scaleform::AllocatorLH<Scaleform::GFx::FontData::AdvanceEntry,261>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::FontData::AdvanceEntry,Scaleform::AllocatorLH<Scaleform::GFx::FontData::AdvanceEntry,261>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::FontData::AdvanceEntry,Scaleform::AllocatorLH<Scaleform::GFx::FontData::AdvanceEntry,261>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::FontData::AdvanceEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::MovieDefImpl> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::WeakPtr<Scaleform::GFx::InteractiveObject> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned long,Scaleform::AllocatorGH<unsigned long,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned long ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned long,Scaleform::AllocatorGH<unsigned long,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned long,Scaleform::AllocatorGH<unsigned long,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned long,Scaleform::AllocatorGH<unsigned long,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned long,Scaleform::AllocatorGH<unsigned long,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned long,Scaleform::AllocatorGH<unsigned long,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned long * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::TimelineDef::Frame * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::ImportData::Symbol,Scaleform::AllocatorLH<Scaleform::GFx::ImportData::Symbol,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::ImportData::Symbol,Scaleform::AllocatorLH<Scaleform::GFx::ImportData::Symbol,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::ImportData::Symbol,Scaleform::AllocatorLH<Scaleform::GFx::ImportData::Symbol,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::ImportData::Symbol,Scaleform::AllocatorLH<Scaleform::GFx::ImportData::Symbol,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::ImportData::Symbol,Scaleform::AllocatorLH<Scaleform::GFx::ImportData::Symbol,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::ImportData::Symbol,Scaleform::AllocatorLH<Scaleform::GFx::ImportData::Symbol,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::ImportData::Symbol * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::TextureGlyph * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,261>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,261>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,261>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,261>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,261>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ShapeDataBase>,261>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::ShapeDataBase> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::RangeData<void *>,Scaleform::AllocatorLH<Scaleform::RangeData<void *>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::RangeData<void *>,Scaleform::AllocatorLH<Scaleform::RangeData<void *>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::RangeData<void *>,Scaleform::AllocatorLH<Scaleform::RangeData<void *>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::RangeData<void *>,Scaleform::AllocatorLH<Scaleform::RangeData<void *>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::RangeData<void *>,Scaleform::AllocatorLH<Scaleform::RangeData<void *>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::RangeData<void *>,Scaleform::AllocatorLH<Scaleform::RangeData<void *>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::RangeData<void *> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Text::Style *,Scaleform::AllocatorGH<Scaleform::Render::Text::Style *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::Render::Text::Style ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Text::Style *,Scaleform::AllocatorGH<Scaleform::Render::Text::Style *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Text::Style *,Scaleform::AllocatorGH<Scaleform::Render::Text::Style *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Text::Style *,Scaleform::AllocatorGH<Scaleform::Render::Text::Style *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Text::Style *,Scaleform::AllocatorGH<Scaleform::Render::Text::Style *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Text::Style *,Scaleform::AllocatorGH<Scaleform::Render::Text::Style *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Text::Style * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::Text::CSSToken<wchar_t>,Scaleform::AllocatorGH<Scaleform::GFx::Text::CSSToken<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::Text::CSSToken<wchar_t>,Scaleform::AllocatorGH<Scaleform::GFx::Text::CSSToken<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::Text::CSSToken<wchar_t>,Scaleform::AllocatorGH<Scaleform::GFx::Text::CSSToken<wchar_t>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::Text::CSSToken<wchar_t>,Scaleform::AllocatorGH<Scaleform::GFx::Text::CSSToken<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::Text::CSSToken<wchar_t>,Scaleform::AllocatorGH<Scaleform::GFx::Text::CSSToken<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::Text::CSSToken<wchar_t>,Scaleform::AllocatorGH<Scaleform::GFx::Text::CSSToken<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::Text::CSSToken<wchar_t> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorGH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char,Scaleform::AllocatorGH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorGH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorGH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorGH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned char,Scaleform::AllocatorGH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,327>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,327>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,327>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf>,327>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::ASIntervalTimerIntf> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::MovieImpl::IndirectTransPair,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::IndirectTransPair,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::MovieImpl::IndirectTransPair * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::InteractiveObject> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDataDef>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::MovieDataDef> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextRecord::GlyphEntry,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord::GlyphEntry,258>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::StaticTextRecord::GlyphEntry,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord::GlyphEntry,258>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextRecord::GlyphEntry,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord::GlyphEntry,258>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::StaticTextRecord::GlyphEntry,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord::GlyphEntry,258>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::StaticTextRecord::GlyphEntry,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord::GlyphEntry,258>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::StaticTextRecord::GlyphEntry,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord::GlyphEntry,258>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::StaticTextRecord::GlyphEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::MDKillListEntry,Scaleform::AllocatorGH<Scaleform::GFx::MovieImpl::MDKillListEntry,327>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::MovieImpl::MDKillListEntry,Scaleform::AllocatorGH<Scaleform::GFx::MovieImpl::MDKillListEntry,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::MDKillListEntry,Scaleform::AllocatorGH<Scaleform::GFx::MovieImpl::MDKillListEntry,327>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::MovieImpl::MDKillListEntry,Scaleform::AllocatorGH<Scaleform::GFx::MovieImpl::MDKillListEntry,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::MovieImpl::MDKillListEntry,Scaleform::AllocatorGH<Scaleform::GFx::MovieImpl::MDKillListEntry,327>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::MovieImpl::MDKillListEntry,Scaleform::AllocatorGH<Scaleform::GFx::MovieImpl::MDKillListEntry,327>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::MovieImpl::MDKillListEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,264>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,264>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,264>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,264>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,264>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,264>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::TimelineDef::Frame * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextRecord *,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord *,258>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::StaticTextRecord ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::StaticTextRecord *,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord *,258>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextRecord *,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord *,258>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::StaticTextRecord *,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord *,258>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::StaticTextRecord *,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord *,258>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::StaticTextRecord *,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord *,258>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::StaticTextRecord * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::FontDesc,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::FontDesc,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::MovieImpl::FontDesc,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::FontDesc,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::FontDesc,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::FontDesc,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::MovieImpl::FontDesc,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::FontDesc,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::MovieImpl::FontDesc,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::FontDesc,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::MovieImpl::FontDesc,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::FontDesc,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::MovieImpl::FontDesc * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::DisplayList::DepthToIndexMapElem,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DepthToIndexMapElem,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::DisplayList::DepthToIndexMapElem,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DepthToIndexMapElem,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::DisplayList::DepthToIndexMapElem,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DepthToIndexMapElem,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::DisplayList::DepthToIndexMapElem,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DepthToIndexMapElem,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::DisplayList::DepthToIndexMapElem,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DepthToIndexMapElem,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::DisplayList::DepthToIndexMapElem,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DepthToIndexMapElem,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::DisplayList::DepthToIndexMapElem * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Point<float>,Scaleform::AllocatorLH<Scaleform::Render::Point<float>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Point<float>,Scaleform::AllocatorLH<Scaleform::Render::Point<float>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Point<float>,Scaleform::AllocatorLH<Scaleform::Render::Point<float>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Point<float>,Scaleform::AllocatorLH<Scaleform::Render::Point<float>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Point<float>,Scaleform::AllocatorLH<Scaleform::Render::Point<float>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Point<float>,Scaleform::AllocatorLH<Scaleform::Render::Point<float>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Point<float> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::LevelInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::LevelInfo,327>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::MovieImpl::LevelInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::LevelInfo,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::MovieImpl::LevelInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::LevelInfo,327>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::MovieImpl::LevelInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::LevelInfo,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::MovieImpl::LevelInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::LevelInfo,327>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::MovieImpl::LevelInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieImpl::LevelInfo,327>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::MovieImpl::LevelInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::DisplayList::DisplayEntry,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DisplayEntry,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::DisplayList::DisplayEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::ExecuteTag *,Scaleform::AllocatorGH<Scaleform::GFx::ExecuteTag *,2>,Scaleform::ArrayConstPolicy<32,16,0> >
{
	typedef Scaleform::GFx::ExecuteTag ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::ExecuteTag *,Scaleform::AllocatorGH<Scaleform::GFx::ExecuteTag *,2>,Scaleform::ArrayConstPolicy<32,16,0> >(const Scaleform::ArrayDataBase<Scaleform::GFx::ExecuteTag *,Scaleform::AllocatorGH<Scaleform::GFx::ExecuteTag *,2>,Scaleform::ArrayConstPolicy<32,16,0> > &);
	ArrayDataBase<Scaleform::GFx::ExecuteTag *,Scaleform::AllocatorGH<Scaleform::GFx::ExecuteTag *,2>,Scaleform::ArrayConstPolicy<32,16,0> >(const Scaleform::ArrayConstPolicy<32,16,0> &);
	ArrayDataBase<Scaleform::GFx::ExecuteTag *,Scaleform::AllocatorGH<Scaleform::GFx::ExecuteTag *,2>,Scaleform::ArrayConstPolicy<32,16,0> >();
	~ArrayDataBase<Scaleform::GFx::ExecuteTag *,Scaleform::AllocatorGH<Scaleform::GFx::ExecuteTag *,2>,Scaleform::ArrayConstPolicy<32,16,0> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::ExecuteTag * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<32,16,0> Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::ButtonRecord,Scaleform::AllocatorLH<Scaleform::GFx::ButtonRecord,258>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::ButtonRecord * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,258>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,258>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,258>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,258>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,258>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::ButtonActionBase>,258>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::ButtonActionBase> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::Button::CharToRec,Scaleform::AllocatorLH<Scaleform::GFx::Button::CharToRec,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::Button::CharToRec,Scaleform::AllocatorLH<Scaleform::GFx::Button::CharToRec,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::Button::CharToRec,Scaleform::AllocatorLH<Scaleform::GFx::Button::CharToRec,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::Button::CharToRec,Scaleform::AllocatorLH<Scaleform::GFx::Button::CharToRec,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::Button::CharToRec,Scaleform::AllocatorLH<Scaleform::GFx::Button::CharToRec,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::Button::CharToRec,Scaleform::AllocatorLH<Scaleform::GFx::Button::CharToRec,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::Button::CharToRec * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::FontGlyphPacker::GlyphInfo,Scaleform::AllocatorGH<Scaleform::GFx::FontGlyphPacker::GlyphInfo,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::FontGlyphPacker::GlyphInfo,Scaleform::AllocatorGH<Scaleform::GFx::FontGlyphPacker::GlyphInfo,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::FontGlyphPacker::GlyphInfo,Scaleform::AllocatorGH<Scaleform::GFx::FontGlyphPacker::GlyphInfo,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::FontGlyphPacker::GlyphInfo,Scaleform::AllocatorGH<Scaleform::GFx::FontGlyphPacker::GlyphInfo,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::FontGlyphPacker::GlyphInfo,Scaleform::AllocatorGH<Scaleform::GFx::FontGlyphPacker::GlyphInfo,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::FontGlyphPacker::GlyphInfo,Scaleform::AllocatorGH<Scaleform::GFx::FontGlyphPacker::GlyphInfo,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::FontGlyphPacker::GlyphInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::FontResource *,Scaleform::AllocatorGH<Scaleform::GFx::FontResource *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::FontResource ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::FontResource *,Scaleform::AllocatorGH<Scaleform::GFx::FontResource *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::FontResource *,Scaleform::AllocatorGH<Scaleform::GFx::FontResource *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::FontResource *,Scaleform::AllocatorGH<Scaleform::GFx::FontResource *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::FontResource *,Scaleform::AllocatorGH<Scaleform::GFx::FontResource *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::FontResource *,Scaleform::AllocatorGH<Scaleform::GFx::FontResource *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::FontResource * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::MsgFormat::fmt_record,Scaleform::AllocatorGH_POD<Scaleform::MsgFormat::fmt_record,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::MsgFormat::fmt_record,Scaleform::AllocatorGH_POD<Scaleform::MsgFormat::fmt_record,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::MsgFormat::fmt_record,Scaleform::AllocatorGH_POD<Scaleform::MsgFormat::fmt_record,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::MsgFormat::fmt_record,Scaleform::AllocatorGH_POD<Scaleform::MsgFormat::fmt_record,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::MsgFormat::fmt_record,Scaleform::AllocatorGH_POD<Scaleform::MsgFormat::fmt_record,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::MsgFormat::fmt_record,Scaleform::AllocatorGH_POD<Scaleform::MsgFormat::fmt_record,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::MsgFormat::fmt_record * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<void *,Scaleform::AllocatorGH<void *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef void *ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<void *,Scaleform::AllocatorGH<void *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<void *,Scaleform::AllocatorGH<void *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<void *,Scaleform::AllocatorGH<void *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<void *,Scaleform::AllocatorGH<void *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<void *,Scaleform::AllocatorGH<void *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	void * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<int,Scaleform::AllocatorGH<int,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef long ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<int,Scaleform::AllocatorGH<int,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<int,Scaleform::AllocatorGH<int,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<int,Scaleform::AllocatorGH<int,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<int,Scaleform::AllocatorGH<int,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<int,Scaleform::AllocatorGH<int,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	long * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::`anonymous namespace'::Range,Scaleform::AllocatorGH<Scaleform::GFx::`anonymous namespace'::Range,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::`anonymous namespace'::Range,Scaleform::AllocatorGH<Scaleform::GFx::`anonymous namespace'::Range,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::`anonymous namespace'::Range,Scaleform::AllocatorGH<Scaleform::GFx::`anonymous namespace'::Range,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::`anonymous namespace'::Range,Scaleform::AllocatorGH<Scaleform::GFx::`anonymous namespace'::Range,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::`anonymous namespace'::Range,Scaleform::AllocatorGH<Scaleform::GFx::`anonymous namespace'::Range,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::`anonymous namespace'::Range,Scaleform::AllocatorGH<Scaleform::GFx::`anonymous namespace'::Range,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::`anonymous-namespace'::Range * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::String * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::StrokeStyleType * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::FillStyleType * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::MovieDataDef::SceneInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieDataDef::SceneInfo,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::MovieDataDef::SceneInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieDataDef::SceneInfo,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::MovieDataDef::SceneInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieDataDef::SceneInfo,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::MovieDataDef::SceneInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieDataDef::SceneInfo,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::MovieDataDef::SceneInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieDataDef::SceneInfo,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::MovieDataDef::SceneInfo,Scaleform::AllocatorLH<Scaleform::GFx::MovieDataDef::SceneInfo,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::MovieDataDef::SceneInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::MovieDefImpl>,264>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::MovieDefImpl> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::ImagePackerImpl::InputImage,Scaleform::AllocatorLH<Scaleform::GFx::ImagePackerImpl::InputImage,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::ImagePackerImpl::InputImage,Scaleform::AllocatorLH<Scaleform::GFx::ImagePackerImpl::InputImage,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::ImagePackerImpl::InputImage,Scaleform::AllocatorLH<Scaleform::GFx::ImagePackerImpl::InputImage,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::ImagePackerImpl::InputImage,Scaleform::AllocatorLH<Scaleform::GFx::ImagePackerImpl::InputImage,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::ImagePackerImpl::InputImage,Scaleform::AllocatorLH<Scaleform::GFx::ImagePackerImpl::InputImage,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::ImagePackerImpl::InputImage,Scaleform::AllocatorLH<Scaleform::GFx::ImagePackerImpl::InputImage,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::ImagePackerImpl::InputImage * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::InteractiveObject> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Resource>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Resource>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Resource>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Resource>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Resource>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Resource>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Resource>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Resource>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Resource>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Resource>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Resource>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Resource>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::Resource> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::FillStyleType,Scaleform::AllocatorGH<Scaleform::Render::FillStyleType,259>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::FillStyleType * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::StrokeStyleType,Scaleform::AllocatorGH<Scaleform::Render::StrokeStyleType,259>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::StrokeStyleType * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::StaticTextSnapshotData::CharRef,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextSnapshotData::CharRef,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::StaticTextSnapshotData::CharRef * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorGH<Scaleform::Render::TextureGlyph,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorGH<Scaleform::Render::TextureGlyph,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorGH<Scaleform::Render::TextureGlyph,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorGH<Scaleform::Render::TextureGlyph,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorGH<Scaleform::Render::TextureGlyph,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::TextureGlyph,Scaleform::AllocatorGH<Scaleform::Render::TextureGlyph,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::TextureGlyph * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Task>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Task>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Task>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Task>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Task>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Task>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Task>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Task>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Task>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Task>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Task>,Scaleform::AllocatorGH<Scaleform::Ptr<Scaleform::GFx::Task>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::Task> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::TaskThreadInPool *,Scaleform::AllocatorGH<Scaleform::GFx::TaskThreadInPool *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::TaskThreadInPool ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::TaskThreadInPool *,Scaleform::AllocatorGH<Scaleform::GFx::TaskThreadInPool *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::TaskThreadInPool *,Scaleform::AllocatorGH<Scaleform::GFx::TaskThreadInPool *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::TaskThreadInPool *,Scaleform::AllocatorGH<Scaleform::GFx::TaskThreadInPool *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::TaskThreadInPool *,Scaleform::AllocatorGH<Scaleform::GFx::TaskThreadInPool *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::TaskThreadInPool *,Scaleform::AllocatorGH<Scaleform::GFx::TaskThreadInPool *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::TaskThreadInPool * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::Task *,Scaleform::AllocatorGH<Scaleform::GFx::Task *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::Task ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::Task *,Scaleform::AllocatorGH<Scaleform::GFx::Task *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::Task *,Scaleform::AllocatorGH<Scaleform::GFx::Task *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::Task *,Scaleform::AllocatorGH<Scaleform::GFx::Task *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::Task *,Scaleform::AllocatorGH<Scaleform::GFx::Task *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::Task *,Scaleform::AllocatorGH<Scaleform::GFx::Task *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::Task * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorGH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorGH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorGH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorGH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorGH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorGH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Text::HighlightDesc * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<tagKERNINGPAIR,Scaleform::AllocatorGH<tagKERNINGPAIR,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<tagKERNINGPAIR,Scaleform::AllocatorGH<tagKERNINGPAIR,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<tagKERNINGPAIR,Scaleform::AllocatorGH<tagKERNINGPAIR,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<tagKERNINGPAIR,Scaleform::AllocatorGH<tagKERNINGPAIR,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<tagKERNINGPAIR,Scaleform::AllocatorGH<tagKERNINGPAIR,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<tagKERNINGPAIR,Scaleform::AllocatorGH<tagKERNINGPAIR,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	tagKERNINGPAIR * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Point<long>,Scaleform::AllocatorGH<Scaleform::Render::Point<long>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Point<long>,Scaleform::AllocatorGH<Scaleform::Render::Point<long>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Point<long>,Scaleform::AllocatorGH<Scaleform::Render::Point<long>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Point<long>,Scaleform::AllocatorGH<Scaleform::Render::Point<long>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Point<long>,Scaleform::AllocatorGH<Scaleform::Render::Point<long>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Point<long>,Scaleform::AllocatorGH<Scaleform::Render::Point<long>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Point<long> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::MemItem>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::MemItem>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::MemItem>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::MemItem>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::MemItem>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::MemItem>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::MemItem>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::MemItem>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::MemItem>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::MemItem>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::MemItem>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::MemItem>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::MemItem> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,329>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,329>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,329>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,329>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,329>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>,329>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode>,344>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::ASStringNode> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Value * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMAbcFile *,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::VMAbcFile *,329>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::AS3::VMAbcFile ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::VMAbcFile *,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::VMAbcFile *,329>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMAbcFile *,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::VMAbcFile *,329>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::VMAbcFile *,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::VMAbcFile *,329>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::VMAbcFile *,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::VMAbcFile *,329>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::VMAbcFile *,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::VMAbcFile *,329>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::VMAbcFile * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,343>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,343>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,343>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,343>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,343>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet>,343>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::NamespaceSet> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Multiname,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Multiname,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Multiname,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Multiname,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Multiname,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Multiname,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Multiname * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Slots::Pair,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Slots::Pair,333>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Slots::Pair * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,341>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,341>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,341>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,341>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,341>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,341>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,340>,Scaleform::ArrayDefaultPolicy>
{
	typedef long ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,340>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,340>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,340>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	long * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMExceptionTypeInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionTypeInfo,341>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::VMExceptionTypeInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionTypeInfo,341>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMExceptionTypeInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionTypeInfo,341>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::VMExceptionTypeInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionTypeInfo,341>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::VMExceptionTypeInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionTypeInfo,341>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::VMExceptionTypeInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionTypeInfo,341>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::VMExceptionTypeInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH_POD<unsigned __int64,347>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned long long ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH_POD<unsigned __int64,347>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH_POD<unsigned __int64,347>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH_POD<unsigned __int64,347>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH_POD<unsigned __int64,347>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned __int64,Scaleform::AllocatorLH_POD<unsigned __int64,347>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned long long * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,340>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,340>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,340>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,Scaleform::AllocatorLH_POD<Scaleform::GFx::AS3::Abc::NamespaceSetInfo,340>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Abc::NamespaceSetInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,339>,Scaleform::ArrayDefaultPolicy>
{
	typedef long ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,339>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,339>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,339>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,339>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<long,Scaleform::AllocatorLH_POD<long,339>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	long * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::NamespaceInfo,340>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::NamespaceInfo,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::NamespaceInfo,340>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::NamespaceInfo,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::NamespaceInfo,340>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Abc::NamespaceInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::NamespaceInfo,340>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Abc::NamespaceInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMExceptionInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionInfo,341>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::VMExceptionInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionInfo,341>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMExceptionInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionInfo,341>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::VMExceptionInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionInfo,341>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::VMExceptionInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionInfo,341>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::VMExceptionInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMExceptionInfo,341>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::VMExceptionInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char const *,Scaleform::AllocatorLH_POD<unsigned char const *,339>,Scaleform::ArrayDefaultPolicy>
{
	typedef const unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char const *,Scaleform::AllocatorLH_POD<unsigned char const *,339>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned char const *,Scaleform::AllocatorLH_POD<unsigned char const *,339>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned char const *,Scaleform::AllocatorLH_POD<unsigned char const *,339>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned char const *,Scaleform::AllocatorLH_POD<unsigned char const *,339>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned char const *,Scaleform::AllocatorLH_POD<unsigned char const *,339>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	const unsigned char * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,341>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,341>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,341>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,341>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,341>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,341>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned long,Scaleform::AllocatorLH_POD<unsigned long,340>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned long ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned long,Scaleform::AllocatorLH_POD<unsigned long,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned long,Scaleform::AllocatorLH_POD<unsigned long,340>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned long,Scaleform::AllocatorLH_POD<unsigned long,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned long,Scaleform::AllocatorLH_POD<unsigned long,340>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned long,Scaleform::AllocatorLH_POD<unsigned long,340>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned long * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Instances::fl_events::EventDispatcher::Listener * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,323>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,323>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,323>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,323>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,323>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorLH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,323>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::InteractiveObject> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::AS3::Instances::fl::GlobalObject ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl::GlobalObject *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Instances::fl::GlobalObject * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::Multiname,340>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Abc::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::Multiname,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::Multiname,340>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Abc::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::Multiname,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Abc::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::Multiname,340>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Abc::Multiname,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::Multiname,340>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Abc::Multiname * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,Scaleform::AllocatorLH<Scaleform::WeakPtr<Scaleform::GFx::DisplayObject>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::WeakPtr<Scaleform::GFx::DisplayObject> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::StringView,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::StringView,340>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Abc::StringView,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::StringView,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Abc::StringView,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::StringView,340>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Abc::StringView,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::StringView,340>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Abc::StringView,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::StringView,340>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Abc::StringView,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Abc::StringView,340>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Abc::StringView * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMMethodBodyInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMMethodBodyInfo,346>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::VMMethodBodyInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMMethodBodyInfo,346>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::VMMethodBodyInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMMethodBodyInfo,346>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::VMMethodBodyInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMMethodBodyInfo,346>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::VMMethodBodyInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMMethodBodyInfo,346>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::VMMethodBodyInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMMethodBodyInfo,346>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::VMMethodBodyInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XMLAttr> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,Scaleform::AllocatorGH_CPP<Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Instances::fl_display::MovieClip::FrameScript::Descr * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,331>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,331>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,331>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,331>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,331>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,331>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Value * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAbcFile> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::ClassTraits::Traits> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,328>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,328>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,328>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,328>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,328>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,328>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::Value,Scaleform::AllocatorGH_CPP<Scaleform::GFx::Value,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::Value,Scaleform::AllocatorGH_CPP<Scaleform::GFx::Value,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::Value,Scaleform::AllocatorGH_CPP<Scaleform::GFx::Value,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::Value,Scaleform::AllocatorGH_CPP<Scaleform::GFx::Value,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::Value,Scaleform::AllocatorGH_CPP<Scaleform::GFx::Value,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::Value,Scaleform::AllocatorGH_CPP<Scaleform::GFx::Value,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::Value * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Instances::fl_external::ExtensionContext * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Instances::fl_sensors::Geolocation * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Instances::fl_sensors::Accelerometer * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,Scaleform::AllocatorGH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const > * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Value * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,327>,Scaleform::ArrayConstPolicy<0,4,1> >
{
	typedef unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,327>,Scaleform::ArrayConstPolicy<0,4,1> >(const Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,327>,Scaleform::ArrayConstPolicy<0,4,1> > &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,327>,Scaleform::ArrayConstPolicy<0,4,1> >(const Scaleform::ArrayConstPolicy<0,4,1> &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,327>,Scaleform::ArrayConstPolicy<0,4,1> >();
	~ArrayDataBase<unsigned char,Scaleform::AllocatorLH<unsigned char,327>,Scaleform::ArrayConstPolicy<0,4,1> >();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayConstPolicy<0,4,1> Policy; // 0x10
};
Scaleform::ArrayData<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>::ArrayData<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>(long size); // 0x14044D4C0
void Scaleform::ArrayData<Scaleform::RangeData<void * __ptr64>,Scaleform::AllocatorLH<Scaleform::RangeData<void * __ptr64>,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x14042C1E0
void Scaleform::ArrayData<Scaleform::GFx::Text::CSSToken<wchar_t>,Scaleform::AllocatorGH<Scaleform::GFx::Text::CSSToken<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1406FADF0
void Scaleform::ArrayData<Scaleform::GFx::DisplayList::DepthToIndexMapElem,Scaleform::AllocatorLH<Scaleform::GFx::DisplayList::DepthToIndexMapElem,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1403D03B0
void Scaleform::ArrayData<Scaleform::GFx::FontData::AdvanceEntry,Scaleform::AllocatorLH<Scaleform::GFx::FontData::AdvanceEntry,261>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1403DAB20
void Scaleform::ArrayData<unsigned long,Scaleform::AllocatorGH<unsigned long,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x14030F190
void Scaleform::ArrayData<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x140342AD0
void Scaleform::ArrayData<unsigned char,Scaleform::AllocatorGH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1402E90C0
void Scaleform::ArrayData<Scaleform::GFx::TimelineDef::Frame,Scaleform::AllocatorLH<Scaleform::GFx::TimelineDef::Frame,264>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1403DD8C0
void Scaleform::ArrayData<Scaleform::GFx::StaticTextRecord::GlyphEntry,Scaleform::AllocatorLH<Scaleform::GFx::StaticTextRecord::GlyphEntry,258>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1403F0560
void Scaleform::ArrayData<Scaleform::Render::TextureGlyph,Scaleform::AllocatorLH<Scaleform::Render::TextureGlyph,261>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x14036E890
void Scaleform::ArrayData<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,Scaleform::AllocatorGH<Scaleform::RangeData<Scaleform::GFx::TextField::CSSHolderBase::UrlZone>,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1403F6AA0
void Scaleform::ArrayData<Scaleform::GFx::TextKeyMap::KeyMapEntry,Scaleform::AllocatorGH<Scaleform::GFx::TextKeyMap::KeyMapEntry,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x140390940
void Scaleform::ArrayData<Scaleform::Waitable::HandlerStruct,Scaleform::AllocatorGH<Scaleform::Waitable::HandlerStruct,2>,Scaleform::ArrayConstPolicy<0,16,1> >::Resize(unsigned long long newSize); // 0x140393130
void Scaleform::ArrayData<unsigned char,Scaleform::AllocatorLH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x14040A620
void Scaleform::ArrayData<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorLH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x14038BEB0
void Scaleform::ArrayData<Scaleform::Render::Text::LineBuffer::Line * __ptr64,Scaleform::AllocatorLH<Scaleform::Render::Text::LineBuffer::Line * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1403ED910
void Scaleform::ArrayData<char,Scaleform::AllocatorLH<char,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x14040A620
void Scaleform::ArrayData<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1402E90C0
void Scaleform::ArrayData<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,75>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x140370E60
void Scaleform::ArrayData<tagKERNINGPAIR,Scaleform::AllocatorGH<tagKERNINGPAIR,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x140370EE0
void Scaleform::ArrayData<wchar_t,Scaleform::AllocatorLH<wchar_t,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x140370F60
void Scaleform::ArrayData<Scaleform::Render::BundleEntry * __ptr64,Scaleform::AllocatorLH<Scaleform::Render::BundleEntry * __ptr64,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1403ED910
void Scaleform::ArrayData<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x14040A620
void Scaleform::ArrayData<float,Scaleform::AllocatorLH_POD<float,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x140378AD0
void Scaleform::ArrayData<Scaleform::Render::UserDataState::Data const * __ptr64,Scaleform::AllocatorLH<Scaleform::Render::UserDataState::Data const * __ptr64,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Resize(unsigned long long newSize); // 0x14031BE60
void Scaleform::ArrayData<Scaleform::Render::HAL::MaskStackEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::MaskStackEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Resize(unsigned long long newSize); // 0x14031BEE0
void Scaleform::ArrayData<Scaleform::Render::HAL::RenderTargetEntry,Scaleform::AllocatorLH<Scaleform::Render::HAL::RenderTargetEntry,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Resize(unsigned long long newSize); // 0x14031BF50
void Scaleform::ArrayData<Scaleform::Render::Matrix3x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix3x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Resize(unsigned long long newSize); // 0x14031BFC0
void Scaleform::ArrayData<Scaleform::Render::Matrix4x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix4x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >::Resize(unsigned long long newSize); // 0x14031C070
void Scaleform::ArrayData<Scaleform::Render::Matrix2x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix2x4<float>,2>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x140399DC0
void Scaleform::ArrayData<unsigned char,Scaleform::AllocatorLH_POD<unsigned char,74>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x14037FE70
void Scaleform::ArrayData<unsigned char,Scaleform::AllocatorLH<unsigned char,328>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x140510800
void Scaleform::ArrayData<Scaleform::GFx::AS3::VMMethodBodyInfo,Scaleform::AllocatorLH<Scaleform::GFx::AS3::VMMethodBodyInfo,346>,Scaleform::ArrayDefaultPolicy>::Resize(unsigned long long newSize); // 0x1404A3690
void Scaleform::ArrayData<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,Scaleform::AllocatorLH<Scaleform::Render::GL::TextureManager::PendingTextureDestroyEntry,67>,Scaleform::ArrayConstPolicy<8,8,0> >::Resize(unsigned long long newSize); // 0x1405F72C0
void Scaleform::ArrayData<Scaleform::GFx::FontGlyphPacker::GlyphInfo,Scaleform::AllocatorGH<Scaleform::GFx::FontGlyphPacker::GlyphInfo,2>,Scaleform::ArrayDefaultPolicy>::PushBack(const Scaleform::GFx::FontGlyphPacker::GlyphInfo & val); // 0x1403E5390
void Scaleform::ArrayData<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::PushBack(const unsigned char & val); // 0x1402E7780
void Scaleform::ArrayData<Scaleform::Render::Text::HighlightDesc,Scaleform::AllocatorGH<Scaleform::Render::Text::HighlightDesc,2>,Scaleform::ArrayDefaultPolicy>::PushBack(const Scaleform::Render::Text::HighlightDesc & val); // 0x14038BAC0
void Scaleform::ArrayData<Scaleform::Render::Matrix3x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix3x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >::PushBack(const Scaleform::Render::Matrix3x4<float> & val); // 0x14031AC80
void Scaleform::ArrayData<Scaleform::Render::Matrix4x4<float>,Scaleform::AllocatorLH<Scaleform::Render::Matrix4x4<float>,2>,Scaleform::ArrayConstPolicy<0,8,1> >::PushBack(const Scaleform::Render::Matrix4x4<float> & val); // 0x14031AD10
void Scaleform::ArrayData<Scaleform::GFx::AS3::Value,Scaleform::AllocatorGH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>::PushBack(const Scaleform::GFx::AS3::Value & val); // 0x14049D570
void Scaleform::ArrayData<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>::PushBack(const Scaleform::GFx::AS3::Value & val); // 0x14049D630
void Scaleform::ArrayData<Scaleform::GFx::AS3::Value,Scaleform::AllocatorLH<Scaleform::GFx::AS3::Value,331>,Scaleform::ArrayDefaultPolicy>::PushBack(const Scaleform::GFx::AS3::Value & val); // 0x14049D6F0
void Scaleform::ArrayData<unsigned char,Scaleform::AllocatorGH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>::Append(const unsigned char * other, unsigned long long count); // 0x1402EEBF0
void Scaleform::ArrayData<Scaleform::Waitable::HandlerStruct,Scaleform::AllocatorGH<Scaleform::Waitable::HandlerStruct,2>,Scaleform::ArrayConstPolicy<0,16,1> >::Append(const Scaleform::Waitable::HandlerStruct * other, unsigned long long count); // 0x140392C30
void Scaleform::ArrayData<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,Scaleform::AllocatorLH<Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> >,2>,Scaleform::ArrayDefaultPolicy>::Append(const Scaleform::RangeData<Scaleform::Ptr<Scaleform::Render::Text::TextFormat> > * other, unsigned long long count); // 0x1402F9DC0
void Scaleform::ArrayData<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorLH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>::Append(const Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML> * other, unsigned long long count); // 0x1404FC620
struct Scaleform::ArrayDataBase<Scaleform::Render::TextNotifier *,Scaleform::AllocatorDH_POD<Scaleform::Render::TextNotifier *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::Render::TextNotifier ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::TextNotifier *,Scaleform::AllocatorDH_POD<Scaleform::Render::TextNotifier *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::TextNotifier *,Scaleform::AllocatorDH_POD<Scaleform::Render::TextNotifier *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::TextNotifier *,Scaleform::AllocatorDH_POD<Scaleform::Render::TextNotifier *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::TextNotifier *,Scaleform::AllocatorDH_POD<Scaleform::Render::TextNotifier *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::TextNotifier *,Scaleform::AllocatorDH_POD<Scaleform::Render::TextNotifier *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::TextNotifier * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::TextMeshLayer,Scaleform::AllocatorDH<Scaleform::Render::TextMeshLayer,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::TextMeshLayer,Scaleform::AllocatorDH<Scaleform::Render::TextMeshLayer,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::TextMeshLayer,Scaleform::AllocatorDH<Scaleform::Render::TextMeshLayer,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::TextMeshLayer,Scaleform::AllocatorDH<Scaleform::Render::TextMeshLayer,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::TextMeshLayer,Scaleform::AllocatorDH<Scaleform::Render::TextMeshLayer,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::TextMeshLayer,Scaleform::AllocatorDH<Scaleform::Render::TextMeshLayer,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::TextMeshLayer * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::TextMeshEntry,Scaleform::AllocatorDH<Scaleform::Render::TextMeshEntry,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::TextMeshEntry * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::MovieDataDef::FrameLabelInfo,Scaleform::AllocatorDH<Scaleform::GFx::MovieDataDef::FrameLabelInfo,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::MovieDataDef::FrameLabelInfo,Scaleform::AllocatorDH<Scaleform::GFx::MovieDataDef::FrameLabelInfo,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::MovieDataDef::FrameLabelInfo,Scaleform::AllocatorDH<Scaleform::GFx::MovieDataDef::FrameLabelInfo,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::MovieDataDef::FrameLabelInfo,Scaleform::AllocatorDH<Scaleform::GFx::MovieDataDef::FrameLabelInfo,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::MovieDataDef::FrameLabelInfo,Scaleform::AllocatorDH<Scaleform::GFx::MovieDataDef::FrameLabelInfo,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::MovieDataDef::FrameLabelInfo,Scaleform::AllocatorDH<Scaleform::GFx::MovieDataDef::FrameLabelInfo,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::MovieDataDef::FrameLabelInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorDH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef unsigned char ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<unsigned char,Scaleform::AllocatorDH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<unsigned char,Scaleform::AllocatorDH<unsigned char,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorDH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<unsigned char,Scaleform::AllocatorDH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<unsigned char,Scaleform::AllocatorDH<unsigned char,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	unsigned char * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,Scaleform::AllocatorDH_POD<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::TimelineSnapshot::SnapshotElement ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,Scaleform::AllocatorDH_POD<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,Scaleform::AllocatorDH_POD<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,Scaleform::AllocatorDH_POD<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,Scaleform::AllocatorDH_POD<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,Scaleform::AllocatorDH_POD<Scaleform::GFx::TimelineSnapshot::SnapshotElement *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::TimelineSnapshot::SnapshotElement * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::InteractiveObject>,327>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::InteractiveObject> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,Scaleform::AllocatorDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,Scaleform::AllocatorDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,Scaleform::AllocatorDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,Scaleform::AllocatorDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,Scaleform::AllocatorDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,Scaleform::AllocatorDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Text::StyledText::HTMLImageTagInfo * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::DisplayObject *,Scaleform::AllocatorDH<Scaleform::GFx::DisplayObject *,2>,Scaleform::ArrayDefaultPolicy>
{
	typedef Scaleform::GFx::DisplayObject ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::DisplayObject *,Scaleform::AllocatorDH<Scaleform::GFx::DisplayObject *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::DisplayObject *,Scaleform::AllocatorDH<Scaleform::GFx::DisplayObject *,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::DisplayObject *,Scaleform::AllocatorDH<Scaleform::GFx::DisplayObject *,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::DisplayObject *,Scaleform::AllocatorDH<Scaleform::GFx::DisplayObject *,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::DisplayObject *,Scaleform::AllocatorDH<Scaleform::GFx::DisplayObject *,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::DisplayObject * * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,Scaleform::AllocatorDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,Scaleform::AllocatorDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,Scaleform::AllocatorDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,Scaleform::AllocatorDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,Scaleform::AllocatorDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,Scaleform::AllocatorDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Render::Text::SGMLStackElemDesc<wchar_t> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Sprite>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::Sprite>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Sprite>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::Sprite>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Sprite>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::Sprite>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Sprite>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::Sprite>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Sprite>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::Sprite>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::Ptr<Scaleform::GFx::Sprite>,Scaleform::AllocatorDH<Scaleform::Ptr<Scaleform::GFx::Sprite>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::Ptr<Scaleform::GFx::Sprite> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::Value,Scaleform::AllocatorDH<Scaleform::GFx::AS3::Value,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::Value * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>
{
	class ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>();
	~ArrayDataBase<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,Scaleform::AllocatorDH<Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML>,2>,Scaleform::ArrayDefaultPolicy>();
	unsigned long long GetCapacity();
	void ClearAndRelease();
	void Reserve(const void *, unsigned long long);
	void ResizeNoConstruct(const void *, unsigned long long);
	Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::XML> * Data; // 0x0
	unsigned long long Size; // 0x8
	Scaleform::ArrayDefaultPolicy Policy; // 0x10
};
struct Scaleform::ArrayDataBase<enum Scaleform::GFx::AS3::XMLParser::Kind,Scaleform::AllocatorDH_POD<enum Scaleform::GFx::AS3::XMLParser::Kind,2>,Scaleform::ArrayDefaultPolicy>
{
	enum ValueType
	{
		kNone = 0,
		kElement = 1,
		kText = 2,
		kComment = 3,
		kDecl = 4,
		kCData = 5,
		kDocType = 6,
		kProcInstr = 7,
	};
	struct AllocatorType;
	struct SizePolicyType;
	struct SelfType;
	ArrayDataBase<enum Scaleform::GFx::AS3::XMLParser::Kind,Scaleform::AllocatorDH_POD<enum Scaleform::GFx::AS3::XMLParser::Kind,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDataBase<enum Scaleform::GFx::AS3::XMLParser::Kind,Scaleform::AllocatorDH_POD<enum Scaleform::GFx::AS3::XMLParser::Kind,2>,Scaleform::ArrayDefaultPolicy> &);
	ArrayDataBase<enum Scaleform::GFx::AS3::XMLParser::Kind,Scaleform::AllocatorDH_POD<enum Scaleform::GFx::AS3::XMLParser::Kind,2>,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDefaultPolicy &);
	ArrayDataBase<enum Scaleform::GFx::AS3::XMLParser::Kind,Scaleform::AllocatorDH_POD<enum Scaleform::GFx::AS3::XMLParser::Kind,2>,Scaleform::ArrayDefaultPolicy>();
