#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memoryheap.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "program files (x86)/windows kits/8.1/include/shared/stralign.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_log.h"
#include "program files (x86)/windows kits/8.1/include/um/winnt.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_sysalloc.h"
#include "program files (x86)/windows kits/8.1/include/um/winbase.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstdio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_stdio_config.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocinfo.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstring.h"
#include "program files (x86)/windows kits/8.1/include/um/oleauto.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_hash.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_alg.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/math.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/string.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memcpy_s.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdlib.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/heapmh/heapmh_sysallocmalloc.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/malloc.h"
#include "program files (x86)/windows kits/8.1/include/shared/winerror.h"
#include "program files (x86)/windows kits/8.1/include/shared/guiddef.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "program files (x86)/windows kits/8.1/include/um/propidl.h"
#include "program files (x86)/windows kits/8.1/include/shared/basetsd.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threads.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "program files (x86)/windows kits/8.1/include/um/winuser.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_refcount.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memory.h"

class Scaleform::Mutex_AreadyLockedAcquireInterface :
	Scaleform::AcquireInterface
{
public:
	Scaleform::Mutex * pMutex; // 0x8
	Mutex_AreadyLockedAcquireInterface(Scaleform::Mutex_AreadyLockedAcquireInterface &);
	Mutex_AreadyLockedAcquireInterface(const Scaleform::Mutex_AreadyLockedAcquireInterface &);
	Mutex_AreadyLockedAcquireInterface();
	virtual bool CanAcquire();
	virtual bool TryAcquire();
	virtual bool TryAcquireCommit();
	virtual bool TryAcquireCancel();
	void AddRef();
	void Release(unsigned long);
	virtual ~Mutex_AreadyLockedAcquireInterface();
	Scaleform::Mutex_AreadyLockedAcquireInterface & operator=(Scaleform::Mutex_AreadyLockedAcquireInterface &);
	Scaleform::Mutex_AreadyLockedAcquireInterface & operator=(const Scaleform::Mutex_AreadyLockedAcquireInterface &);
};
bool Scaleform::Mutex_AreadyLockedAcquireInterface::CanAcquire(); // 0x1400B8180
bool Scaleform::Mutex_AreadyLockedAcquireInterface::TryAcquire(); // 0x140311210
bool Scaleform::Mutex_AreadyLockedAcquireInterface::TryAcquireCommit(); // 0x140311250
bool Scaleform::Mutex_AreadyLockedAcquireInterface::TryAcquireCancel(); // 0x140311240
class Scaleform::MutexImpl :
	Scaleform::NewOverrideBase<2>
{
private:
	void * hMutexOrSemaphore; // 0x0
	bool Recursive; // 0x8
	volatile unsigned long LockCount; // 0xC
	Scaleform::Mutex_AreadyLockedAcquireInterface AreadyLockedAcquire; // 0x10
public:
	MutexImpl(const Scaleform::MutexImpl &);
	MutexImpl(Scaleform::Mutex *, bool);
	~MutexImpl();
	void DoLock();
	bool TryLock();
	void Unlock(Scaleform::Mutex *);
	bool IsLockedByAnotherThread(Scaleform::Mutex *);
	bool IsSignaled();
	Scaleform::AcquireInterface * GetAcquireInterface(Scaleform::Mutex *);
	Scaleform::MutexImpl & operator=(const Scaleform::MutexImpl &);
};
void Scaleform::MutexImpl::Unlock(Scaleform::Mutex * pmutex); // 0x140311270
Scaleform::Mutex::Mutex(bool recursive, bool multiWait); // 0x1403105E0
Scaleform::Mutex::~Mutex(); // 0x1403107A0
void Scaleform::Mutex::DoLock(); // 0x140310C30
void Scaleform::Mutex::Unlock(); // 0x140311260
bool Scaleform::Mutex::IsSignaled(); // 0x140310EA0
Scaleform::AcquireInterface * Scaleform::Mutex::GetAcquireInterface(); // 0x140310DD0
bool Scaleform::Mutex::CanAcquire(); // 0x140310BD0
bool Scaleform::Mutex::TryAcquire(); // 0x1403111E0
bool Scaleform::Mutex::TryAcquireCancel(); // 0x140311220
class Scaleform::WaitConditionImpl :
	Scaleform::NewOverrideBase<2>
{
	struct EventPoolEntry;
private:
	Scaleform::Lock WaitQueueLoc; // 0x0
	Scaleform::WaitConditionImpl::EventPoolEntry * pFreeEventList; // 0x30
	Scaleform::WaitConditionImpl::EventPoolEntry * pQueueHead; // 0x38
	Scaleform::WaitConditionImpl::EventPoolEntry * pQueueTail; // 0x40
	Scaleform::WaitConditionImpl::EventPoolEntry * GetNewEvent();
	void ReleaseEvent(Scaleform::WaitConditionImpl::EventPoolEntry *);
	void QueuePush(Scaleform::WaitConditionImpl::EventPoolEntry *);
	Scaleform::WaitConditionImpl::EventPoolEntry * QueuePop();
	void QueueFindAndRemove(Scaleform::WaitConditionImpl::EventPoolEntry *);
public:
	WaitConditionImpl();
	~WaitConditionImpl();
	bool Wait(Scaleform::Mutex *, unsigned long);
	void Notify();
	void NotifyAll();
};
struct Scaleform::WaitConditionImpl::EventPoolEntry :
	Scaleform::NewOverrideBase<2>
{
	void * hEvent; // 0x0
	Scaleform::WaitConditionImpl::EventPoolEntry * pNext; // 0x8
	Scaleform::WaitConditionImpl::EventPoolEntry * pPrev; // 0x10
};
Scaleform::ThreadList * Scaleform::ThreadList::pRunningThreads; // 0x140A72120
typedef unsigned long long DWORD_PTR;
typedef _SYSTEM_INFO * LPSYSTEM_INFO;
typedef _SYSTEM_INFO SYSTEM_INFO;
typedef unsigned long(*_beginthreadex_proc_type)(void *);
typedef long * LPLONG;
Scaleform::WaitConditionImpl::~WaitConditionImpl(); // 0x140310950
Scaleform::WaitConditionImpl::EventPoolEntry * Scaleform::WaitConditionImpl::GetNewEvent(); // 0x140310E30
bool Scaleform::WaitConditionImpl::Wait(Scaleform::Mutex * pmutex, unsigned long delay); // 0x140311310
void Scaleform::WaitConditionImpl::NotifyAll(); // 0x140310ED0
Scaleform::WaitCondition::WaitCondition(); // 0x140310730
Scaleform::WaitCondition::~WaitCondition(); // 0x140310910
bool Scaleform::WaitCondition::Wait(Scaleform::Mutex * pmutex, unsigned long delay); // 0x140311300
void Scaleform::WaitCondition::NotifyAll(); // 0x140310EC0
Scaleform::Thread::Thread(unsigned long long stackSize, long processor); // 0x1403106C0
Scaleform::Thread::~Thread(); // 0x140310810
long Scaleform::Thread::Run(); // 0x140310FD0
void Scaleform::Thread::FinishAndRelease(); // 0x140310D30
class Scaleform::ThreadList :
	Scaleform::NewOverrideBase<2>
{
	struct ThreadHashOp;
private:
	Scaleform::HashSet<Scaleform::Thread *,Scaleform::ThreadList::ThreadHashOp,Scaleform::ThreadList::ThreadHashOp,Scaleform::AllocatorGH<Scaleform::Thread *,2>,Scaleform::HashsetCachedEntry<Scaleform::Thread *,Scaleform::ThreadList::ThreadHashOp> > ThreadSet; // 0x0
	Scaleform::Mutex ThreadMutex; // 0x8
	Scaleform::WaitCondition ThreadsEmpty; // 0x30
	unsigned long RootThreadId; // 0x38
	static Scaleform::ThreadList * pRunningThreads; // 0xFFFFFFFFFFFFFFFF
	void addThread(Scaleform::Thread *);
	void removeThread(Scaleform::Thread *);
	void finishAllThreads();
public:
	ThreadList(const Scaleform::ThreadList &);
	ThreadList();
	~ThreadList();
	static void AddRunningThread(Scaleform::Thread *);
	static void RemoveRunningThread(Scaleform::Thread *);
	static void FinishAllThreads();
	Scaleform::ThreadList & operator=(const Scaleform::ThreadList &);
};
struct Scaleform::ThreadList::ThreadHashOp
{
	unsigned long long operator()(const Scaleform::Thread *);
};
class Scaleform::HashSet<Scaleform::Thread *,Scaleform::ThreadList::ThreadHashOp,Scaleform::ThreadList::ThreadHashOp,Scaleform::AllocatorGH<Scaleform::Thread *,2>,Scaleform::HashsetCachedEntry<Scaleform::Thread *,Scaleform::ThreadList::ThreadHashOp> > :
