#include "dev/kof/master/development/source/baseproject/jni/game/player/chara/actoroption.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/internal/internal_functions.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/cameracheck.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xfacet"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdio.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/globalheapmemory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstdio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/freecameracheck.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_stdio_config.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threadcheck.h"
#include "dev/silverware/git/sdk/agcondition.inl"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_battleonline.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_textlayout.h"

#include "dev/kof/master/development/source/baseproject/jni/game/player/actionsystem.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/player/battleplayerinfo.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/define/charabonedefine.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/lib/etc/randommt.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/system/battlesysteminfo.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/util/cameramotionpreviewsettings.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/data/gamedatainfo.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/check/inputkeyrecord.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/ag/kofanticheat.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/util/soundutil.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/player/charafileformat/charaprojectdataformat.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/check/operationmapper.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/network/netmanager.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/network/playedwith.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/check/combomissionjudge.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/data/saveplayerdata.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/data/onlinesavedata.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/onlinesample/st_onlineresultrank.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/data/savedata.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/debug/gameinfo.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/player/actionblackout.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/future_asset.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglmodel.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/asyncjob.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/check/freecameracheck.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglmatrix.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglvec3.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/cpuseq/battlecpu.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/gfx-integrate/gfxi_movie.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/gfx/gfxmanager.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/gfx-integrate/gfxi_game_interface.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/cameracheck.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/sound/ex_sound_manager.cpp"

struct BattleSystem::RivalDemoBGMTable
{
	CHARACTER_NO charaID1; // 0x0
	CHARACTER_NO charaID2; // 0x4
	SoundId demoBGM; // 0x8
	SoundId battleBGM; // 0xC
	bool bExtraData; // 0x10
	bool IsExistRivalDemo(const CHARACTER_NO, const CHARACTER_NO);
	bool IsExistExtraDemo(const CHARACTER_NO);
};
struct BattleSystem::ResultCharaPosition
{
	OGLVec3 startPos; // 0x0
	OGLVec3 endPos; // 0xC
	long iStartFrame; // 0x18
	long iMoveFrame; // 0x1C
	OGLVec3 poseAngle; // 0x20
	ResultCharaPosition(BattleSystem::ResultCharaPosition &);
	ResultCharaPosition(const BattleSystem::ResultCharaPosition &);
	ResultCharaPosition();
};
void BattleSystem::BattleController::DefaultBattleInit(); // 0x14022E420
void BattleSystem::BattleController::AllInit(BattleSystem::BATTLE_MODE mode, long maxWinCount, bool partyBattle); // 0x14022E4A0
void BattleSystem::BattleController::BattleResultInit(); // 0x14022E6B0
void BattleSystem::BattleController::SetBattleBGMFadeStop(); // 0x14022E750
void BattleSystem::BattleController::CheckBattleBGMStart(); // 0x14022E8A0
void BattleSystem::BattleController::SetRivalDemoLoopSound(); // 0x14022EB00
void BattleSystem::BattleController::BattleStart(); // 0x14022EDA0
void BattleSystem::BattleController::SetRivalDemoActionPhase(); // 0x14022EDF0
bool BattleSystem::BattleController::IsRivalDemoActionEnd(); // 0x14022EED0
void BattleSystem::BattleController::SetRoundCallPhaseFromRivalDemo(); // 0x14022EF50
void BattleSystem::BattleController::SetRoundEndPausePhase(); // 0x14022F040
bool BattleSystem::BattleController::IsGotoRoundEndPausePhase(); // 0x14022F0D0
void BattleSystem::BattleController::BattleInit(bool bKeepBGM); // 0x14022F1A0
void BattleSystem::BattleController::RoundInit(GAME_MODE gameMode, unsigned long randomSeed); // 0x14022F290
void BattleSystem::BattleController::Update(); // 0x14022FCC0
class BattleSystem::BattleController::Update::__l15::<lambda_60860bae646c1a25c68b7e5eea623519>
{
public:
	void operator()(Actor &);
	<lambda_60860bae646c1a25c68b7e5eea623519>(BattleSystem::BattleController::Update::__l15::<lambda_60860bae646c1a25c68b7e5eea623519> &);
	<lambda_60860bae646c1a25c68b7e5eea623519>();
	<lambda_60860bae646c1a25c68b7e5eea623519>(bool &);
private:
	bool & bEndSetup; // 0x0
public:
	BattleSystem::BattleController::Update::__l15::<lambda_60860bae646c1a25c68b7e5eea623519> & operator=(const BattleSystem::BattleController::Update::__l15::<lambda_60860bae646c1a25c68b7e5eea623519> &);
};
class BattleSystem::BattleController::Update::__l301::<lambda_ad3ff183b2c7791a4bd3e61110463e86>
{
public:
	void operator()(Actor &);
	<lambda_ad3ff183b2c7791a4bd3e61110463e86>(BattleSystem::BattleController::Update::__l301::<lambda_ad3ff183b2c7791a4bd3e61110463e86> &);
	<lambda_ad3ff183b2c7791a4bd3e61110463e86>();
	<lambda_ad3ff183b2c7791a4bd3e61110463e86>(bool &);
private:
	bool & bEndSetup; // 0x0
public:
	BattleSystem::BattleController::Update::__l301::<lambda_ad3ff183b2c7791a4bd3e61110463e86> & operator=(const BattleSystem::BattleController::Update::__l301::<lambda_ad3ff183b2c7791a4bd3e61110463e86> &);
};
const BattleSystem::RivalDemoBGMTable BattleSystem::rivalDemoBGMTable[75]; // 0x1408A0B50
const BattleSystem::ResultCharaPosition BattleSystem::resultPosition[33]; // 0x140A5FCF0
const SoundId BattleSystem::ciStageSoundIDTable[24]; // 0x1408A0C80
const float BattleSystem::resultCameraBillboard[16]; // 0x1408A0CE0
const long BattleSystem::ciShadowMapID[2]; // 0x1408A0D20
const float BattleSystem::resultCameraView[16]; // 0x1408A0D30
const SoundId BattleSystem::ciCharacterSoundIDTable[61]; // 0x1408A0D70
const float BattleSystem::resultCameraProj[16]; // 0x1408A0E80
const AgDisplayMode fixedAspectRatioModes[72]; // 0x140A5FBD0
std::piecewise_construct_t std::piecewise_construct; // 0x1408A0B4E
bool BattleSystem::BattleController::IsRoundWinnerPlayer(long playerID); // 0x140230E10
bool BattleSystem::BattleController::IsPerfectWin(); // 0x140230E40
bool BattleSystem::BattleController::IsFinalRound(); // 0x140230E80
bool BattleSystem::BattleController::IsSuccessiveBattle(); // 0x140230EF0
bool BattleSystem::BattleController::IsTimeAttackMode(); // 0x140230FC0
bool BattleSystem::BattleController::IsSuccessiveBattleEnd(); // 0x140231030
bool BattleSystem::BattleController::IsTutorialMode(); // 0x1402310C0
bool BattleSystem::BattleController::IsComboMissionMode(); // 0x140231130
bool BattleSystem::BattleController::IsMainBGMPlayer2(); // 0x1402311A0
SoundId BattleSystem::BattleController::GetStageBGMSoundID(); // 0x1402311E0
void BattleSystem::BattleController::SetComboMissionSetting(); // 0x1402313C0
long BattleSystem::BattleController::GetPlayingMissionID(); // 0x140231610
void BattleSystem::BattleController::SetupNextMissionData(const ComboMissionData * pMission); // 0x1402316B0
void BattleSystem::BattleController::SetTrainingSetting(const TrainingSetting & training); // 0x140231770
void BattleSystem::BattleController::CheckKeyRecordButton(bool debugKeyRecord); // 0x140231D20
void BattleSystem::BattleController::SetKeyRecordMode(BattleSystem::BattleController::KEY_RECORD_MODE mode); // 0x140232050
void BattleSystem::BattleController::SetKeyRecordType(BattleSystem::BattleController::KEY_RECORD_TYPE::ID type); // 0x140232360
void BattleSystem::BattleController::SetKeyRecordSlot(long slot); // 0x1402323F0
bool BattleSystem::BattleController::IsValidKeyRecordData(long slot, long type); // 0x140232490
void BattleSystem::BattleController::ResetKeyRecordAll(); // 0x1402324F0
void BattleSystem::BattleController::ResetKeyPlayCountAll(); // 0x140232550
InputKeyRecord & BattleSystem::BattleController::GetPlayKeyRecord(); // 0x1402325A0
void BattleSystem::BattleController::SetKeyPlaySlotsOnRecStart(); // 0x1402325E0
void BattleSystem::BattleController::ResultInit(); // 0x140232720
void BattleSystem::BattleController::BattleResultInitRankMatch(unsigned long long tick); // 0x140232D60
void BattleSystem::PlayedWidth(Fw::WEBAPI_PLAYED_WITH GameType, NET_USER_DATA * player); // 0x140234670
void BattleSystem::BattleController::BattleResultInitFreeMatch(); // 0x140234810
void BattleSystem::BattleController::SetResultActionPhase(); // 0x140235280
bool BattleSystem::BattleController::IsResultActionEnd(); // 0x140235390
bool BattleSystem::BattleController::IsNeedLoadChara(PLAYER_ID playerID); // 0x140235410
void BattleSystem::BattleController::SetLoadComplete(); // 0x140235470
void BattleSystem::BattleController::SetResultData(bool bFinalKO); // 0x140235510
bool BattleSystem::BattleController::IsMaxSetCount(long playerID); // 0x140235890
void BattleSystem::BattleController::CheckDemoAction(GAME_MODE gameMode, ActorChara * pPlayer1, ActorChara * pPlayer2, bool bDirectionSkip); // 0x1402358E0
bool BattleSystem::BattleController::CheckFinalKO(BattleSystem::WINNER_ID::ID winID); // 0x140235D80
void BattleSystem::BattleController::PlayerActorSetting(ActorChara * pActor, long iPlayerID, ActorChara * pRival); // 0x140235EF0
void BattleSystem::BattleController::ResultPlayerActorSetting(ActorChara * pActor, long iPlayerID, BattleSystem::RESULT_CHARA_PART::ID partType); // 0x1402369D0
extension::BasicFutureObject<extension::AsyncAsset,extension::FutureAssetOption> & <lambda_61f3453c215ee27b58ca0b7ede976f4e>::operator()(); // 0x1402370E0
class BattleSystem::BattleController::ResultPlayerActorSetting::__l2::<lambda_61f3453c215ee27b58ca0b7ede976f4e>
{
public:
	extension::BasicFutureObject<extension::AsyncAsset,extension::FutureAssetOption> & operator()();
	<lambda_61f3453c215ee27b58ca0b7ede976f4e>(BattleSystem::BattleController::ResultPlayerActorSetting::__l2::<lambda_61f3453c215ee27b58ca0b7ede976f4e> &);
	<lambda_61f3453c215ee27b58ca0b7ede976f4e>();
	<lambda_61f3453c215ee27b58ca0b7ede976f4e>(BattleSystem::RESULT_CHARA_PART::ID &, CharaDataUnify * &, AppMain * &, long &, long &, ActorChara * &);
private:
	BattleSystem::RESULT_CHARA_PART::ID & partType; // 0x0
	CharaDataUnify * & pResultCharaData; // 0x8
	AppMain * & pApp; // 0x10
	long & iPlayerID; // 0x18
	long & assetID; // 0x20
	ActorChara * & pActor; // 0x28
public:
	BattleSystem::BattleController::ResultPlayerActorSetting::__l2::<lambda_61f3453c215ee27b58ca0b7ede976f4e> & operator=(const BattleSystem::BattleController::ResultPlayerActorSetting::__l2::<lambda_61f3453c215ee27b58ca0b7ede976f4e> &);
};
void BattleSystem::BattleController::SetInitialStartAction(); // 0x1402372F0
class BattleSystem::BattleController::SetInitialStartAction::__l2::<lambda_844476951c63c99cc400950c54c0e1fd>
{
public:
	void operator()(Actor &);
	<lambda_844476951c63c99cc400950c54c0e1fd>(BattleSystem::BattleController::SetInitialStartAction::__l2::<lambda_844476951c63c99cc400950c54c0e1fd> &);
	<lambda_844476951c63c99cc400950c54c0e1fd>();
	<lambda_844476951c63c99cc400950c54c0e1fd>(BattleSystem::BattleController *);
private:
	BattleSystem::BattleController * __this; // 0x0
public:
	BattleSystem::BattleController::SetInitialStartAction::__l2::<lambda_844476951c63c99cc400950c54c0e1fd> & operator=(const BattleSystem::BattleController::SetInitialStartAction::__l2::<lambda_844476951c63c99cc400950c54c0e1fd> &);
};
void BattleSystem::BattleController::KOTimeStopInfo::Update(); // 0x1402373F0
void BattleSystem::BattleController::SetRealTimeMultiPlayFlag(); // 0x1402374F0//decompilation failure at 1408A0B50!
//decompilation failure at 140A5FCF0!
//decompilation failure at 1408A0C80!
//decompilation failure at 1408A0CE0!
//decompilation failure at 1408A0D20!
//decompilation failure at 1408A0D30!
//decompilation failure at 1408A0D70!
//decompilation failure at 1408A0E80!
//decompilation failure at 140A5FBD0!
//decompilation failure at 1408A0B4E!
std::bitset<61>::reference *__fastcall std::bitset<61>::reference::operator=(
        std::bitset<61>::reference *this,
        bool _Val)
{
  unsigned __int64 Mypos; // rdx
