#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_sysalloc.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_alg.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstdio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_stdio_config.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocinfo.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/cmath"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstring.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix3x4.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/string.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memcpy_s.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_refcount.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/heapmh/heapmh_sysallocmalloc.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/malloc.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix2x4.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdlib.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_cxform.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_color.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/math.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtgmath.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtr1common"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrixpool.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memoryheap.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"

enum Scaleform::Render::MatrixPoolImpl::<unnamed-enum-Pool_HandlePageSize>
{
	Pool_HandlePageSize = 2032,
	Pool_HandlePageAlign = 2048,
	Pool_HandlePageMask = 2047,
	Pool_DataPageSize = 4096,
	Pool_DataPageAlign = 16,
};
struct Scaleform::Render::MatrixPoolImpl::HandlePageBase :
	Scaleform::ListNode<Scaleform::Render::MatrixPoolImpl::HandlePageBase>
{
	unsigned long UseCount; // 0x10
	Scaleform::Render::MatrixPoolImpl::EntryHandle * pFreeList; // 0x18
	Scaleform::Render::MatrixPoolImpl::EntryHandleTable * pTable; // 0x20
	HandlePageBase();
};
struct Scaleform::Render::MatrixPoolImpl::HandlePage :
	Scaleform::Render::MatrixPoolImpl::HandlePageBase
{
	enum <unnamed-enum-EntryCount>
	{
		EntryCount = 249,
	};
	Scaleform::Render::MatrixPoolImpl::EntryHandle Entries[249]; // 0x28
	void AddEntriesToFreeList();
	HandlePage();
};
struct Scaleform::Render::MatrixPoolImpl::DataPage :
	Scaleform::ListNode<Scaleform::Render::MatrixPoolImpl::DataPage>
{
	Scaleform::Render::MatrixPoolImpl::MatrixPool * pPool; // 0x10
	unsigned short FreeTail; // 0x18
	unsigned short FreeMiddle; // 0x1A
	static unsigned long long GetDataSize();
	unsigned char * GetData();
	Scaleform::Render::MatrixPoolImpl::DataHeader * GetFirstHeader();
	Scaleform::Render::MatrixPoolImpl::DataHeader * GetHeaderTailEnd();
	Scaleform::Render::MatrixPoolImpl::DataHeader * GetHeaderBufferEnd();
	void Init(Scaleform::Render::MatrixPoolImpl::MatrixPool *);
	Scaleform::Render::MatrixPoolImpl::DataHeader * CreateDataHeader(void *, unsigned long long, Scaleform::Render::MatrixPoolImpl::EntryHandle *);
	void CopyData(Scaleform::Render::MatrixPoolImpl::DataHeader *, Scaleform::Render::MatrixPoolImpl::DataHeader *);
	DataPage();
};
void Scaleform::Render::MatrixPoolImpl::EntryHandle::ReleaseHandle(); // 0x140394D50
bool Scaleform::Render::MatrixPoolImpl::EntryHandleTable::allocEntryPage(); // 0x140395340
Scaleform::Render::MatrixPoolImpl::EntryHandle * Scaleform::Render::MatrixPoolImpl::EntryHandleTable::AllocEntry(Scaleform::Render::MatrixPoolImpl::DataHeader * header); // 0x140394B10
void Scaleform::Render::MatrixPoolImpl::DataHeader::Release(); // 0x140394D00
struct Scaleform::Render::MatrixPoolImpl::DefaultMatrixData
{
	Scaleform::Render::MatrixPoolImpl::DataHeader Data; // 0x0
	unsigned char DataBytes[48]; // 0x0
	DefaultMatrixData();
};
void Scaleform::Render::MatrixPoolImpl::HMatrix::SetMatrix2D(const Scaleform::Render::Matrix2x4<float> & m); // 0x140394E90
void Scaleform::Render::MatrixPoolImpl::HMatrix::SetMatrix3D(const Scaleform::Render::Matrix3x4<float> & m); // 0x140394FA0
void Scaleform::Render::MatrixPoolImpl::HMatrix::SetCxform(const Scaleform::Render::Cxform & m); // 0x140394DF0
void Scaleform::Render::MatrixPoolImpl::HMatrix::SetTextureMatrix(const Scaleform::Render::Matrix2x4<float> & m, unsigned long index); // 0x140395060
void Scaleform::Render::MatrixPoolImpl::HMatrix::SetUserData(const void * data, unsigned long long size); // 0x140395160
void Scaleform::Render::MatrixPoolImpl::HMatrix::operator=(const Scaleform::Render::MatrixPoolImpl::HMatrix & other); // 0x140394A10
const Scaleform::Render::Matrix3x4<float> & Scaleform::Render::MatrixPoolImpl::HMatrix::GetMatrix3D(); // 0x140394C70
