#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_stroker.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_texturecache.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/heapmh/heapmh_sysallocmalloc.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/malloc.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_gradients.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix2x4.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_log.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_math2d.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_toleranceparams.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_arraystaticbuff.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_color.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_tessellator.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_tessdefs.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wtime.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_sysalloc.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_memorymanager.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_std.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/string.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memcpy_s.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocinfo.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_threadcommandqueue.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_strokeraa.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threads.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_file.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_alg.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdlib.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstdio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_stdio_config.h"

bool Scaleform::Render::Math2D::CheckMonoQuadIntersection(float x1, float y1, float x2, float y2, float x3, float y3, float x, float y); // 0x1403E9E70
bool Scaleform::Render::Math2D::CheckQuadIntersection(float x1, float y1, float x2, float y2, float x3, float y3, float x, float y); // 0x1403EA0D0
void Scaleform::Render::Math2D::SubdivideCubicToQuads<Scaleform::Render::Math2D::QuadCurvePath>(float x1, float y1, float x2, float y2, float x3, float y3, float x4, float y4, Scaleform::Render::Math2D::QuadCurvePath & path); // 0x1403E9770
struct Scaleform::Render::Math2D::CubicCurveCoord
{
	float x1; // 0x0
	float y1; // 0x4
	float x2; // 0x8
	float y2; // 0xC
	float x3; // 0x10
	float y3; // 0x14
	float x4; // 0x18
	float y4; // 0x1C
};
void Scaleform::Render::Math2D::SubdivideCubic<Scaleform::Render::Math2D::CubicCurveCoord>(const Scaleform::Render::Math2D::CubicCurveCoord & c, float t, Scaleform::Render::Math2D::CubicCurveCoord * c1, Scaleform::Render::Math2D::CubicCurveCoord * c2); // 0x1403E9580
void Scaleform::Render::Math2D::CubicToQuadratic<Scaleform::Render::Math2D::QuadCurvePath>(float x1, float y1, float x2, float y2, float x3, float y3, float x4, float y4, Scaleform::Render::Math2D::QuadCurvePath & path); // 0x1403E91C0
struct Scaleform::Render::Math2D::QuadCoord
{
	float cx; // 0x0
	float cy; // 0x4
	float ax; // 0x8
	float ay; // 0xC
};
class Scaleform::Render::Math2D::QuadCurvePath
{
	enum <unnamed-enum-StaticBuff>
	{
		StaticBuff = 32,
	};
public:
	QuadCurvePath();
	void QuadTo(float, float, float, float);
	unsigned long GetQuadCount();
	const Scaleform::Render::Math2D::QuadCoord & GetQuad(unsigned long);
private:
	Scaleform::ArrayStaticBuffPOD<Scaleform::Render::Math2D::QuadCoord,32,2> Quads; // 0x0
public:
	~QuadCurvePath();
};
class Scaleform::ArrayStaticBuffPOD<Scaleform::Render::Math2D::QuadCoord,32,2>
{
	struct ValueType;
private:
	ArrayStaticBuffPOD<Scaleform::Render::Math2D::QuadCoord,32,2>(const Scaleform::ArrayStaticBuffPOD<Scaleform::Render::Math2D::QuadCoord,32,2> &);
public:
	ArrayStaticBuffPOD<Scaleform::Render::Math2D::QuadCoord,32,2>(Scaleform::MemoryHeap *);
	~ArrayStaticBuffPOD<Scaleform::Render::Math2D::QuadCoord,32,2>();
	void Clear();
	void PushBack(const Scaleform::Render::Math2D::QuadCoord &);
	unsigned long long GetSize();
	void CutAt(unsigned long long);
	Scaleform::Render::Math2D::QuadCoord & operator[](unsigned long long);
	const Scaleform::Render::Math2D::QuadCoord & operator[](unsigned long long);
	Scaleform::Render::Math2D::QuadCoord & At(unsigned long long);
	const Scaleform::Render::Math2D::QuadCoord & At(unsigned long long);
	Scaleform::Render::Math2D::QuadCoord ValueAt(unsigned long long);
private:
	const Scaleform::ArrayStaticBuffPOD<Scaleform::Render::Math2D::QuadCoord,32,2> & operator=(const Scaleform::ArrayStaticBuffPOD<Scaleform::Render::Math2D::QuadCoord,32,2> &);
	Scaleform::MemoryHeap * pHeap; // 0x0
	unsigned long long Size; // 0x8
	unsigned long long Reserved; // 0x10
	Scaleform::Render::Math2D::QuadCoord Static[32]; // 0x18
	Scaleform::Render::Math2D::QuadCoord * Data; // 0x218
public:
	void __dflt_ctor_closure();
};
long Scaleform::Render::Math2D::CheckQuadraticIntersection(long styleCount, float x1, float y1, float x2, float y2, float x3, float y3, float x, float y); // 0x1403EA340
long Scaleform::Render::Math2D::CheckCubicIntersection(long styleCount, float x1, float y1, float x2, float y2, float x3, float y3, float x4, float y4, float x, float y); // 0x1403E9C60
bool Scaleform::Render::HitTestRoundStroke(const Scaleform::Render::VertexPath & path, float w, float x, float y); // 0x1403EA840
bool Scaleform::Render::HitTestGeneralStroke(const Scaleform::Render::VertexPath & path, float x, float y); // 0x1403EA3F0void __fastcall Scaleform::Render::Math2D::CubicToQuadratic<Scaleform::Render::Math2D::QuadCurvePath>(
        float x1,
        float y1,
        float x2,
        float y2,
        float x3,
        float y3,
        float x4,
        float y4,
