#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix4x4.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_fontcachehandle.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix2x4.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_stroker.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtgmath.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtr1common"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_hairliner.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_linebuffer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_highlight.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_context.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_constants.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_sysalloc.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_hash.h"

#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_arraystaticbuff.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_treecachenode.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_bundle.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_threadcommandqueue.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threads.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_file.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_styledtext.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_wstring.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_drawableimage.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_buffer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_math2d.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_toleranceparams.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_textmeshprovider.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_tessgen.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_tessellator.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_hal.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_cacheeffect.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threadcheck.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_states.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_statebag.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_glyphfitter.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_texturecache.h"

struct Scaleform::Render::ImageGlyphVertex
{
	float x; // 0x0
	float y; // 0x4
	float u; // 0x8
	float v; // 0xC
	void Set(float, float, float, float);
	static Scaleform::Render::VertexElement Elements[3]; // 0xFFFFFFFFFFFFFFFF
	static Scaleform::Render::VertexFormat Format; // 0xFFFFFFFFFFFFFFFF
};
void Scaleform::Render::VectorGlyphShape::OnEvict(Scaleform::Render::MeshBase * mesh); // 0x14002E7C0
Scaleform::Render::Rect<float> Scaleform::Render::VectorGlyphShape::GetBounds(const Scaleform::Render::Matrix2x4<float> & m); // 0x1404002E0
bool Scaleform::Render::VectorGlyphShape::HitTestShape(const Scaleform::Render::Matrix2x4<float> & m, float x, float y, float morphRatio, Scaleform::Render::StrokeGenerator * gen, const Scaleform::Render::ToleranceParams * tol); // 0x14004BBE0
bool Scaleform::Render::VectorGlyphShape::GetData(Scaleform::Render::HAL * hal, Scaleform::Render::MeshBase * mesh, Scaleform::Render::VertexOutput * verOut, unsigned long meshGenFlags); // 0x1403FF760
enum Scaleform::Render::VectorGlyphShape::GetData::__l2::<unnamed-enum-VerBufSize>
{
	VerBufSize = 128,
	TriBufSize = 128,
};
void Scaleform::Render::VectorGlyphShape::GetFillData(Scaleform::Render::FillData * data, unsigned long layer, unsigned long fillIndex, unsigned long meshGenFlags); // 0x140400260
Scaleform::Render::TextMeshProvider::TextMeshProvider(Scaleform::Render::GlyphCache * cache); // 0x1403FDEE0
Scaleform::Render::TextMeshProvider::~TextMeshProvider(); // 0x1403FE040
void Scaleform::Render::TextMeshProvider::ClearEntries(); // 0x1403FE7A0
void Scaleform::Render::TextMeshProvider::Clear(); // 0x1403FE650
void Scaleform::Render::TextMeshProvider::AddToInUseList(); // 0x1403FE180
Scaleform::Render::Fence * Scaleform::Render::TextMeshProvider::GetLatestFence(); // 0x140400300
void Scaleform::Render::TextMeshProvider::OnEvictSlots(); // 0x140400570
void Scaleform::Render::TextMeshProvider::AddNotifier(Scaleform::Render::TextNotifier * notifier); // 0x1403FE100
void Scaleform::Render::TextMeshProvider::PinSlots(); // 0x140400580
void Scaleform::Render::TextMeshProvider::UnpinSlots(); // 0x140400970
Scaleform::Render::MeshUseStatus Scaleform::Render::TextMeshProvider::GetMeshUseStatus(); // 0x140400470
void Scaleform::Render::TextMeshProvider::setMeshData(Scaleform::Render::TessBase * tess, Scaleform::Render::VertexOutput * verOut, const unsigned long * colors, Scaleform::Render::TextMeshProvider::VertexCountType & verCount); // 0x140404F90
enum Scaleform::Render::TextMeshProvider::setMeshData::__l2::<unnamed-enum-ChunkSize>
{
	ChunkSize = 64,
};
Scaleform::Render::VertexElement Scaleform::Render::ImageGlyphVertex::Elements[3]; // 0x1409FA3F0
Scaleform::Render::VertexFormat Scaleform::Render::ImageGlyphVertex::Format; // 0x1409FA408
void(*Scaleform::Render::ImageGlyphVertex::ormat$initializer$::operator--)(); // 0x140739E50
bool Scaleform::Render::TextMeshProvider::generateSelection(Scaleform::Render::HAL * hal, Scaleform::Render::VertexOutput * verOut, const Scaleform::Render::TextMeshLayer & layer, const Scaleform::Render::Matrix2x4<float> & mtx, unsigned long meshGenFlags); // 0x140404040
class Scaleform::ArrayStaticBuffPOD<unsigned long,16,2>
{
	typedef unsigned long ValueType;
private:
	ArrayStaticBuffPOD<unsigned long,16,2>(const Scaleform::ArrayStaticBuffPOD<unsigned long,16,2> &);
public:
	ArrayStaticBuffPOD<unsigned long,16,2>(Scaleform::MemoryHeap *);
	~ArrayStaticBuffPOD<unsigned long,16,2>();
	void Clear();
	void PushBack(const unsigned long &);
	unsigned long long GetSize();
	void CutAt(unsigned long long);
	unsigned long & operator[](unsigned long long);
	const unsigned long & operator[](unsigned long long);
	unsigned long & At(unsigned long long);
	const unsigned long & At(unsigned long long);
	unsigned long ValueAt(unsigned long long);
private:
	const Scaleform::ArrayStaticBuffPOD<unsigned long,16,2> & operator=(const Scaleform::ArrayStaticBuffPOD<unsigned long,16,2> &);
	Scaleform::MemoryHeap * pHeap; // 0x0
	unsigned long long Size; // 0x8
	unsigned long long Reserved; // 0x10
	unsigned long Static[16]; // 0x18
	unsigned long * Data; // 0x58
public:
	void __dflt_ctor_closure();
};
struct Scaleform::Render::CornerVertex
{
	float x; // 0x0
	float y; // 0x4
	CornerVertex(float, float);
	CornerVertex();
};
void Scaleform::Render::calcMiter<Scaleform::Render::CornerVertex>(const Scaleform::Render::CornerVertex v0, const Scaleform::Render::CornerVertex v1, const Scaleform::Render::CornerVertex v2, float width, float * x, float * y); // 0x1403FDD20
bool Scaleform::Render::TextMeshProvider::generateRectangle(Scaleform::Render::HAL * hal, Scaleform::Render::VertexOutput * verOut, const Scaleform::Render::Matrix2x4<float> & mtx, const float * coord, unsigned long fillColor, unsigned long borderColor, unsigned long meshGenFlags); // 0x140403A80
bool Scaleform::Render::TextMeshProvider::clipGlyphRect(Scaleform::Render::Rect<float> & chr, Scaleform::Render::Rect<float> & tex); // 0x1404026E0
bool Scaleform::Render::TextMeshProvider::generateRasterMesh(Scaleform::Render::VertexOutput * verOut, const Scaleform::Render::TextMeshLayer & layer); // 0x1404036A0
