#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_constants.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_vertex.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_shapedatadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_ampinterface.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_string.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_utf8util.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_cxform.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/sys/stat.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/wchar.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wconio.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/cmath"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/malloc.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_texturecache.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_statebag.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_containers.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_threadcommandqueue.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_refcount.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threads.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_gradients.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memoryheap.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_image.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_color.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_alg.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix2x4.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_log.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_context.h"

Scaleform::Render::GradientData::GradientData(Scaleform::Render::GradientType type, unsigned short recordCount, bool linearRgb); // 0x1403E6DA0
bool Scaleform::Render::GradientData::SetRecordCount(unsigned short count, bool tmpHeap); // 0x1403E82E0
void Scaleform::Render::GradientData::SetLerp(const Scaleform::Render::GradientData * data1, const Scaleform::Render::GradientData * data2, float morphRatio); // 0x1403E81E0
unsigned long long Scaleform::Render::GradientData::GetHashValue(float morphRatio); // 0x1403E7FE0
bool Scaleform::Render::GradientData::operator==(const Scaleform::Render::GradientData & other); // 0x1403E74D0
unsigned long Scaleform::Render::GradientData::CalcImageSize(); // 0x1403E7650
class Scaleform::Render::GradientRamp
{
	enum <unnamed-enum-RampSize>
	{
		RampSize = 256,
		R = 0,
		G = 1,
		B = 2,
		A = 3,
	};
public:
	GradientRamp(const Scaleform::Render::GradientRecord *, unsigned long, float);
	GradientRamp();
	void WriteRGBA(unsigned long, unsigned char *);
	const unsigned char * GetRampBytes();
	struct ColorType;
private:
	static unsigned short applyGammaDir(unsigned char, float);
	static Scaleform::Render::GradientRamp::ColorType applyGammaDir(const Scaleform::Render::Color &, float);
	static unsigned char applyGammaInv(unsigned short, float);
	static void blendColors(unsigned char *, const Scaleform::Render::GradientRamp::ColorType &, const Scaleform::Render::GradientRamp::ColorType &, long, long);
	static void blendColors(unsigned char *, const Scaleform::Render::GradientRamp::ColorType &, const Scaleform::Render::GradientRamp::ColorType &, long, long, float);
	unsigned char Ramp[1024]; // 0x0
};
struct Scaleform::Render::GradientRamp::ColorType
{
	unsigned short r; // 0x0
	unsigned short g; // 0x2
	unsigned short b; // 0x4
	unsigned short a; // 0x6
	ColorType(unsigned short, unsigned short, unsigned short, unsigned short);
	ColorType();
};
Scaleform::Render::GradientRamp::GradientRamp(const Scaleform::Render::GradientRecord * records, unsigned long recordCount, float gamma); // 0x1403E6EC0
class Scaleform::Render::FocalRadialGradient
{
public:
	void Init(float, float, float);
	float Calculate(float, float);
private:
	float Radius; // 0x0
	float FocusX; // 0x4
	float FocusY; // 0x8
	float Radius2; // 0xC
	float Multiplier; // 0x10
};
const unsigned long Scaleform::Render::GradientData::ImageSizeTable[18]; // 0x14074ECD0
void Scaleform::Render::FocalRadialGradient::Init(float r, float fx, float fy); // 0x1403E8120
Scaleform::Render::GradientImage::GradientImage(Scaleform::Render::PrimitiveFillManager * mng, Scaleform::Render::GradientData * data, float morphRatio); // 0x1403E6E00
bool Scaleform::Render::GradientImage::Decode(Scaleform::Render::ImageData * pdest, void(*copyScanline)(unsigned char *, const unsigned char *, unsigned long long, Scaleform::Render::Palette *, void *), void * arg); // 0x1403E7AE0
Scaleform::Render::Texture * Scaleform::Render::GradientImage::GetTexture(Scaleform::Render::TextureManager * pmanager); // 0x1403E8060//decompilation failure at 14074ECD0!
void __fastcall Scaleform::Render::GradientData::GradientData(
        Scaleform::Render::GradientData *this,
        Scaleform::Render::GradientType type,
        unsigned __int16 recordCount,
