#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix3x4.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_boundbox.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wtime.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_hittest.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_hal.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threadcheck.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_memorymanager.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrixpool.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_std.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_scale9grid.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_cxform.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"

void Scaleform::Render::GlyphCache::initialize(); // 0x14037B160
void Scaleform::Render::GlyphCache::Initialize(Scaleform::Render::HAL * ren, Scaleform::Render::PrimitiveFillManager * fillMan); // 0x140377700
void Scaleform::Render::GlyphCache::OnBeginFrame(); // 0x140377800
void Scaleform::Render::GlyphCache::MergeCacheSlots(); // 0x1403777F0
void Scaleform::Render::StrokeScaler::Clear(); // 0x14002E7C0
void Scaleform::Render::GlyphCache::CleanUpFont(Scaleform::Render::FontCacheHandle * font); // 0x1403762C0
Scaleform::Render::PrimitiveFill * Scaleform::Render::GlyphCache::GetFill(Scaleform::Render::TextLayerType type, unsigned long textureId); // 0x1403773D0
Scaleform::Render::Image * Scaleform::Render::GlyphCache::GetImage(unsigned long textureId); // 0x140377560
void Scaleform::Render::GlyphCache::partialUpdateTextures(); // 0x14037B8B0
void Scaleform::Render::GlyphCache::copyImageData(Scaleform::Render::ImagePlane * pl, const unsigned char * data, unsigned long pitch, unsigned long dstX, unsigned long dstY, unsigned long w, unsigned long h); // 0x14037A600
bool Scaleform::Render::GlyphCache::updateTextureGlyph(const Scaleform::Render::GlyphNode * node); // 0x14037BFC0
void Scaleform::Render::GlyphCache::UnlockBuffers(); // 0x140378D70
void Scaleform::Render::GlyphCache::TextureLost(unsigned long textureId, unsigned long reason); // 0x140378C70
Scaleform::Render::FontCacheHandle * Scaleform::Render::GlyphCache::RegisterFont(Scaleform::Render::Font * font); // 0x1403789B0
Scaleform::Render::GlyphNode * Scaleform::Render::GlyphCache::FindGlyph(Scaleform::Render::TextMeshProvider * tm, const Scaleform::Render::GlyphParam & gp); // 0x140377240
Scaleform::Render::GlyphNode * Scaleform::Render::GlyphCache::allocateGlyph(Scaleform::Render::TextMeshProvider * tm, const Scaleform::Render::GlyphParam & gp, unsigned long w, unsigned long h); // 0x1403796F0
void Scaleform::Render::GlyphCache::UnpinAllSlots(); // 0x140378E50
void Scaleform::Render::GlyphCache::ApplyInUseList(); // 0x1403761C0
bool Scaleform::Render::GlyphCache::UpdatePinList(); // 0x140378EF0
void Scaleform::Render::GlyphCache::getGlyphBounds(Scaleform::Render::VectorGlyphShape * glyphShape, const Scaleform::Render::ShapeDataInterface * shapeData); // 0x14037AD20
bool Scaleform::Render::GlyphCache::isOuterContourCW(const Scaleform::Render::ShapeDataInterface * shape); // 0x14037B530
void Scaleform::Render::GlyphCache::copyAndTransformShape(Scaleform::Render::VectorGlyphShape * glyphShape, const Scaleform::Render::ToleranceParams & paramIn, const Scaleform::Render::ShapeDataInterface * srcShape, bool fauxBold, bool fauxItalic, unsigned long outline, float italicOffset, float nominalSize); // 0x140379830
Scaleform::Render::VectorGlyphShape * Scaleform::Render::GlyphCache::CreateGlyphShape(Scaleform::Render::GlyphRunData & data, const Scaleform::Render::ToleranceParams & param, unsigned long glyphIndex, float screenSize, bool fauxBold, bool fauxItalic, unsigned long outline, bool needsVectorShape); // 0x140376880
class Scaleform::Render::ImgBlurWrapperX
{
private:
	ImgBlurWrapperX(const Scaleform::Render::ImgBlurWrapperX &);
public:
	ImgBlurWrapperX(unsigned char *, unsigned long, unsigned long, unsigned long, unsigned long, unsigned long);
	unsigned long GetWidth();
	unsigned long GetHeight();
	unsigned char GetPixel(unsigned long, unsigned long);
	void CopySpanTo(unsigned long, unsigned long, unsigned long, const unsigned char *);
private:
	const Scaleform::Render::ImgBlurWrapperX & operator=(const Scaleform::Render::ImgBlurWrapperX &);
	unsigned char * Img; // 0x0
	unsigned long Pitch; // 0x8
	unsigned long Sx; // 0xC
	unsigned long Sy; // 0x10
	unsigned long W; // 0x14
	unsigned long H; // 0x18
};
class Scaleform::Render::ImgBlurWrapperY
{
private:
	ImgBlurWrapperY(const Scaleform::Render::ImgBlurWrapperY &);
public:
	ImgBlurWrapperY(unsigned char *, unsigned long, unsigned long, unsigned long, unsigned long, unsigned long);
	unsigned long GetWidth();
	unsigned long GetHeight();
	unsigned char GetPixel(unsigned long, unsigned long);
	void CopySpanTo(unsigned long, unsigned long, unsigned long, const unsigned char *);
private:
	const Scaleform::Render::ImgBlurWrapperY & operator=(const Scaleform::Render::ImgBlurWrapperY &);
	unsigned char * Img; // 0x0
	unsigned long Pitch; // 0x8
	unsigned long Sx; // 0xC
	unsigned long Sy; // 0x10
	unsigned long W; // 0x14
	unsigned long H; // 0x18
};
unsigned long Scaleform::Render::FontSizeRamp[29]; // 0x1409F9960
void(*Scaleform::Render::RasterGlyphVertex::ormat$initializer$::operator--)(); // 0x140739CD0
Scaleform::Render::VertexElement Scaleform::Render::RasterGlyphVertex::Elements[4]; // 0x1409F9920
Scaleform::Render::VertexFormat Scaleform::Render::RasterGlyphVertex::Format; // 0x1409F9940
const unsigned char Scaleform::Render::PathDataDecoder<Scaleform::ArrayLH_POD<unsigned char,2,Scaleform::ArrayDefaultPolicy> >::Sizes[16]; // 0x14074BF48
void Scaleform::Render::RecursiveBlur<Scaleform::Render::ImgBlurWrapperX,Scaleform::ArrayLH_POD<float,2,Scaleform::ArrayDefaultPolicy>,Scaleform::ArrayLH_POD<unsigned char,2,Scaleform::ArrayDefaultPolicy> >(Scaleform::Render::ImgBlurWrapperX & img, float radius, Scaleform::ArrayLH_POD<float,2,Scaleform::ArrayDefaultPolicy> & sum, Scaleform::ArrayLH_POD<unsigned char,2,Scaleform::ArrayDefaultPolicy> & buf); // 0x140373FA0
