#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_strokeraa.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_scale9grid.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_arraystaticbuff.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_queue.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_glyphcacheconfig.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_docview.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_range.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_vertex.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_rasterizer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_meshcache.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_glyphcache.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memoryheap.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_file.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrixstate.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_profiler.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_twips.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_constants.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_textprimitivebundle.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_treecachetext.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_treetext.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_filters.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_filterparams.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_sgmlparser.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_textlayout.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix4x4.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/cmath"

class Scaleform::Render::TextPrepareBuffer :
	Scaleform::Render::RQPrepareBuffer
{
	enum QIPrepareResult
	{
		QIP_Done = 0,
		QIP_NeedCache = 1,
	};
public:
	void StartPrimitive(Scaleform::Render::HAL *, Scaleform::Render::RenderQueueItem &, Scaleform::Render::TextPrimitiveBundle *, Scaleform::Render::TreeCacheText *, Scaleform::Render::TextEmitBuffer *);
	Scaleform::Render::RenderQueueItem::QIPrepareResult ProcessPrimitive(bool);
private:
	TextPrepareBuffer();
	void addTextFieldLayers(bool);
	Scaleform::Render::TextEmitBuffer * pEmitBuffer; // 0x8
	Scaleform::Render::HAL * pHal; // 0x10
	Scaleform::Render::MeshCache * pCache; // 0x18
	Scaleform::Render::TextPrimitiveBundle * pBundle; // 0x20
	unsigned long long ProcessingLayer; // 0x28
	bool LayersPinned; // 0x30
	bool LayersFinished; // 0x31
	Scaleform::Render::TreeCacheText * pRemainingTextFields; // 0x38
	Scaleform::Render::PrimitivePrepareBuffer PPBuffer; // 0x40
};
class Scaleform::Render::TextEmitBuffer :
	Scaleform::Render::RQEmitBuffer
{
	enum MaskStatusType
	{
		Mask_NotInUse = 0,
		Mask_Submitting = 1,
		Mask_InUse = 2,
	};
public:
	void StartEmitting(void *, Scaleform::Render::TextPrimitiveBundle *);
	void EndEmitting();
	void EmitPrimitive(Scaleform::Render::HAL *, Scaleform::Render::TextPrepareBuffer *);
private:
	TextEmitBuffer();
	Scaleform::Render::TextPrimitiveBundle * pBundle; // 0x8
	unsigned long long EmitLayer; // 0x10
	Scaleform::Render::TextEmitBuffer::MaskStatusType MaskStatus; // 0x18
	Scaleform::Render::PrimitiveEmitBuffer PEBuffer; // 0x20
};
void Scaleform::Render::TextPrepareBuffer::addTextFieldLayers(bool startFlag); // 0x1404195C0
Scaleform::Render::RenderQueueItem::QIPrepareResult Scaleform::Render::TextPrepareBuffer::ProcessPrimitive(bool waitForCache); // 0x140418E60
void Scaleform::Render::TextEmitBuffer::EmitPrimitive(Scaleform::Render::HAL * hal, Scaleform::Render::TextPrepareBuffer * prepareBuffer); // 0x140418C80
bool Scaleform::Render::TextLayerPrimitive::AddEntry(Scaleform::Render::HAL * hal, Scaleform::Render::BundleEntry * e, Scaleform::Render::Mesh * pmesh, const Scaleform::Render::MatrixPoolImpl::HMatrix & m); // 0x140418BE0
bool Scaleform::Render::TextLayerPrimitive::RemoveEntry(Scaleform::Render::BundleEntry * e); // 0x1404191D0
Scaleform::Render::TextPrimitiveBundle::TextPrimitiveBundle(Scaleform::Render::HAL * hal); // 0x1404189A0
Scaleform::Render::TextPrimitiveBundle::~TextPrimitiveBundle(); // 0x140418A90
void Scaleform::Render::TextPrimitiveBundle::InsertEntry(Scaleform::Render::HAL * hal, unsigned long long index, Scaleform::Render::BundleEntry * entry); // 0x140418E00
void Scaleform::Render::TextPrimitiveBundle::RemoveEntries(unsigned long long index, unsigned long long count); // 0x140419000
void Scaleform::Render::TextPrimitiveBundle::UpdateMesh(Scaleform::Render::HAL * hal, Scaleform::Render::BundleEntry * entry); // 0x1404192A0
Scaleform::Render::RenderQueueItem::QIPrepareResult Scaleform::Render::TextPrimitiveBundle::Prepare(Scaleform::Render::RenderQueueItem & item, Scaleform::Render::RenderQueueProcessor & qp, bool waitForCache); // 0x140418E10
void Scaleform::Render::TextPrimitiveBundle::EmitToHAL(Scaleform::Render::RenderQueueItem & item, Scaleform::Render::RenderQueueProcessor & qp); // 0x140418DC0
void Scaleform::Render::TextPrimitiveBundle::startPrimitive(Scaleform::Render::RenderQueueItem & item, Scaleform::Render::TextPrepareBuffer * prepareBuffer, Scaleform::Render::RenderQueueProcessor & qp); // 0x140419AE0
bool Scaleform::Render::TextPrimitiveBundle::addAndPinBatchLayers(Scaleform::Render::HAL * hal, Scaleform::Render::TreeCacheText * textCache, Scaleform::Render::TextMeshProvider * tm); // 0x140419310
void Scaleform::Render::TextPrimitiveBundle::removeEntryFromLayers(Scaleform::Render::BundleEntry * e); // 0x1404199B0
void Scaleform::Render::TextPrimitiveBundle::clearBatchLayers(); // 0x1404197D0
class Scaleform::Render::SKI_TextPrimitive :
	Scaleform::Render::SortKeyInterface
{
public:
	SKI_TextPrimitive(Scaleform::Render::SKI_TextPrimitive &);
	SKI_TextPrimitive(const Scaleform::Render::SKI_TextPrimitive &);
	SKI_TextPrimitive();
	static Scaleform::Render::SKI_TextPrimitive Instance; // 0xFFFFFFFFFFFFFFFF
	static Scaleform::Render::SKI_TextPrimitive Instance3D; // 0xFFFFFFFFFFFFFFFF
	virtual bool UpdateBundleEntry(Scaleform::Render::HAL *, void *, Scaleform::Render::BundleEntry *, Scaleform::Render::TreeCacheRoot *);
	virtual void DrawBundleEntry(Scaleform::Render::HAL *, void *, Scaleform::Render::BundleEntry *);
	virtual ~SKI_TextPrimitive();
	Scaleform::Render::SKI_TextPrimitive & operator=(Scaleform::Render::SKI_TextPrimitive &);
	Scaleform::Render::SKI_TextPrimitive & operator=(const Scaleform::Render::SKI_TextPrimitive &);
};
bool Scaleform::Render::SKI_TextPrimitive::UpdateBundleEntry(Scaleform::Render::HAL * hal, void * __formal, Scaleform::Render::BundleEntry * p, Scaleform::Render::TreeCacheRoot * tr); // 0x140418880
class Scaleform::Ptr<Scaleform::Render::TextPrimitiveBundle>
{
protected:
	Scaleform::Render::TextPrimitiveBundle * pObject; // 0x0
public:
	Ptr<Scaleform::Render::TextPrimitiveBundle>(const Scaleform::Ptr<Scaleform::Render::TextPrimitiveBundle> &);
	Ptr<Scaleform::Render::TextPrimitiveBundle>(Scaleform::Render::TextPrimitiveBundle *);
	Ptr<Scaleform::Render::TextPrimitiveBundle>(Scaleform::Ptr<Scaleform::Render::TextPrimitiveBundle> &, Scaleform::PickType);
	Ptr<Scaleform::Render::TextPrimitiveBundle>(Scaleform::Pickable<Scaleform::Render::TextPrimitiveBundle>);
	Ptr<Scaleform::Render::TextPrimitiveBundle>(Scaleform::Render::TextPrimitiveBundle &);
	Ptr<Scaleform::Render::TextPrimitiveBundle>();
	~Ptr<Scaleform::Render::TextPrimitiveBundle>();
	bool operator==(Scaleform::Render::TextPrimitiveBundle *);
	bool operator==(const Scaleform::Ptr<Scaleform::Render::TextPrimitiveBundle> &);
	bool operator!=(Scaleform::Render::TextPrimitiveBundle *);
	bool operator!=(const Scaleform::Ptr<Scaleform::Render::TextPrimitiveBundle> &);
