#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtgmath.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_uncopyable.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtr1common"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_hal.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threadcheck.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_twips.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_vertex.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_glyphcacheconfig.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_rasterizer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_glyphcache.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrixpool.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_sysalloc.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wtime.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_filters.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_statebag.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_string.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_utf8util.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix2x4.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/sys/stat.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_threadcommandqueue.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_texturecache.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_tessdefs.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/wchar.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdlib.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wconio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_shapemeshprovider.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix3x4.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_log.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_types2d.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/math.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix4x4.h"

class Scaleform::Render::MorphInterpolator :
	Scaleform::Render::ShapeDataInterface
{
public:
	MorphInterpolator(Scaleform::Render::MorphInterpolator &);
	MorphInterpolator(const Scaleform::Render::MorphInterpolator &);
	MorphInterpolator(Scaleform::Render::ShapeDataInterface *, Scaleform::Render::MorphShapeData *, float, const Scaleform::Render::ShapePosInfo &);
	virtual unsigned long GetFillStyleCount();
	virtual unsigned long GetStrokeStyleCount();
	virtual void GetFillStyle(unsigned long, Scaleform::Render::FillStyleType *);
	virtual void GetStrokeStyle(unsigned long, Scaleform::Render::StrokeStyleType *);
	virtual unsigned long GetStartingPos();
	virtual Scaleform::Render::ShapePathType ReadPathInfo(Scaleform::Render::ShapePosInfo *, float *, unsigned long *);
	virtual Scaleform::Render::PathEdgeType ReadEdge(Scaleform::Render::ShapePosInfo *, float *);
	virtual void SkipPathData(Scaleform::Render::ShapePosInfo *);
	virtual void Rewind();
private:
	Scaleform::Ptr<Scaleform::Render::ShapeDataInterface> pShapeData; // 0x10
	Scaleform::Ptr<Scaleform::Render::MorphShapeData> pMorphData; // 0x18
	float MorphRatio; // 0x20
	Scaleform::Render::ShapePosInfo Pos2; // 0x24
	Scaleform::Render::ShapePosInfo Pos2s; // 0x5C
public:
	virtual ~MorphInterpolator();
	Scaleform::Render::MorphInterpolator & operator=(Scaleform::Render::MorphInterpolator &);
	Scaleform::Render::MorphInterpolator & operator=(const Scaleform::Render::MorphInterpolator &);
};
unsigned long Scaleform::Render::MorphInterpolator::GetFillStyleCount(); // 0x14034F970
unsigned long Scaleform::Render::MorphInterpolator::GetStrokeStyleCount(); // 0x14034FC20
void Scaleform::Render::MorphInterpolator::GetFillStyle(unsigned long idx, Scaleform::Render::FillStyleType * f1); // 0x14034F8B0
void Scaleform::Render::MorphInterpolator::GetStrokeStyle(unsigned long idx, Scaleform::Render::StrokeStyleType * s1); // 0x14034FA60
unsigned long Scaleform::Render::MorphInterpolator::GetStartingPos(); // 0x14034FA20
Scaleform::Render::ShapePathType Scaleform::Render::MorphInterpolator::ReadPathInfo(Scaleform::Render::ShapePosInfo * pos1, float * coord1, unsigned long * styles1); // 0x1403505D0
Scaleform::Render::PathEdgeType Scaleform::Render::MorphInterpolator::ReadEdge(Scaleform::Render::ShapePosInfo * pos1, float * coord1); // 0x1403504A0
void Scaleform::Render::MorphInterpolator::SkipPathData(Scaleform::Render::ShapePosInfo * pos1); // 0x140350AE0
void Scaleform::Render::MorphInterpolator::Rewind(); // 0x140350970
Scaleform::Render::MorphShapeData::MorphShapeData(Scaleform::Render::ShapeDataInterface * morphTo); // 0x14034E390
Scaleform::Render::ShapeMeshProvider::ShapeMeshProvider(Scaleform::Render::ShapeDataInterface * shape, Scaleform::Render::ShapeDataInterface * shapeMorph); // 0x14034E4C0
Scaleform::Render::MorphShapeData::~MorphShapeData(); // 0x14034E5E0
Scaleform::Render::ShapeMeshProvider::~ShapeMeshProvider(); // 0x14034E670
void Scaleform::Render::ShapeMeshProvider::AttachShape(Scaleform::Render::ShapeDataInterface * shape, Scaleform::Render::ShapeDataInterface * shapeMorph); // 0x14034E9E0
void Scaleform::Render::ShapeMeshProvider::createMorphData(); // 0x140353DB0
void Scaleform::Render::ShapeMeshProvider::countComplexFills(const Scaleform::ArrayStaticBuffPOD<Scaleform::Render::ShapeMeshProvider::TmpPathInfoType,32,2> & paths, unsigned long long i1, unsigned long long i2, Scaleform::Render::ShapeMeshProvider::DrawLayerType * dl); // 0x140353610
void Scaleform::Render::ShapeMeshProvider::createDrawLayers(const Scaleform::ArrayStaticBuffPOD<Scaleform::Render::ShapeMeshProvider::TmpPathInfoType,32,2> & paths, unsigned long long i1, unsigned long long i2); // 0x140353970
void Scaleform::Render::ShapeMeshProvider::acquireShapeData(); // 0x1403511A0
bool Scaleform::Render::ShapeMeshProvider::checkI9gMergedSlice(); // 0x140353240
bool Scaleform::Render::ShapeMeshProvider::checkI9gLayer(const Scaleform::Render::ShapeMeshProvider::DrawLayerType & dl); // 0x1403530D0
void Scaleform::Render::ShapeMeshProvider::GetStrokeStyle(unsigned long idx, Scaleform::Render::StrokeStyleType * s1, float morphRatio); // 0x14034FB40
void Scaleform::Render::ShapeMeshProvider::addFill(Scaleform::Render::MeshGenerator * gen, const Scaleform::Render::ToleranceParams & param, const Scaleform::Render::TransformerBase * tr, unsigned long startPos, float morphRatio); // 0x140351F40
void Scaleform::Render::ShapeMeshProvider::addToStrokeSorter(Scaleform::Render::MeshGenerator * gen, const Scaleform::Render::ToleranceParams & param, const Scaleform::Render::TransformerBase * tr, unsigned long startPos, unsigned long strokeStyleIdx, float snapOffset, float morphRatio); // 0x140352B60
void Scaleform::Render::ShapeMeshProvider::addStroke(Scaleform::Render::MeshGenerator * gen, Scaleform::Render::TessBase * stroker, const Scaleform::Render::ToleranceParams & param, const Scaleform::Render::TransformerBase * tr, unsigned long startPos, unsigned long strokeStyleIdx, float snapOffset, float morphRatio); // 0x140352880
void Scaleform::Render::ShapeMeshProvider::addStroke(Scaleform::Render::MeshGenerator * gen, const Scaleform::Render::ToleranceParams & param, const Scaleform::Render::TransformerBase * tr, unsigned long startPos, unsigned long strokeStyleIdx, float snapOffset, float morphRatio); // 0x1403525A0
bool Scaleform::Render::ShapeMeshProvider::createNullMesh(Scaleform::Render::VertexOutput * pout, unsigned long drawLayer, unsigned long meshGenFlags); // 0x140354D50
bool Scaleform::Render::ShapeMeshProvider::acquireTessMeshes(Scaleform::Render::TessBase * tess, const Scaleform::Render::Matrix2x4<float> & mtx, Scaleform::Render::VertexOutput * pout, unsigned long drawLayerIdx, unsigned long strokeStyleIdx, unsigned long meshGenFlags, float morphRatio); // 0x1403515B0
class Scaleform::ArrayStaticBuffPOD<Scaleform::Render::VertexOutput::Fill,16,2>
{
	struct ValueType;
private:
	ArrayStaticBuffPOD<Scaleform::Render::VertexOutput::Fill,16,2>(const Scaleform::ArrayStaticBuffPOD<Scaleform::Render::VertexOutput::Fill,16,2> &);
public:
	ArrayStaticBuffPOD<Scaleform::Render::VertexOutput::Fill,16,2>(Scaleform::MemoryHeap *);
	~ArrayStaticBuffPOD<Scaleform::Render::VertexOutput::Fill,16,2>();
	void Clear();
	void PushBack(const Scaleform::Render::VertexOutput::Fill &);
	unsigned long long GetSize();
	void CutAt(unsigned long long);
	Scaleform::Render::VertexOutput::Fill & operator[](unsigned long long);
	const Scaleform::Render::VertexOutput::Fill & operator[](unsigned long long);
	Scaleform::Render::VertexOutput::Fill & At(unsigned long long);
	const Scaleform::Render::VertexOutput::Fill & At(unsigned long long);
	Scaleform::Render::VertexOutput::Fill ValueAt(unsigned long long);
private:
	const Scaleform::ArrayStaticBuffPOD<Scaleform::Render::VertexOutput::Fill,16,2> & operator=(const Scaleform::ArrayStaticBuffPOD<Scaleform::Render::VertexOutput::Fill,16,2> &);
	Scaleform::MemoryHeap * pHeap; // 0x0
	unsigned long long Size; // 0x8
	unsigned long long Reserved; // 0x10
	Scaleform::Render::VertexOutput::Fill Static[16]; // 0x18
	Scaleform::Render::VertexOutput::Fill * Data; // 0x218
public:
	void __dflt_ctor_closure();
};
class Scaleform::ArrayStaticBuffPOD<unsigned int,16,2>
{
	typedef unsigned long ValueType;
private:
	ArrayStaticBuffPOD<unsigned int,16,2>(const Scaleform::ArrayStaticBuffPOD<unsigned int,16,2> &);
public:
	ArrayStaticBuffPOD<unsigned int,16,2>(Scaleform::MemoryHeap *);
	~ArrayStaticBuffPOD<unsigned int,16,2>();
	void Clear();
	void PushBack(const unsigned long &);
	unsigned long long GetSize();
	void CutAt(unsigned long long);
	unsigned long & operator[](unsigned long long);
	const unsigned long & operator[](unsigned long long);
	unsigned long & At(unsigned long long);
	const unsigned long & At(unsigned long long);
	unsigned long ValueAt(unsigned long long);
private:
	const Scaleform::ArrayStaticBuffPOD<unsigned int,16,2> & operator=(const Scaleform::ArrayStaticBuffPOD<unsigned int,16,2> &);
	Scaleform::MemoryHeap * pHeap; // 0x0
	unsigned long long Size; // 0x8
	unsigned long long Reserved; // 0x10
	unsigned long Static[16]; // 0x18
	unsigned long * Data; // 0x58
public:
	void __dflt_ctor_closure();
};
const unsigned char Scaleform::Render::Factors[4]; // 0x140749AD0
bool Scaleform::Render::ShapeMeshProvider::tessellateFill(Scaleform::Render::HAL * hal, const Scaleform::Render::Scale9GridInfo * s9g, unsigned long drawLayerIdx, Scaleform::Render::MeshBase * pmesh, Scaleform::Render::VertexOutput * pout, unsigned long meshGenFlags); // 0x140355500
class Scaleform::Render::TransformerWrapper<Scaleform::Render::Matrix2x4<float> > :
	Scaleform::Render::TransformerBase
{
public:
	const Scaleform::Render::Matrix2x4<float> * Tr; // 0x8
	TransformerWrapper<Scaleform::Render::Matrix2x4<float> >(Scaleform::Render::TransformerWrapper<Scaleform::Render::Matrix2x4<float> > &);
	TransformerWrapper<Scaleform::Render::Matrix2x4<float> >(const Scaleform::Render::TransformerWrapper<Scaleform::Render::Matrix2x4<float> > &);
	TransformerWrapper<Scaleform::Render::Matrix2x4<float> >(const Scaleform::Render::Matrix2x4<float> *);
	TransformerWrapper<Scaleform::Render::Matrix2x4<float> >();
	virtual void Transform(float *, float *);
	virtual float GetScale();
	virtual float GetXScale();
	virtual float GetYScale();
	virtual ~TransformerWrapper<Scaleform::Render::Matrix2x4<float> >();
	Scaleform::Render::TransformerWrapper<Scaleform::Render::Matrix2x4<float> > & operator=(Scaleform::Render::TransformerWrapper<Scaleform::Render::Matrix2x4<float> > &);
	Scaleform::Render::TransformerWrapper<Scaleform::Render::Matrix2x4<float> > & operator=(const Scaleform::Render::TransformerWrapper<Scaleform::Render::Matrix2x4<float> > &);
};
class Scaleform::Render::TransformerWrapper<Scaleform::Render::Scale9GridInfo> :
	Scaleform::Render::TransformerBase
{
public:
	const Scaleform::Render::Scale9GridInfo * Tr; // 0x8
	TransformerWrapper<Scaleform::Render::Scale9GridInfo>(Scaleform::Render::TransformerWrapper<Scaleform::Render::Scale9GridInfo> &);
	TransformerWrapper<Scaleform::Render::Scale9GridInfo>(const Scaleform::Render::TransformerWrapper<Scaleform::Render::Scale9GridInfo> &);
	TransformerWrapper<Scaleform::Render::Scale9GridInfo>(const Scaleform::Render::Scale9GridInfo *);
	TransformerWrapper<Scaleform::Render::Scale9GridInfo>();
	virtual void Transform(float *, float *);
	virtual float GetScale();
	virtual float GetXScale();
	virtual float GetYScale();
	virtual ~TransformerWrapper<Scaleform::Render::Scale9GridInfo>();
	Scaleform::Render::TransformerWrapper<Scaleform::Render::Scale9GridInfo> & operator=(Scaleform::Render::TransformerWrapper<Scaleform::Render::Scale9GridInfo> &);
	Scaleform::Render::TransformerWrapper<Scaleform::Render::Scale9GridInfo> & operator=(const Scaleform::Render::TransformerWrapper<Scaleform::Render::Scale9GridInfo> &);
};
bool Scaleform::Render::ShapeMeshProvider::tessellateStroke(Scaleform::Render::HAL * hal, const Scaleform::Render::Scale9GridInfo * s9g, unsigned long strokeStyleIdx, unsigned long drawLayerIdx, Scaleform::Render::MeshBase * pmesh, Scaleform::Render::VertexOutput * pout, unsigned long meshGenFlags); // 0x140355D50
Scaleform::Render::Rect<float> Scaleform::Render::ShapeMeshProvider::getLayerBounds(unsigned long drawLayer); // 0x1403552A0
bool Scaleform::Render::ShapeMeshProvider::generateImage9Grid(Scaleform::Render::HAL * hal, Scaleform::Render::Scale9GridInfo * s9g, Scaleform::Render::VertexOutput * verOut, unsigned long drawLayer); // 0x140354E40
bool Scaleform::Render::ShapeMeshProvider::GetData(Scaleform::Render::HAL * hal, Scaleform::Render::MeshBase * mesh, Scaleform::Render::VertexOutput * verOut, unsigned long meshGenFlags); // 0x14034F340
class Scaleform::Ptr<Scaleform::Render::Scale9GridInfo>
{
protected:
	Scaleform::Render::Scale9GridInfo * pObject; // 0x0
public:
	Ptr<Scaleform::Render::Scale9GridInfo>(const Scaleform::Ptr<Scaleform::Render::Scale9GridInfo> &);
	Ptr<Scaleform::Render::Scale9GridInfo>(Scaleform::Render::Scale9GridInfo *);
	Ptr<Scaleform::Render::Scale9GridInfo>(Scaleform::Ptr<Scaleform::Render::Scale9GridInfo> &, Scaleform::PickType);
	Ptr<Scaleform::Render::Scale9GridInfo>(Scaleform::Pickable<Scaleform::Render::Scale9GridInfo>);
	Ptr<Scaleform::Render::Scale9GridInfo>(Scaleform::Render::Scale9GridInfo &);
	Ptr<Scaleform::Render::Scale9GridInfo>();
	~Ptr<Scaleform::Render::Scale9GridInfo>();
	bool operator==(Scaleform::Render::Scale9GridInfo *);
	bool operator==(const Scaleform::Ptr<Scaleform::Render::Scale9GridInfo> &);
	bool operator!=(Scaleform::Render::Scale9GridInfo *);
	bool operator!=(const Scaleform::Ptr<Scaleform::Render::Scale9GridInfo> &);
	bool operator<(const Scaleform::Ptr<Scaleform::Render::Scale9GridInfo> &);
