#pragma once

struct Scaleform::GFx::AS3::SH1<0,Scaleform::GFx::AS3::Value>
{
	struct SelfType;
	SH1<0,Scaleform::GFx::AS3::Value>(Scaleform::GFx::AS3::VSBase &);
	Scaleform::GFx::AS3::Value & _1; // 0x0
	bool IsOK();
	bool IsException();
private:
	Scaleform::GFx::AS3::SH1<0,Scaleform::GFx::AS3::Value> & operator=(const Scaleform::GFx::AS3::SH1<0,Scaleform::GFx::AS3::Value> &);
};
struct Scaleform::GFx::AS3::SH1<1,Scaleform::GFx::AS3::Value>
{
	struct SelfType;
	SH1<1,Scaleform::GFx::AS3::Value>(const Scaleform::GFx::AS3::SH1<1,Scaleform::GFx::AS3::Value> &);
	SH1<1,Scaleform::GFx::AS3::Value>(Scaleform::GFx::AS3::VSBase &);
	Scaleform::GFx::AS3::Value _1; // 0x0
	bool IsOK();
	bool IsException();
private:
	Scaleform::GFx::AS3::SH1<1,Scaleform::GFx::AS3::Value> & operator=(const Scaleform::GFx::AS3::SH1<1,Scaleform::GFx::AS3::Value> &);
public:
	~SH1<1,Scaleform::GFx::AS3::Value>();
};
struct Scaleform::GFx::AS3::TSH1<1,Scaleform::GFx::AS3::Value>
{
	struct SelfType;
	TSH1<1,Scaleform::GFx::AS3::Value>(const Scaleform::GFx::AS3::TSH1<1,Scaleform::GFx::AS3::Value> &);
	TSH1<1,Scaleform::GFx::AS3::Value>(Scaleform::GFx::AS3::VSBase &);
	Scaleform::GFx::AS3::Value _1; // 0x0
private:
	Scaleform::GFx::AS3::TSH1<1,Scaleform::GFx::AS3::Value> & operator=(const Scaleform::GFx::AS3::TSH1<1,Scaleform::GFx::AS3::Value> &);
public:
	~TSH1<1,Scaleform::GFx::AS3::Value>();
};
struct Scaleform::GFx::AS3::SH2<0,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>
{
	struct SelfType;
	SH2<0,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>(Scaleform::GFx::AS3::VSBase &);
	Scaleform::GFx::AS3::Value & _2; // 0x0
	Scaleform::GFx::AS3::Value & _1; // 0x8
	bool IsOK();
	bool IsException();
private:
	Scaleform::GFx::AS3::SH2<0,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value> & operator=(const Scaleform::GFx::AS3::SH2<0,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value> &);
};
struct Scaleform::GFx::AS3::SH2<1,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>
{
	struct SelfType;
	SH2<1,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>(const Scaleform::GFx::AS3::SH2<1,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value> &);
	SH2<1,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>(Scaleform::GFx::AS3::VSBase &);
	Scaleform::GFx::AS3::Value _2; // 0x0
	Scaleform::GFx::AS3::Value & _1; // 0x20
	bool IsOK();
	bool IsException();
private:
	Scaleform::GFx::AS3::SH2<1,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value> & operator=(const Scaleform::GFx::AS3::SH2<1,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value> &);
public:
	~SH2<1,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>();
};
struct Scaleform::GFx::AS3::TSH2<2,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>
{
	struct SelfType;
	TSH2<2,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>(const Scaleform::GFx::AS3::TSH2<2,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value> &);
	TSH2<2,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>(Scaleform::GFx::AS3::VSBase &);
	Scaleform::GFx::AS3::Value _2; // 0x0
	Scaleform::GFx::AS3::Value _1; // 0x20
private:
	Scaleform::GFx::AS3::TSH2<2,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value> & operator=(const Scaleform::GFx::AS3::TSH2<2,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value> &);
public:
	~TSH2<2,Scaleform::GFx::AS3::Value,Scaleform::GFx::AS3::Value>();
};