#include "dev/kof/master/development/source/baseproject/jni/framework/thread/mutex.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thread"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/memory"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xmemory"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thr/xthread"
#include "dev/silverware/git/sdk/agcondition.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/globalheapmemory.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/ogleffect.h"
#include "dev/silverware/git/sdk/input/agsdlmappingparser.h"
#include "dev/kof/master/development/source/ps4project/toolkit/geommath/matrix4unaligned.h"
#include "dev/silverware/git/sdk/filesystem/agfile.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/scalar_cpp/quat_aos.h"
#include "dev/silverware/git/sdk/platforms/pc/system/agpcsysteminfo.h"
#include "dev/silverware/git/sdk/filesystem/agpath.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/ogllight.h"
#include "dev/silverware/git/sdk/filesystem/agmount.h"
#include "dev/silverware/git/sdk/agreferencecountinl.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglcurve.h"

#include "dev/silverware/git/sdk/system/aguser.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/cmath"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "dev/silverware/git/sdk/agstring.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/math.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/internal/internal_math.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/mutex"
#include "dev/silverware/git/sdk/util/agservicecommand.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/string"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/chrono"
#include "dev/kof/master/development/source/baseproject/jni/framework/libcommon.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/scalar_cpp/vec_aos.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/limits"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xxatomic"
#include "dev/silverware/git/sdk/3rdparty/steam/matchmakingtypes.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/ios"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocnum"
#include "dev/silverware/git/sdk/system/agsysteminfo.h"
#include "dev/silverware/git/sdk/util/agdebugchannels.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xiosbase"
#include "dev/silverware/git/sdk/util/agperformancecounter.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocale"
#include "dev/silverware/git/sdk/agclock.h"
#include "program files (x86)/windows kits/8.1/include/um/winbase.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocinfo"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/mat_aos.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/debug/logging.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vector"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/heapmemory.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglvec3.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglvertexoptiinfo.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglinputstream.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglbone.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglmatrix.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglquat.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/pcdummy.cpp"

struct MATERIAL_EFFECT_INFO
{
	const char * str; // 0x0
	long flg; // 0x8
};
OGLFigure::OGLFigure(); // 0x140056130
std::_LaunchPad<std::unique_ptr<std::tuple<<lambda_1247ded54a2e5f087cbbad2046cfed3a> >,std::default_delete<std::tuple<<lambda_1247ded54a2e5f087cbbad2046cfed3a> > > > >::~_LaunchPad<std::unique_ptr<std::tuple<<lambda_1247ded54a2e5f087cbbad2046cfed3a> >,std::default_delete<std::tuple<<lambda_1247ded54a2e5f087cbbad2046cfed3a> > > > >(); // 0x14005DB00
OGLFigure * OGLFigure::createFigure(unsigned char * buf, long size, unsigned char bMemoryTypeCPU, unsigned char bNoMotion); // 0x140056210
void OGLFigure::finalize(); // 0x1400562B0
void OGLFigure::setNodeLevel(OGLBone * pBone); // 0x140056700
long OGLFigure::loadObacData(unsigned char * buffer, unsigned long size); // 0x140056790
void <lambda_230801668028c2b66e05f2ecff55509a>::operator()(); // 0x14005A810
class OGLFigure::loadObacData::__l448::<lambda_230801668028c2b66e05f2ecff55509a>
{
public:
	void operator()();
	<lambda_230801668028c2b66e05f2ecff55509a>(OGLFigure::loadObacData::__l448::<lambda_230801668028c2b66e05f2ecff55509a> &);
	<lambda_230801668028c2b66e05f2ecff55509a>();
	<lambda_230801668028c2b66e05f2ecff55509a>(OGLFigure * &, MeshVertexInfoComp * &);
private:
	OGLFigure * figure; // 0x0
	MeshVertexInfoComp * outV; // 0x8
public:
	OGLFigure::loadObacData::__l448::<lambda_230801668028c2b66e05f2ecff55509a> & operator=(const OGLFigure::loadObacData::__l448::<lambda_230801668028c2b66e05f2ecff55509a> &);
};
void <lambda_1247ded54a2e5f087cbbad2046cfed3a>::operator()(); // 0x14005AED0
class OGLFigure::loadObacData::__l465::<lambda_1247ded54a2e5f087cbbad2046cfed3a>
{
public:
	void operator()();
	<lambda_1247ded54a2e5f087cbbad2046cfed3a>(OGLFigure::loadObacData::__l465::<lambda_1247ded54a2e5f087cbbad2046cfed3a> &);
	<lambda_1247ded54a2e5f087cbbad2046cfed3a>();
	<lambda_1247ded54a2e5f087cbbad2046cfed3a>(OGLFigure * &, MeshVertexInfoComp * &);
private:
	OGLFigure * figure; // 0x0
	MeshVertexInfoComp * outV; // 0x8
public:
	OGLFigure::loadObacData::__l465::<lambda_1247ded54a2e5f087cbbad2046cfed3a> & operator=(const OGLFigure::loadObacData::__l465::<lambda_1247ded54a2e5f087cbbad2046cfed3a> &);
};
void <lambda_12b90ea9f2fd716190554ece8222dbaa>::operator()(); // 0x14005B5F0
class OGLFigure::loadObacData::__l501::<lambda_12b90ea9f2fd716190554ece8222dbaa>
{
public:
	void operator()();
	<lambda_12b90ea9f2fd716190554ece8222dbaa>(OGLFigure::loadObacData::__l501::<lambda_12b90ea9f2fd716190554ece8222dbaa> &);
	<lambda_12b90ea9f2fd716190554ece8222dbaa>();
	<lambda_12b90ea9f2fd716190554ece8222dbaa>(OGLFigure * &, MeshVertexInfo * &);
private:
	OGLFigure * figure; // 0x0
	MeshVertexInfo * outV; // 0x8
public:
	OGLFigure::loadObacData::__l501::<lambda_12b90ea9f2fd716190554ece8222dbaa> & operator=(const OGLFigure::loadObacData::__l501::<lambda_12b90ea9f2fd716190554ece8222dbaa> &);
};
void <lambda_49e167d41e58ceaf27bb79ed79325610>::operator()(); // 0x14005BC50
class OGLFigure::loadObacData::__l525::<lambda_49e167d41e58ceaf27bb79ed79325610>
{
public:
	void operator()();
	<lambda_49e167d41e58ceaf27bb79ed79325610>(OGLFigure::loadObacData::__l525::<lambda_49e167d41e58ceaf27bb79ed79325610> &);
	<lambda_49e167d41e58ceaf27bb79ed79325610>();
	<lambda_49e167d41e58ceaf27bb79ed79325610>(OGLFigure * &, MeshVertexInfo * &);
private:
	OGLFigure * figure; // 0x0
	MeshVertexInfo * outV; // 0x8
public:
	OGLFigure::loadObacData::__l525::<lambda_49e167d41e58ceaf27bb79ed79325610> & operator=(const OGLFigure::loadObacData::__l525::<lambda_49e167d41e58ceaf27bb79ed79325610> &);
};
const MATERIAL_EFFECT_INFO MaterialEffectInfo[28]; // 0x140889630
std::piecewise_construct_t std::piecewise_construct; // 0x14088952D
const MATERIAL_EFFECT_INFO MaterialAddEffectInfo[72]; // 0x1408896A0
long OGLFigure::loadBaseObacData(unsigned char * buffer, unsigned long size); // 0x14005C300
void OGLFigure::copyParamaterGPU(); // 0x14005D140
void OGLFigure::calcTangentAndBinormal(float * p0, float * uv0, float * p1, float * uv1, float * p2, float * uv2, float * outTangent, float * outBinormal); // 0x14005D250//decompilation failure at 140889630!
//decompilation failure at 14088952D!
//decompilation failure at 1408896A0!
void __fastcall std::_Launch<std::unique_ptr<std::tuple<_lambda_1247ded54a2e5f087cbbad2046cfed3a_>>>(
        _Thrd_imp_t *_Thr,
