#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_drawableimage.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/thread/mutex.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thread"
#include "dev/kof/master/development/source/baseproject/jni/game/network/netmanager.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_hal.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_buffer.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/memory"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xmemory"
#include "dev/kof/master/development/source/baseproject/jni/game/network/leaderboard.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/rapper/graphicsopt.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thr/xthread"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/gfx/gfx_characterdef.h"
#include "dev/silverware/git/sdk/agcondition.h"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/sound/ex_sound_manager.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/globalheapmemory.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.h"

#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglmaterial.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglmotion.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/lib/etc/math.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglsecondary.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/pcdummy.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglshader.cpp"

void multiplyDXGL(Matrix4Unaligned * Out, OGLMatrix * In0, OGLMatrix * In1); // 0x1400639A0
void * updatetask(void * ModelClass); // 0x140063BF0
OGLModel::OGLModel(); // 0x140063D80
_OGLModelBone::_OGLModelBone(); // 0x140068AE0
std::_LaunchPad<std::unique_ptr<std::tuple<<lambda_fd381105a0b1a60e3289d5f824c9282b> >,std::default_delete<std::tuple<<lambda_fd381105a0b1a60e3289d5f824c9282b> > > > >::~_LaunchPad<std::unique_ptr<std::tuple<<lambda_fd381105a0b1a60e3289d5f824c9282b> >,std::default_delete<std::tuple<<lambda_fd381105a0b1a60e3289d5f824c9282b> > > > >(); // 0x140078090
OGLModel::~OGLModel(); // 0x140063FD0
_OGLModelBone::~_OGLModelBone(); // 0x1400652F0
void OGLModel::initialize(); // 0x140064050
void OGLModel::finalize(); // 0x140064D60
void OGLModel::createIndex(); // 0x140065320
void OGLModel::createFigureIndex(OGLModel * pModel); // 0x140065960
void OGLModel::createExternalIndex(OGLModel * pModel); // 0x140065AE0
OGLAnimationBone * OGLModel::searchMotionBoneID(long iBoneNo, long * iMotionNo, long * iAniboneNo, unsigned char bParts); // 0x140065E30
void OGLModel::searchMotionBoneIDLight(long iBoneNo, long * iMotionNo, unsigned char bParts); // 0x140066000
long OGLModel::searchBoneFigureToSecondary(long no); // 0x140066160
void OGLModel::copyModel(OGLModel * pModel); // 0x1400661E0
void OGLModel::copyMotion(OGLModel * pModel); // 0x140066350
OGLMatrix * OGLModel::getBoneRot(long boneNo); // 0x140066850
unsigned char OGLModel::getBoneTrans(long boneNo, OGLVec3 * trans, OGLMatrix * posture); // 0x140066880
void OGLModel::getBoneMatrix(OGLMatrix * pOutMat, float * pLen, long boneNo, float fSizeY, float fOffset, OGLMatrix * pBoneMat); // 0x140066AC0
void OGLModel::getBoneMatrix(OGLMatrix * pOutMat, long boneNo, float fOffset, OGLMatrix * pBoneMat, float fSizeY2, OGLVec3 * vLine, float * fLen); // 0x140066F70
void OGLModel::setParent(OGLModel * model, long parentBone, long childBone); // 0x1400674B0
void OGLModel::changeParentMirror(unsigned char bMirror); // 0x140067510
long OGLModel::getBoneNoFromName(const char * boneName, long searchMode); // 0x1400675F0
void OGLModel::setTrans(OGLMatrix * mtx, long boneNo, unsigned char trans); // 0x140067670
void OGLModel::setTransTarget(OGLVec3 * vTargetPos, long boneNo, float fUp, float fDown, float fLeft, float fRight, float fBlend); // 0x140067700
void OGLModel::resetBoneChange(); // 0x140067810
void OGLModel::setFigure(OGLFigure * figure, unsigned char vaoFlg); // 0x1400679D0
void <lambda_fd381105a0b1a60e3289d5f824c9282b>::operator()(); // 0x1400686B0
class OGLModel::setFigure::__l2::<lambda_fd381105a0b1a60e3289d5f824c9282b>
{
public:
	void operator()();
	<lambda_fd381105a0b1a60e3289d5f824c9282b>(OGLModel::setFigure::__l2::<lambda_fd381105a0b1a60e3289d5f824c9282b> &);
	<lambda_fd381105a0b1a60e3289d5f824c9282b>();
	<lambda_fd381105a0b1a60e3289d5f824c9282b>(OGLFigure * &, MeshVertexInfo * &, MeshVertexInfoComp * &);
private:
	OGLFigure * figure; // 0x0
	MeshVertexInfo * outV; // 0x8
	MeshVertexInfoComp * inV; // 0x10
public:
	OGLModel::setFigure::__l2::<lambda_fd381105a0b1a60e3289d5f824c9282b> & operator=(const OGLModel::setFigure::__l2::<lambda_fd381105a0b1a60e3289d5f824c9282b> &);
};
std::piecewise_construct_t std::piecewise_construct; // 0x14088956F
void OGLModel::setOffsetScaleInit(OGLFigure * figure, long index); // 0x140068BA0
unsigned char OGLModel::setMotion(long index); // 0x1400690A0
unsigned char OGLModel::setExternalMotion(OGLModel * pModel, long index); // 0x140069140
unsigned char OGLModel::setTexture(OGLTexture * texture, long index, long index2); // 0x1400691F0
unsigned char OGLModel::setMaterialMap(long type, OGLTexture * texture, long index); // 0x140069250
unsigned char OGLModel::checkMotionMirror(unsigned char * bMirrorFlg); // 0x1400692D0
void OGLModel::syncPosture(); // 0x1400693E0
void OGLModel::updatePosture(OGLMatrix * posture, float blendRate, unsigned char bSync, unsigned long calcTarget); // 0x140069460
void OGLModel::updatePostureExe(OGLMatrix * posture, float blendRate); // 0x1400695E0
void OGLModel::updatePostureSecExe(OGLMatrix * posture, float blendRate); // 0x14006AD10
void OGLModel::updatePostureTPose(OGLMatrix * posture, float blendRate); // 0x14006B010
void OGLModel::setBoneTrans(OGLBone * parent, long iTransSec); // 0x14006B610
class Spline
{
private:
	long num; // 0x0
	double a[21]; // 0x8
	double b[21]; // 0xB0
	double c[21]; // 0x158
	double d[21]; // 0x200
public:
	Spline();
	void init(double *, long);
	double calc(double);
};
void calcSpline(OGLVec3 * pos, double * x, double * y, double * z, long num, float xt, float yt, float zt); // 0x14006BD70
void Spline::init(double * sp, long spnum); // 0x14006BF60
void OGLModel::setBoneForce(long iBoneNo, OGLVec3 vForce, unsigned long opt, float blend); // 0x14006C1F0
unsigned long OGLModel::getSecondaryState(long iBoneNo); // 0x14006C380
void OGLModel::setBoneTransNotSecOnce(long iChildNo, unsigned char bMirror); // 0x14006C3C0
void OGLModel::setBoneTransSecOnce(long iChildNo, unsigned char bMirror); // 0x14006D420
void OGLModel::checkFollowBone(); // 0x140072470
void OGLModel::setFollowBone(const char * followTargetBone, const char * followBone); // 0x140072550
OGLAnimationBone * OGLModel::searchMotionAnibone(long iBoneNo, long * iMotionNo, long * iAniboneNo); // 0x140072630
void OGLModel::searchMotionAniboneLight(long iBoneNo, long * iMotionNo); // 0x1400727C0
