#include "dev/kof/master/development/source/baseproject/jni/game/player/charafileformat/charadataunify.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_meshcache.h"
#include "dev/silverware/git/sdk/agdisplay.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/thread/mutex.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thread"
#include "dev/kof/master/development/source/baseproject/jni/game/player/charafileformat/charaattackdataformat.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_meshcacheconfig.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/util/texstring.h"
#include "dev/silverware/git/sdk/agvector4.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/memory"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xmemory"
#include "dev/kof/master/development/source/baseproject/jni/game/player/charafileformat/charadamagesettingformat.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_hairliner.h"
#include "dev/silverware/git/sdk/agvector3.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thr/xthread"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_filterdesc.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_stroker.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/silverware/git/sdk/util/agperformancecounter.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocale"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/imagefiles/dds_imagefile.h"
#include "dev/silverware/git/sdk/agclock.h"
#include "program files (x86)/windows kits/8.1/include/um/winbase.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocinfo"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/mat_aos.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/debug/logging.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vector"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/baseproject/jni/game/stage/battlestageresourcecontainer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_textmeshprovider.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_color.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/heapmemory.h"
#include "dev/kof/master/development/source/baseproject/jni/game/appmain.h"
#include "dev/kof/master/development/source/baseproject/jni/game/stage/battlestageshader.h"
#include "dev/kof/master/development/source/baseproject/jni/game/player/actor.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_glyphparam.h"
#include "dev/kof/master/development/source/ps4project/baseproject/pcdummy.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/core/glstate.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/util/cfile.cpp"

void _glCompressedTexImage2D(unsigned long target, long level, unsigned long internalformat, long width, long height, long border, long imageSize, const void * data); // 0x140090B60
OGLTexture::OGLTexture(); // 0x140090FF0
OGLTexture::~OGLTexture(); // 0x140091080
void OGLTexture::finalize(); // 0x1400910B0
void OGLTexture::loadIndexObmData(unsigned char * pLoadBuffer, unsigned char * pPalette, long texParam); // 0x1400911E0
void OGLTexture::loadDirectObmData(unsigned char * pLoadBuffer, long texParam); // 0x140091470
void OGLTexture::loadCompressedObmData(unsigned char * pLoadBuffer, long size, long texParam); // 0x140091950
long OGLTexture::loadObmData(unsigned char * pLoadBuffer, long size, unsigned char * pPalette, long texParam); // 0x140091CA0
struct _TEXTURE_FORMAT_HEADER
{
	char cID[2]; // 0x0
	char type; // 0x2
	char mipMapLevel; // 0x3
	short format; // 0x4
	short width; // 0x6
	short height; // 0x8
	short reserve2; // 0xA
	long size; // 0xC
};
long OGLTexture::loadOstData(unsigned char * pLoadBuffer, long size, unsigned char * pPalette, long texParam); // 0x140091D70
long OGLTexture::loadBmpData(unsigned char * pLoadBuffer, long keyIndex, unsigned char * pPalette, long texParam); // 0x140091F20
long OGLTexture::loadPngData(unsigned char * pLoadBuffer, long keyIndex, unsigned char * pPalette, long texParam); // 0x1400921F0
long OGLTexture::loadDDSData(unsigned char * pLoadBuffer, long keyIndex, unsigned char * pPalette, long texParam); // 0x140092480
struct OGLTexture::loadDDSData::__l2::DDS_PIXELFORMAT
{
	unsigned long dwSize; // 0x0
	unsigned long dwFlags; // 0x4
	unsigned long dwFourCC; // 0x8
	unsigned long dwRGBBitCount; // 0xC
	unsigned long dwRBitMask; // 0x10
	unsigned long dwGBitMask; // 0x14
	unsigned long dwBBitMask; // 0x18
	unsigned long dwABitMask; // 0x1C
};
std::piecewise_construct_t std::piecewise_construct; // 0x1408895DF
struct OGLTexture::loadDDSData::__l2::DDS_HEADER
{
	unsigned long dwSize; // 0x0
	unsigned long dwFlags; // 0x4
	unsigned long dwHeight; // 0x8
	unsigned long dwWidth; // 0xC
	unsigned long dwPitchOrLinearSize; // 0x10
	unsigned long dwDepth; // 0x14
	unsigned long dwMipMapCount; // 0x18
	unsigned long dwReserved1[11]; // 0x1C
	OGLTexture::loadDDSData::__l2::DDS_PIXELFORMAT ddspf; // 0x48
	unsigned long dwCaps; // 0x68
	unsigned long dwCaps2; // 0x6C
	unsigned long dwCaps3; // 0x70
	unsigned long dwCaps4; // 0x74
	unsigned long dwReserved2; // 0x78
};
enum OGLTexture::loadDDSData::__l2::DXGI_FORMAT
{
	DXGI_FORMAT_UNKNOWN = 0,
	DXGI_FORMAT_R32G32B32A32_TYPELESS = 1,
	DXGI_FORMAT_R32G32B32A32_FLOAT = 2,
	DXGI_FORMAT_R32G32B32A32_UINT = 3,
	DXGI_FORMAT_R32G32B32A32_SINT = 4,
	DXGI_FORMAT_R32G32B32_TYPELESS = 5,
	DXGI_FORMAT_R32G32B32_FLOAT = 6,
	DXGI_FORMAT_R32G32B32_UINT = 7,
	DXGI_FORMAT_R32G32B32_SINT = 8,
	DXGI_FORMAT_R16G16B16A16_TYPELESS = 9,
	DXGI_FORMAT_R16G16B16A16_FLOAT = 10,
	DXGI_FORMAT_R16G16B16A16_UNORM = 11,
	DXGI_FORMAT_R16G16B16A16_UINT = 12,
	DXGI_FORMAT_R16G16B16A16_SNORM = 13,
	DXGI_FORMAT_R16G16B16A16_SINT = 14,
	DXGI_FORMAT_R32G32_TYPELESS = 15,
	DXGI_FORMAT_R32G32_FLOAT = 16,
	DXGI_FORMAT_R32G32_UINT = 17,
	DXGI_FORMAT_R32G32_SINT = 18,
	DXGI_FORMAT_R32G8X24_TYPELESS = 19,
	DXGI_FORMAT_D32_FLOAT_S8X24_UINT = 20,
	DXGI_FORMAT_R32_FLOAT_X8X24_TYPELESS = 21,
	DXGI_FORMAT_X32_TYPELESS_G8X24_UINT = 22,
	DXGI_FORMAT_R10G10B10A2_TYPELESS = 23,
	DXGI_FORMAT_R10G10B10A2_UNORM = 24,
	DXGI_FORMAT_R10G10B10A2_UINT = 25,
	DXGI_FORMAT_R11G11B10_FLOAT = 26,
	DXGI_FORMAT_R8G8B8A8_TYPELESS = 27,
	DXGI_FORMAT_R8G8B8A8_UNORM = 28,
	DXGI_FORMAT_R8G8B8A8_UNORM_SRGB = 29,
	DXGI_FORMAT_R8G8B8A8_UINT = 30,
	DXGI_FORMAT_R8G8B8A8_SNORM = 31,
	DXGI_FORMAT_R8G8B8A8_SINT = 32,
	DXGI_FORMAT_R16G16_TYPELESS = 33,
	DXGI_FORMAT_R16G16_FLOAT = 34,
	DXGI_FORMAT_R16G16_UNORM = 35,
	DXGI_FORMAT_R16G16_UINT = 36,
	DXGI_FORMAT_R16G16_SNORM = 37,
	DXGI_FORMAT_R16G16_SINT = 38,
	DXGI_FORMAT_R32_TYPELESS = 39,
	DXGI_FORMAT_D32_FLOAT = 40,
	DXGI_FORMAT_R32_FLOAT = 41,
	DXGI_FORMAT_R32_UINT = 42,
	DXGI_FORMAT_R32_SINT = 43,
	DXGI_FORMAT_R24G8_TYPELESS = 44,
	DXGI_FORMAT_D24_UNORM_S8_UINT = 45,
	DXGI_FORMAT_R24_UNORM_X8_TYPELESS = 46,
	DXGI_FORMAT_X24_TYPELESS_G8_UINT = 47,
	DXGI_FORMAT_R8G8_TYPELESS = 48,
	DXGI_FORMAT_R8G8_UNORM = 49,
	DXGI_FORMAT_R8G8_UINT = 50,
	DXGI_FORMAT_R8G8_SNORM = 51,
	DXGI_FORMAT_R8G8_SINT = 52,
	DXGI_FORMAT_R16_TYPELESS = 53,
	DXGI_FORMAT_R16_FLOAT = 54,
	DXGI_FORMAT_D16_UNORM = 55,
	DXGI_FORMAT_R16_UNORM = 56,
	DXGI_FORMAT_R16_UINT = 57,
	DXGI_FORMAT_R16_SNORM = 58,
	DXGI_FORMAT_R16_SINT = 59,
	DXGI_FORMAT_R8_TYPELESS = 60,
	DXGI_FORMAT_R8_UNORM = 61,
	DXGI_FORMAT_R8_UINT = 62,
	DXGI_FORMAT_R8_SNORM = 63,
	DXGI_FORMAT_R8_SINT = 64,
	DXGI_FORMAT_A8_UNORM = 65,
	DXGI_FORMAT_R1_UNORM = 66,
	DXGI_FORMAT_R9G9B9E5_SHAREDEXP = 67,
	DXGI_FORMAT_R8G8_B8G8_UNORM = 68,
	DXGI_FORMAT_G8R8_G8B8_UNORM = 69,
	DXGI_FORMAT_BC1_TYPELESS = 70,
	DXGI_FORMAT_BC1_UNORM = 71,
	DXGI_FORMAT_BC1_UNORM_SRGB = 72,
	DXGI_FORMAT_BC2_TYPELESS = 73,
	DXGI_FORMAT_BC2_UNORM = 74,
	DXGI_FORMAT_BC2_UNORM_SRGB = 75,
	DXGI_FORMAT_BC3_TYPELESS = 76,
	DXGI_FORMAT_BC3_UNORM = 77,
	DXGI_FORMAT_BC3_UNORM_SRGB = 78,
	DXGI_FORMAT_BC4_TYPELESS = 79,
	DXGI_FORMAT_BC4_UNORM = 80,
	DXGI_FORMAT_BC4_SNORM = 81,
	DXGI_FORMAT_BC5_TYPELESS = 82,
	DXGI_FORMAT_BC5_UNORM = 83,
	DXGI_FORMAT_BC5_SNORM = 84,
	DXGI_FORMAT_B5G6R5_UNORM = 85,
	DXGI_FORMAT_B5G5R5A1_UNORM = 86,
	DXGI_FORMAT_B8G8R8A8_UNORM = 87,
	DXGI_FORMAT_B8G8R8X8_UNORM = 88,
	DXGI_FORMAT_R10G10B10_XR_BIAS_A2_UNORM = 89,
	DXGI_FORMAT_B8G8R8A8_TYPELESS = 90,
	DXGI_FORMAT_B8G8R8A8_UNORM_SRGB = 91,
	DXGI_FORMAT_B8G8R8X8_TYPELESS = 92,
	DXGI_FORMAT_B8G8R8X8_UNORM_SRGB = 93,
	DXGI_FORMAT_BC6H_TYPELESS = 94,
	DXGI_FORMAT_BC6H_UF16 = 95,
	DXGI_FORMAT_BC6H_SF16 = 96,
	DXGI_FORMAT_BC7_TYPELESS = 97,
	DXGI_FORMAT_BC7_UNORM = 98,
	DXGI_FORMAT_BC7_UNORM_SRGB = 99,
	DXGI_FORMAT_AYUV = 100,
	DXGI_FORMAT_Y410 = 101,
	DXGI_FORMAT_Y416 = 102,
	DXGI_FORMAT_NV12 = 103,
	DXGI_FORMAT_P010 = 104,
	DXGI_FORMAT_P016 = 105,
	DXGI_FORMAT_420_OPAQUE = 106,
	DXGI_FORMAT_YUY2 = 107,
	DXGI_FORMAT_Y210 = 108,
	DXGI_FORMAT_Y216 = 109,
	DXGI_FORMAT_NV11 = 110,
	DXGI_FORMAT_AI44 = 111,
	DXGI_FORMAT_IA44 = 112,
	DXGI_FORMAT_P8 = 113,
	DXGI_FORMAT_A8P8 = 114,
	DXGI_FORMAT_B4G4R4A4_UNORM = 115,
	DXGI_FORMAT_P208 = 130,
	DXGI_FORMAT_V208 = 131,
	DXGI_FORMAT_V408 = 132,
	DXGI_FORMAT_FORCE_UINT = 255,
};
struct OGLTexture::loadDDSData::__l2::DDS_HEADER_DXT10
{
	OGLTexture::loadDDSData::__l2::DXGI_FORMAT dxgiFormat; // 0x0
	OGLTexture::loadDDSData::__l2::D3D10_RESOURCE_DIMENSION resourceDimension; // 0x4
	unsigned long miscFlag; // 0x8
	unsigned long arraySize; // 0xC
	unsigned long miscFlags2; // 0x10
};
enum <unnamed-enum-kPVRTextureFlagTypePVRTC_2>
{
	kPVRTextureFlagTypePVRTC_2 = 24,
	kPVRTextureFlagTypePVRTC_4 = 25,
};
struct _PVRTexHeader
{
	unsigned long headerLength; // 0x0
	unsigned long height; // 0x4
	unsigned long width; // 0x8
	unsigned long numMipmaps; // 0xC
	unsigned long flags; // 0x10
	unsigned long dataLength; // 0x14
	unsigned long bpp; // 0x18
	unsigned long bitmaskRed; // 0x1C
	unsigned long bitmaskGreen; // 0x20
	unsigned long bitmaskBlue; // 0x24
	unsigned long bitmaskAlpha; // 0x28
	unsigned long pvrTag; // 0x2C
	unsigned long numSurfs; // 0x30
};
long OGLTexture::loadPvrData(unsigned char * pLoadBuffer, long size, long texParam); // 0x140092970
OGLTexture * OGLTexture::createTextureBuf(unsigned char * pLoadBuffer, long size, long texParam, unsigned char * pPalette, long keyIndex); // 0x140092A80
long OGLTexture::loadTextureBuf(unsigned char * pLoadBuffer, long size, long texParam, unsigned char * pPalette, long keyIndex); // 0x140092B50
long OGLTexture::loadTextureBuf2(unsigned char * pBuf, long w, long h, long texFormat, long texParam); // 0x140092C70
void OGLTexture::release(); // 0x140092ED0
void OGLTexture::capture(long x, long y, long w, long h, long texParam); // 0x140092FF0
void OGLTexture::setParameter(long TexParam, long bindTarget); // 0x1400931C0
long OGLTexture::getID(); // 0x140093400
void OGLTexture::setFileInfo(const char * pFileName, unsigned char bFilter, unsigned char bTransParent, long iOption); // 0x140093440//decompilation failure at 1408895DF!
