#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdlib.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/tuple"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/ios"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocnum"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/stdexcept"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/exception"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/type_traits"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xstddef"
#include "dev/silverware/git/sdk/agreferencecount.h"
#include "dev/silverware/git/sdk/agpointer.h"
#include "dev/silverware/git/sdk/audio/agaudiotypes.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/time.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xatomic0.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/system_error"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/mutex"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/chrono"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstring.h"
#include "dev/silverware/git/sdk/system/agsysteminfo.h"

#include "dev/silverware/git/sdk/filesystem/agpath.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xstring"
#include "dev/silverware/git/sdk/filesystem/agfile.h"
#include "dev/silverware/git/sdk/system/aguser.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xmemory0"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdio.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstdio.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vcruntime_new.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_stdio_config.h"
#include "dev/silverware/git/sdk/audio/agaudioeffects.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/wchar.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wconio.h"
#include "dev/silverware/git/src/3rdparty/libvpx/vp8dx.h"
#include "dev/silverware/git/src/3rdparty/libvpx/vp8.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vcruntime_exception.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thr/xthread"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/functional"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/limits"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wtime.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/map"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtree"
#include "dev/silverware/git/sdk/agreferencedobjectinl.h"
#include "dev/silverware/git/sdk/audio/agaudiomanager.h"
#include "dev/silverware/git/sdk/agmovieplayer.h"
#include "dev/silverware/git/sdk/agsingleton.h"
#include "dev/silverware/git/sdk/agconditionvariable.inl"
#include "dev/silverware/git/sdk/agreferencedobject.h"
#include "dev/silverware/git/sdk/audio/agaudiochannel.h"
#include "dev/silverware/git/sdk/agvector3.h"
#include "dev/silverware/git/sdk/agvector2.h"
#include "dev/silverware/git/sdk/agendian.inl"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xfacet"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thread"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/silverware/git/sdk/agthread.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/memory"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xmemory"
#include "dev/silverware/git/sdk/agmutex.h"
#include "dev/silverware/git/sdk/agscopedlock.h"
#include "dev/silverware/git/sdk/agstring.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtgmath.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtr1common"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/string"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vcruntime_typeinfo.h"

struct AgMoviePlayer::InternalData
{
	AgPointer<AgFile> m_videoFile; // 0x0
	AgPointer<AgFile> m_audioFile; // 0x10
	AgPointer<AgAudioSource> m_audioSource; // 0x20
	AgPointer<AgAudioChannel> m_audioChannel; // 0x30
	AgMoviePlayerPlaybackThreadHost * m_playbackThreadHost; // 0x40
	AgPointer<AgThread> m_playbackThread; // 0x48
	AgMoviePlayerDecodeThreadHost * m_decodeThreadHost; // 0x58
	AgPointer<AgThread> m_decodeThread; // 0x60
	long m_playbackRunning; // 0x70
	long m_decodeRunning; // 0x74
	volatile long m_decodeStarted; // 0x78
	long m_stop; // 0x7C
	long m_eof; // 0x80
	vpx_codec_ctx m_codecContext; // 0x88
	AgMutex m_codecLock; // 0xC0
	float m_frameRate; // 0xE8
	long m_frameCount; // 0xEC
	long m_currentFrame; // 0xF0
	AgClock m_clock; // 0xF8
	unsigned char * m_frameBuffer; // 0x120
	unsigned long m_frameBufferSize; // 0x128
	long m_currentWriteFrameBuffer; // 0x12C
	long m_currentReadFrameBuffer; // 0x130
	volatile long m_freeBuffers; // 0x134
	AgPointer<AgMemoryStream> m_frameBufferData[3][64]; // 0x138
	unsigned long m_frameSize; // 0xD38
	AgPointer<AgMemoryStream> m_frameData[3]; // 0xD40
	long m_width; // 0xD70
	long m_height; // 0xD74
	long m_stride; // 0xD78
	InternalData();
	~InternalData();
};
AgMoviePlayer::AgMoviePlayer(); // 0x140665570
AgMoviePlayer::InternalData::InternalData(); // 0x140665780
AgMoviePlayer::~AgMoviePlayer(); // 0x140665860
AgMoviePlayer::InternalData::~InternalData(); // 0x140665950
long AgMoviePlayer::start(const AgString & fileName, long playMusic); // 0x140666370
struct AgMoviePlayer::start::__l2::IVFHeader
{
	char signature[4]; // 0x0
	unsigned short version; // 0x4
	unsigned short length; // 0x6
	char fourCC[4]; // 0x8
	unsigned short width; // 0xC
	unsigned short height; // 0xE
	unsigned long frameRate; // 0x10
	unsigned long timeScale; // 0x14
	unsigned long frameCount; // 0x18
	unsigned long _pad; // 0x1C
};
typedef vpx_color_range vpx_color_range_t;
typedef vpx_codec_ctx vpx_codec_ctx_t;
typedef void(*vpx_decrypt_cb)(void *, const unsigned char *, unsigned char *, long);
typedef const void * vpx_codec_iter_t;
typedef vpx_ref_frame vpx_ref_frame_t;
typedef vp9_ref_frame vp9_ref_frame_t;
typedef long vpx_codec_flags_t;
typedef vpx_color_space vpx_color_space_t;
typedef vpx_img_fmt vpx_img_fmt_t;
typedef vpx_ref_frame_type vpx_ref_frame_type_t;
typedef vpx_codec_dec_cfg vpx_codec_dec_cfg_t;
typedef vpx_image vpx_image_t;
typedef vp8_postproc_cfg vp8_postproc_cfg_t;
typedef const vpx_codec_iface vpx_codec_iface_t;
void AgMoviePlayer::stop(); // 0x140666AC0
void AgMoviePlayerPlaybackThreadHost::onExecuteThread(); // 0x140666020
void AgMoviePlayerPlaybackThreadHost::onJoinThread(); // 0x140666360
long AgMoviePlayerPlaybackThreadHost::getThreadIsRunning(); // 0x140665C50
void AgMoviePlayerDecodeThreadHost::onExecuteThread(); // 0x140665CB0
struct AgMoviePlayerDecodeThreadHost::onExecuteThread::__l4::IVFFrameHeader
{
	unsigned long size; // 0x0
	unsigned long long timeStamp; // 0x4
};
void AgMoviePlayerDecodeThreadHost::onJoinThread(); // 0x140666350
long AgMoviePlayerDecodeThreadHost::getThreadIsRunning(); // 0x140665C40
AgPointer<AgMemoryStream> AgMoviePlayer::getFrame(long index); // 0x140665BD0
long AgMoviePlayer::getWidth(); // 0x140665C60
long AgMoviePlayer::getHeight(); // 0x140665C20
long AgMoviePlayer::getStride(); // 0x140665C30
long AgMoviePlayer::isStarted(); // 0x140665CA0
long AgMoviePlayer::isFinished(); // 0x140665C70
long AgMoviePlayer::getElapsedTimeMS(); // 0x140665BA0void __fastcall AgPointer<AgBuffer<AgAllocator<1>>>::AgPointer<AgBuffer<AgAllocator<1>>>(
        AgPointer<AgPlayer> *this,
        const AgPointer<AgPlayer> *rhs)
{
  AgReferenceCount *m_ref; // rsi
  int m_strongCount; // ebx

  this->m_ref = 0i64;
  this->m_ptr = 0i64;
  m_ref = rhs->m_ref;
  if ( rhs->m_ref )
  {
    m_strongCount = m_ref->m_strongCount;
    if ( m_ref->m_strongCount )
    {
