#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/baseproject/jni/game/network/netmanager.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_sgmlparser.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtgmath.h"
#include "dev/kof/master/development/source/baseproject/jni/game/network/leaderboard.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtr1common"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_file.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/vecidx_aos.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_shapedatafloat.h"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/sound/ex_sound_manager.h"
#include "dev/silverware/git/sdk/agmovieplayer.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/floatinvec.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/tuple"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/silverware/git/sdk/input/agcontroller.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/imagefiles/tga_imagefile.h"

#include "program files (x86)/microsoft visual studio 14.0/vc/include/xmemory"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "dev/kof/master/development/source/baseproject/jni/game/player/charafileformat/charaprojectdataformat.h"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/threading/exwaitcondition.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "dev/kof/master/development/source/baseproject/jni/game/player/charafileformat/charabasestatusformat.h"
#include "dev/silverware/git/sdk/3rdparty/steam/steamclientpublic.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_stroker.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/inputkeyrecord.h"
#include "dev/silverware/git/sdk/util/agdebugchannels.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/libcommon.h"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/sound/ex_sound_hashkey.h"
#include "dev/silverware/git/sdk/util/agperformancecounter.h"
#include "dev/kof/master/development/source/ps4project/baseproject/pcutil/pcdummy.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thread"
#include "dev/kof/master/development/source/baseproject/jni/game/battlehud/battlecall/battlecall.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/matchingsystem.h"
#include "dev/silverware/git/sdk/agclock.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/variableheapmemorybase.h"
#include "dev/silverware/git/sdk/agthread.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/memory"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/gfx/gfx_loader.h"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_debug.h"
#include "dev/silverware/git/sdk/agmutex.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_system.h"
#include "program files (x86)/windows kits/8.1/include/shared/stralign.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_cacheeffect.h"
#include "dev/kof/master/development/source/baseproject/jni/game/collision/bodypush.h"
#include "dev/silverware/git/sdk/agscopedlock.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_twips.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrixpool.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_cxform.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/commandcheck.cpp"

enum <unnamed-enum-FONT_JP>
{
	FONT_JP = 0,
	FONT_CN = 1,
	FONT_TW = 2,
	FONT_KR = 3,
};
struct extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint>
{
	float x; // 0x0
	float y; // 0x4
};
class extension::gfxi_detail::`anonymous-namespace'::MyCubicCurve
{
public:
	sce::Vectormath::Simd::Aos::Vector2 p1; // 0x0
	sce::Vectormath::Simd::Aos::Vector2 p2; // 0x8
	sce::Vectormath::Simd::Aos::Vector2 p3; // 0x10
	sce::Vectormath::Simd::Aos::Vector2 p4; // 0x18
	MyCubicCurve(sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2);
	MyCubicCurve();
	void divide(extension::gfxi_detail::`anonymous-namespace'::MyCubicCurve &, extension::gfxi_detail::`anonymous-namespace'::MyCubicCurve &, float);
	sce::Vectormath::Simd::Aos::Vector2 calcApproxQuadCP(float);
	extension::gfxi_detail::`anonymous-namespace'::MyCubicCurve & operator=(extension::gfxi_detail::`anonymous-namespace'::MyCubicCurve &);
	extension::gfxi_detail::`anonymous-namespace'::MyCubicCurve & operator=(const extension::gfxi_detail::`anonymous-namespace'::MyCubicCurve &);
};
class extension::gfxi_detail::`anonymous-namespace'::MyGlyphBuilder
{
private:
	Scaleform::Render::ShapePosInfo m_shapePosInfo; // 0x0
	Scaleform::Render::GlyphShape * m_shape; // 0x38
	float m_tolerance; // 0x40
	float m_fontSize; // 0x44
	float m_hintedSize; // 0x48
	sce::Vectormath::Simd::Aos::Vector2 quadInterp(float, sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2);
	float linePointDistance(sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2);
	void setTolerance(float, float);
public:
	MyGlyphBuilder(Scaleform::Render::GlyphShape *, float, float);
	void startPath(extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *);
	void startPath(sce::Vectormath::Simd::Aos::Vector2);
	void startPathMid(extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *, extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *);
	void startPathMid(sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2);
	void lineTo(extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *);
	void lineTo(sce::Vectormath::Simd::Aos::Vector2);
	void quadTo(extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *, extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *);
	void quadTo(sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2);
	void quadToMid(extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *, extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *);
	void quadToMid(sce::Vectormath::Simd::Aos::Vector2, sce::Vectormath::Simd::Aos::Vector2);
	void cubicToQuad(extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *, extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *, extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *, extension::gfxi_detail::<unnamed-type-GlyphOutlinePoint> *);
	void endPath();
	void endShape();
	bool isShapeEmpty();
private:
	void toQuad(const extension::gfxi_detail::`anonymous-namespace'::MyCubicCurve &);
	void toQuadRecursive(const extension::gfxi_detail::`anonymous-namespace'::MyCubicCurve &);
};
class extension::gfxi_detail::PS4MetricsCache
{
public:
	PS4MetricsCache();
private:
	PS4MetricsCache(const extension::gfxi_detail::PS4MetricsCache &);
	extension::gfxi_detail::PS4MetricsCache & operator=(const extension::gfxi_detail::PS4MetricsCache &);
public:
	static const unsigned long Cached_Char_Count; // 0xFFFFFFFFFFFFFFFF
	~PS4MetricsCache();
private:
	unsigned long bucketIndex(unsigned long);
	class LruLink;
	class BucketLink;
	struct Node;
	extension::gfxi_detail::PS4MetricsCache::Node m_NodeBuffer[1024]; // 0x0
	extension::gfxi_detail::PS4MetricsCache::BucketLink m_buckets[1024]; // 0xA000
	extension::gfxi_detail::PS4MetricsCache::LruLink m_lruNodes; // 0xE000
};
class extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink>
{
private:
	extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> * m_Prev; // 0x0
	extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> * m_Next; // 0x8
	BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink>(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> &);
public:
	BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink>();
protected:
	~BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink>();
public:
	static extension::gfxi_detail::PS4MetricsCache::LruLink * Prev(const extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> *);
	static extension::gfxi_detail::PS4MetricsCache::LruLink * Next(const extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> *);
	static void Link(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> *, extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> *);
	static void Isolate(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> *);
	static bool IsIsolated(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> *);
private:
	extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> & operator=(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink> &);
};
class extension::gfxi_detail::PS4MetricsCache::LruLink :
	extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::LruLink>
{
public:
	LruLink();
	~LruLink();
};
class extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink>
{
private:
	extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> * m_Prev; // 0x0
	extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> * m_Next; // 0x8
	BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink>(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> &);
public:
	BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink>();
protected:
	~BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink>();
public:
	static extension::gfxi_detail::PS4MetricsCache::BucketLink * Prev(const extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> *);
	static extension::gfxi_detail::PS4MetricsCache::BucketLink * Next(const extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> *);
	static void Link(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> *, extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> *);
	static void Isolate(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> *);
	static bool IsIsolated(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> *);
private:
	extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> & operator=(extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink> &);
};
class extension::gfxi_detail::PS4MetricsCache::BucketLink :
	extension::BiLinkable<extension::gfxi_detail::PS4MetricsCache::BucketLink>
{
public:
	BucketLink();
	~BucketLink();
};
struct extension::gfxi_detail::PS4MetricsCache::Node :
	extension::gfxi_detail::PS4MetricsCache::BucketLink,
	extension::gfxi_detail::PS4MetricsCache::LruLink
{
	unsigned long m_code; // 0x20
	long m_metrics; // 0x24
	Node();
	~Node();
};
class extension::gfxi_detail::CustomPS4Font :
	Scaleform::Render::Font
{
public:
	CustomPS4Font(unsigned long, Scaleform::Lock &, const std::string &, unsigned long);
private:
	CustomPS4Font(const extension::gfxi_detail::CustomPS4Font &);
	extension::gfxi_detail::CustomPS4Font & operator=(const extension::gfxi_detail::CustomPS4Font &);
public:
	virtual ~CustomPS4Font();
	virtual const char * GetName();
	virtual long GetGlyphIndex(unsigned short);
	virtual float GetAdvance(unsigned long);
	virtual float GetKerningAdjustment(unsigned long, unsigned long);
	virtual float GetGlyphWidth(unsigned long);
	virtual float GetGlyphHeight(unsigned long);
	virtual Scaleform::Render::Rect<float> & GetGlyphBounds(unsigned long, Scaleform::Render::Rect<float> *);
	virtual const Scaleform::Render::ShapeDataInterface * GetPermanentGlyphShape(unsigned long);
	float GetNOminalGlyphWidth();
	virtual float GetNominalGlyphHeight();
	virtual bool GetTemporaryGlyphShape(unsigned long, unsigned long, Scaleform::Render::GlyphShape *);
	virtual bool IsHintedVectorGlyph(unsigned long, unsigned long);
	bool IsFontOpened();
private:
	float defaultGlyphWidth();
	float defaultGlyphHeight();
	Scaleform::Lock * m_fontLock; // 0x38
	std::basic_string<char,std::char_traits<char>,std::allocator<char> > m_name; // 0x40
	float m_emSize; // 0x60
	unsigned long m_glyphCount; // 0x64
	extension::gfxi_detail::PS4MetricsCache m_metricsCache; // 0x68
};
class extension::gfxi_detail::CustomPS4FontProvider :
	extension::gfxi_detail::CustomFontProvider
{
public:
	CustomPS4FontProvider();
private:
	CustomPS4FontProvider(const extension::gfxi_detail::CustomPS4FontProvider &);
	extension::gfxi_detail::CustomPS4FontProvider & operator=(const extension::gfxi_detail::CustomPS4FontProvider &);
public:
	virtual ~CustomPS4FontProvider();
	virtual Scaleform::Render::Font * CreateFont(const char *, unsigned long);
	virtual void LoadFontNames(Scaleform::StringHash<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2> > &);
	virtual bool PrepareFontForApplicationLanguage(const char *, long);
private:
	void MapSystemFont(const char *, unsigned long);
	Scaleform::Lock m_fontLock; // 0x20
	std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > m_fontNameMap; // 0x50
	Scaleform::GFx::FontProviderWin32 * m_fontProvider; // 0x60
};
class std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > :
	std::_Tree<std::_Tmap_traits<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> >,0> >
{
	class _Myt;
	class _Mybase;
	class key_type;
	typedef unsigned long mapped_type;
	struct key_compare;
	class value_compare;
	class allocator_type;
	typedef unsigned long long size_type;
	typedef long long difference_type;
	typedef std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> pointer;
	typedef const std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> const_pointer;
	typedef std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> reference;
	typedef const std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> const_reference;
	class iterator;
	class const_iterator;
	class reverse_iterator;
	class const_reverse_iterator;
	struct value_type;
	struct _Alty;
	struct _Pairib;
public:
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(std::initializer_list<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> >, const std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > > &, const std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > &);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(std::initializer_list<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> >, const std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > > &);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(std::initializer_list<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> >);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > &, const std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > &);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > &);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(const std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > > &, const std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > &);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(const std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > > &);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(const std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > &, const std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > &);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(const std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > &);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha(const std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > &);
	map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<cha();
	std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > & operator=(std::initializer_list<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> >);
	std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > & operator=(std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > &);
	std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > & operator=(const std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > &);
	unsigned long & operator[](const std::string &);
	unsigned long & operator[](std::string &);
	void swap(std::map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<char> > const ,unsigned int> > > &);
	const unsigned long & at(const std::string &);
	unsigned long & at(const std::string &);
	~map<std::basic_string<char,std::char_traits<char>,std::allocator<char> >,unsigned int,std::less<std::basic_string<char,std::char_traits<char>,std::allocator<char> > >,std::allocator<std::pair<std::basic_string<char,std::char_traits<char>,std::allocator<ch();
};
std::piecewise_construct_t std::piecewise_construct; // 0x1408AED16
extension::gfxi_detail::CustomPS4FontProvider::CustomPS4FontProvider(); // 0x140271210
Scaleform::HashNode<Scaleform::String,Scaleform::String,Scaleform::String::NoCaseHashFunctor>::~HashNode<Scaleform::String,Scaleform::String,Scaleform::String::NoCaseHashFunctor>(); // 0x140271F20
extension::gfxi_detail::CustomPS4FontProvider::~CustomPS4FontProvider(); // 0x140271330
Scaleform::Render::Font * extension::gfxi_detail::CustomPS4FontProvider::CreateFont(const char * cname, unsigned long fontFlags); // 0x1402713D0
void extension::gfxi_detail::CustomPS4FontProvider::LoadFontNames(Scaleform::StringHash<Scaleform::String,Scaleform::AllocatorGH<Scaleform::String,2> > & fontnames); // 0x140271720
void extension::gfxi_detail::CustomPS4FontProvider::MapSystemFont(const char * name, unsigned long fontSetType); // 0x140271930
bool extension::gfxi_detail::CustomPS4FontProvider::PrepareFontForApplicationLanguage(const char * name, long appLanguage); // 0x140271A80
struct std::pair<enum LANGUAGE_MODE,unsigned int>
{
	struct _Myt;
	enum first_type
	{
		LANGUAGE_MODE_ja_JP = 0,
		LANGUAGE_MODE_en_US = 1,
		LANGUAGE_MODE_zh_CN = 2,
		LANGUAGE_MODE_zh_TW = 3,
		LANGUAGE_MODE_ko_KR = 4,
		LANGUAGE_MODE_fr_FR = 5,
		LANGUAGE_MODE_it_IT = 6,
		LANGUAGE_MODE_de_DE = 7,
		LANGUAGE_MODE_es_ES = 8,
		LANGUAGE_MODE_es_MX = 9,
		LANGUAGE_MODE_pt_BR = 10,
		LANGUAGE_MODE_pt_PT = 11,
		LANGUAGE_MODE_ru_RU = 12,
		LANGUAGE_MODE_MAX = 13,
	};
	typedef unsigned long second_type;
	pair<enum LANGUAGE_MODE,unsigned int>(std::pair<enum LANGUAGE_MODE,unsigned int> &);
	std::pair<enum LANGUAGE_MODE,unsigned int> & operator=(const std::pair<enum LANGUAGE_MODE,unsigned int> &);
	std::pair<enum LANGUAGE_MODE,unsigned int> & operator=(std::pair<enum LANGUAGE_MODE,unsigned int> &);
	LANGUAGE_MODE first; // 0x0
	unsigned long second; // 0x4
	void swap(std::pair<enum LANGUAGE_MODE,unsigned int> &);
};
Scaleform::Ptr<extension::gfxi_detail::CustomFontProvider> extension::gfxi_detail::CustomFontProvider::Create(); // 0x140271AF0//decompilation failure at 1408AED16!
void __fastcall Scaleform::HashSetBase<Scaleform::HashNode<Scaleform::String,Scaleform::String,Scaleform::String::NoCaseHashFunctor>,Scaleform::HashNode<Scaleform::String,Scaleform::String,Scaleform::String::NoCaseHashFunctor>::NodeHashF,Scaleform::HashNode<Scaleform::String,Scaleform::String,Scaleform::String::NoCaseHashFunctor>::NodeAltHashF,Scaleform::AllocatorGH<Scaleform::String,2>,Scaleform::HashsetCachedNodeEntry<Scaleform::HashNode<Scaleform::String,Scaleform::String,Scaleform::String::NoCaseHashFunctor>,Scaleform::HashNode<Scaleform::String,Scaleform::String,Scaleform::String::NoCaseHashFunctor>::NodeHashF>>::Set<Scaleform::HashNode<Scaleform::String,Scaleform::String,Scaleform::String::NoCaseHashFunctor>::NodeRef>(
