#include "dev/silverware/git/sdk/memory/agallocators.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_scale9grid.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_arraystaticbuff.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_hairliner.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_docview.h"
#include "dev/silverware/git/sdk/3rdparty/steam/isteamhtmlsurface.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_range.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtgmath.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_uncopyable.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xtr1common"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/vec_aos.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/boolinvec.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vcruntime_typeinfo.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_stroker.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xhash"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/refcountable.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/list"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_primitivebundle.h"
#include "dev/silverware/git/sdk/system/agsysteminfo.h"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/threading/atomic_int.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_treecachenode.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/atomic"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/type_traits"
#include "dev/silverware/git/sdk/agpointerinl.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/array"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_cacheeffect.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xxatomic"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xstddef"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix4x4.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/imagefiles/render_imagefile.h"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/threading/exwaitcondition.h"
#include "dev/silverware/git/sdk/agconditionvariable.inl"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"

class extension::gfxi_detail::CustomDrawTextManager :
	Scaleform::GFx::DrawTextManager
{
private:
	CustomDrawTextManager();
	CustomDrawTextManager(const extension::gfxi_detail::CustomDrawTextManager &);
	extension::gfxi_detail::CustomDrawTextManager & operator=(const extension::gfxi_detail::CustomDrawTextManager &);
public:
	static Scaleform::GFx::DrawTextManager * Create();
	struct TextParamsEx;
	static Scaleform::Render::Text::DocView & SetExtraParams(Scaleform::Render::Text::DocView &, const extension::gfxi_detail::CustomDrawTextManager::TextParamsEx &);
	static bool IsDefaultLineSpacing(float);
	Scaleform::Render::Size<float> GetTextExtent(const Scaleform::String &, float, const extension::gfxi_detail::CustomDrawTextManager::TextParamsEx &);
	Scaleform::Render::Size<float> GetHtmlTextExtent(const Scaleform::String &, float, const extension::gfxi_detail::CustomDrawTextManager::TextParamsEx &);
private:
	static void InitExtraValues(extension::gfxi_detail::CustomDrawTextManager::TextParamsEx &);
public:
	virtual ~CustomDrawTextManager();
};
struct extension::gfxi_detail::CustomDrawTextManager::TextParamsEx :
	Scaleform::GFx::DrawTextManager::TextParams
{
	float LineSpacing; // 0x28
	TextParamsEx(extension::gfxi_detail::CustomDrawTextManager::TextParamsEx &);
	TextParamsEx(const extension::gfxi_detail::CustomDrawTextManager::TextParamsEx &);
	TextParamsEx(const Scaleform::GFx::DrawTextManager::TextParams &);
	TextParamsEx();
	bool isDefaultLineSpacing();
	~TextParamsEx();
	extension::gfxi_detail::CustomDrawTextManager::TextParamsEx & operator=(extension::gfxi_detail::CustomDrawTextManager::TextParamsEx &);
	extension::gfxi_detail::CustomDrawTextManager::TextParamsEx & operator=(const extension::gfxi_detail::CustomDrawTextManager::TextParamsEx &);
};
extension::gfxi_detail::RefleshableTextNode extension::gfxi_detail::s_refleshableListEnd; // 0x140A5FD78
void(*extension::gfxi_detail::s_refleshableListEnd$initializer$)(); // 0x1407408A0
std::piecewise_construct_t std::piecewise_construct; // 0x1408AED18
extension::gfxi_detail::CustomDrawTextManager::CustomDrawTextManager(); // 0x140272BF0
Scaleform::Render::Text::DocView & extension::gfxi_detail::CustomDrawTextManager::SetExtraParams(Scaleform::Render::Text::DocView & target, const extension::gfxi_detail::CustomDrawTextManager::TextParamsEx & txtParamsEx); // 0x140272D60
Scaleform::Render::Size<float> extension::gfxi_detail::CustomDrawTextManager::GetTextExtent(const Scaleform::String & str, float width, const extension::gfxi_detail::CustomDrawTextManager::TextParamsEx & txtParamsEx); // 0x140272E90
Scaleform::Render::Size<float> extension::gfxi_detail::CustomDrawTextManager::GetHtmlTextExtent(const Scaleform::String & str, float width, const extension::gfxi_detail::CustomDrawTextManager::TextParamsEx & txtParamsEx); // 0x140273060
class extension::RefCountable<extension::gfxi_detail::TextProxy>
{
private:
	extension::AtomicInt m_refCount; // 0x0
	void addRef();
	void release();
protected:
	RefCountable<extension::gfxi_detail::TextProxy>(const extension::RefCountable<extension::gfxi_detail::TextProxy> &);
public:
	RefCountable<extension::gfxi_detail::TextProxy>();
protected:
	extension::RefCountable<extension::gfxi_detail::TextProxy> & operator=(const extension::RefCountable<extension::gfxi_detail::TextProxy> &);
	~RefCountable<extension::gfxi_detail::TextProxy>();
};
class extension::gfxi_detail::TextProxy :
	extension::RefCountable<extension::gfxi_detail::TextProxy>,
	extension::gfxi_detail::RefleshableTextNode
{
private:
	extension::gfxi_detail::TextProxy & operator=(const extension::gfxi_detail::TextProxy &);
	struct GTextParams;
	class GDrawText;
	class GPointF;
	class GSizeF;
	class GRectF;
	class GMatrix;
	class GString;
	struct FilterParams;
	extension::gfxi_detail::CustomDrawTextManager::TextParamsEx m_textParams; // 0x18
	bool m_isVisible; // 0x48
	float m_recommendWidth; // 0x4C
	Scaleform::Render::Point<float> m_position; // 0x50
	Scaleform::Render::Size<float> m_size; // 0x58
	Scaleform::Render::Point<float> m_pivot; // 0x60
	unsigned long m_bgColor; // 0x68
	extension::GFXIText::FilterParams m_filterParams; // 0x6C
	Scaleform::String m_str; // 0x90
	Scaleform::String m_htmlStr; // 0x98
	Scaleform::Ptr<Scaleform::GFx::DrawText> m_gtext; // 0xA0
	static extension::gfxi_detail::CustomDrawTextManager & GetManager();
	static extension::gfxi_detail::CustomDrawTextManager::TextParamsEx GetInitialTextParams(unsigned long);
	Scaleform::Render::Rect<float> makeTextRect();
	void applyTextRect(Scaleform::GFx::DrawText &);
	void applyTextMatrix(Scaleform::GFx::DrawText &);
	void applyExtraParams(Scaleform::GFx::DrawText &);
	void applyFilters(Scaleform::GFx::DrawText &);
public:
	TextProxy(const extension::gfxi_detail::TextProxy &);
	TextProxy(unsigned long);
	~TextProxy();
	void setIsRefleshable(bool);
	bool isVisible();
	void setVisible(bool);
	float recommendWidth();
	void setRecommendWidth(float);
	Scaleform::Render::Point<float> position();
	void setPosition(const Scaleform::Render::Point<float> &);
	Scaleform::Render::Size<float> size();
	Scaleform::Render::Point<float> pivot();
	void setPivot(const Scaleform::Render::Point<float> &);
	unsigned long textColor();
	void setTextColor(unsigned long);
	unsigned long bgColor();
	void setBgColor(unsigned long);
	const extension::GFXIText::FilterParams & filterParams();
	void setFilterParams(const extension::GFXIText::FilterParams &);
	Scaleform::GFx::DrawText::Alignment hAlign();
	void setHAlign(Scaleform::GFx::DrawText::Alignment);
	Scaleform::GFx::DrawText::VAlignment vAlign();
	void setVAlign(Scaleform::GFx::DrawText::VAlignment);
	bool isEmpty();
	const Scaleform::String & str();
	void setStr(const Scaleform::String &);
	const Scaleform::String & htmlStr();
	void setHtmlStr(const Scaleform::String &);
	const char * fontName();
	void setFontName(const char *);
	float fontSize();
	void setFontSize(float);
	float lineSpacing();
	bool isDefaultLineSpacing();
	static bool IsDefaultLineSpacing(float);
	bool isLineSpaceChanging(float);
	void setLineSpacing(float);
};
class Scaleform::Ptr<Scaleform::GFx::DrawText>
{
protected:
	Scaleform::GFx::DrawText * pObject; // 0x0
public:
	Ptr<Scaleform::GFx::DrawText>(const Scaleform::Ptr<Scaleform::GFx::DrawText> &);
	Ptr<Scaleform::GFx::DrawText>(Scaleform::GFx::DrawText *);
	Ptr<Scaleform::GFx::DrawText>(Scaleform::Ptr<Scaleform::GFx::DrawText> &, Scaleform::PickType);
	Ptr<Scaleform::GFx::DrawText>(Scaleform::Pickable<Scaleform::GFx::DrawText>);
	Ptr<Scaleform::GFx::DrawText>(Scaleform::GFx::DrawText &);
	Ptr<Scaleform::GFx::DrawText>();
	~Ptr<Scaleform::GFx::DrawText>();
	bool operator==(Scaleform::GFx::DrawText *);
	bool operator==(const Scaleform::Ptr<Scaleform::GFx::DrawText> &);
	bool operator!=(Scaleform::GFx::DrawText *);
	bool operator!=(const Scaleform::Ptr<Scaleform::GFx::DrawText> &);
	bool operator<(const Scaleform::Ptr<Scaleform::GFx::DrawText> &);
	Scaleform::Ptr<Scaleform::GFx::DrawText> & operator=(Scaleform::Pickable<Scaleform::GFx::DrawText>);
	const Scaleform::Ptr<Scaleform::GFx::DrawText> & operator=(Scaleform::GFx::DrawText &);
