#pragma once

enum Scaleform::<unnamed-enum-Mem_Stat>
{
	Mem_Stat = 328,
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Class>
{
public:
	Pickable<Scaleform::GFx::AS3::Class>(Scaleform::GFx::AS3::Class *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Class>(Scaleform::GFx::AS3::Class *);
	Pickable<Scaleform::GFx::AS3::Class>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Class> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Class> &);
	Scaleform::GFx::AS3::Class * GetPtr();
	Scaleform::GFx::AS3::Class * operator->();
	Scaleform::GFx::AS3::Class & operator*();
private:
	Scaleform::GFx::AS3::Class * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::DisplayObject>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::DisplayObject>(Scaleform::GFx::AS3::Instances::fl_display::DisplayObject *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::DisplayObject>(Scaleform::GFx::AS3::Instances::fl_display::DisplayObject *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::DisplayObject>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::DisplayObject> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::DisplayObject> &);
	Scaleform::GFx::AS3::Instances::fl_display::DisplayObject * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_display::DisplayObject * operator->();
	Scaleform::GFx::AS3::Instances::fl_display::DisplayObject & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_display::DisplayObject * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_events::Event>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_events::Event>(Scaleform::GFx::AS3::Instances::fl_events::Event *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_events::Event>(Scaleform::GFx::AS3::Instances::fl_events::Event *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_events::Event>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_events::Event> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_events::Event> &);
	Scaleform::GFx::AS3::Instances::fl_events::Event * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_events::Event * operator->();
	Scaleform::GFx::AS3::Instances::fl_events::Event & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_events::Event * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Traits const >
{
public:
	Pickable<Scaleform::GFx::AS3::Traits const >(const Scaleform::GFx::AS3::Traits *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Traits const >(const Scaleform::GFx::AS3::Traits *);
	Pickable<Scaleform::GFx::AS3::Traits const >();
	Scaleform::Pickable<Scaleform::GFx::AS3::Traits const > & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Traits const > &);
	const Scaleform::GFx::AS3::Traits * GetPtr();
	const Scaleform::GFx::AS3::Traits * operator->();
	const Scaleform::GFx::AS3::Traits & operator*();
private:
	const Scaleform::GFx::AS3::Traits * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard>(Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard>(Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard> &);
	Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard * operator->();
	Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_desktop::Clipboard * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions>(Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions>(Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions> &);
	Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions * operator->();
	Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_desktop::NativeDragOptions * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_filesystem::File>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_filesystem::File>(Scaleform::GFx::AS3::Instances::fl_filesystem::File *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_filesystem::File>(Scaleform::GFx::AS3::Instances::fl_filesystem::File *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_filesystem::File>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_filesystem::File> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_filesystem::File> &);
	Scaleform::GFx::AS3::Instances::fl_filesystem::File * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_filesystem::File * operator->();
	Scaleform::GFx::AS3::Instances::fl_filesystem::File & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_filesystem::File * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::Sprite>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::Sprite>(Scaleform::GFx::AS3::Instances::fl_display::Sprite *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::Sprite>(Scaleform::GFx::AS3::Instances::fl_display::Sprite *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::Sprite>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::Sprite> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::Sprite> &);
	Scaleform::GFx::AS3::Instances::fl_display::Sprite * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_display::Sprite * operator->();
	Scaleform::GFx::AS3::Instances::fl_display::Sprite & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_display::Sprite * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain>(Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain>(Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain> &);
	Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain * operator->();
	Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_system::ApplicationDomain * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Rectangle>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Rectangle>(Scaleform::GFx::AS3::Instances::fl_geom::Rectangle *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Rectangle>(Scaleform::GFx::AS3::Instances::fl_geom::Rectangle *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Rectangle>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Rectangle> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Rectangle> &);
	Scaleform::GFx::AS3::Instances::fl_geom::Rectangle * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_geom::Rectangle * operator->();
	Scaleform::GFx::AS3::Instances::fl_geom::Rectangle & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_geom::Rectangle * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::Array>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl::Array>(Scaleform::GFx::AS3::Instances::fl::Array *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl::Array>(Scaleform::GFx::AS3::Instances::fl::Array *);
	Pickable<Scaleform::GFx::AS3::Instances::fl::Array>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::Array> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::Array> &);
	Scaleform::GFx::AS3::Instances::fl::Array * GetPtr();
	Scaleform::GFx::AS3::Instances::fl::Array * operator->();
	Scaleform::GFx::AS3::Instances::fl::Array & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl::Array * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLRequest>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLRequest>(Scaleform::GFx::AS3::Instances::fl_net::URLRequest *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLRequest>(Scaleform::GFx::AS3::Instances::fl_net::URLRequest *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLRequest>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLRequest> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLRequest> &);
	Scaleform::GFx::AS3::Instances::fl_net::URLRequest * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_net::URLRequest * operator->();
	Scaleform::GFx::AS3::Instances::fl_net::URLRequest & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_net::URLRequest * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::Loader>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::Loader>(Scaleform::GFx::AS3::Instances::fl_display::Loader *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::Loader>(Scaleform::GFx::AS3::Instances::fl_display::Loader *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::Loader>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::Loader> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::Loader> &);
	Scaleform::GFx::AS3::Instances::fl_display::Loader * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_display::Loader * operator->();
	Scaleform::GFx::AS3::Instances::fl_display::Loader & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_display::Loader * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Vector3D>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Vector3D>(Scaleform::GFx::AS3::Instances::fl_geom::Vector3D *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Vector3D>(Scaleform::GFx::AS3::Instances::fl_geom::Vector3D *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Vector3D>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Vector3D> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Vector3D> &);
	Scaleform::GFx::AS3::Instances::fl_geom::Vector3D * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_geom::Vector3D * operator->();
	Scaleform::GFx::AS3::Instances::fl_geom::Vector3D & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_geom::Vector3D * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::VMAppDomain>
{
public:
	Pickable<Scaleform::GFx::AS3::VMAppDomain>(Scaleform::GFx::AS3::VMAppDomain *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::VMAppDomain>(Scaleform::GFx::AS3::VMAppDomain *);
	Pickable<Scaleform::GFx::AS3::VMAppDomain>();
	Scaleform::Pickable<Scaleform::GFx::AS3::VMAppDomain> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::VMAppDomain> &);
	Scaleform::GFx::AS3::VMAppDomain * GetPtr();
	Scaleform::GFx::AS3::VMAppDomain * operator->();
	Scaleform::GFx::AS3::VMAppDomain & operator*();
private:
	Scaleform::GFx::AS3::VMAppDomain * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix>(Scaleform::GFx::AS3::Instances::fl_geom::Matrix *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix>(Scaleform::GFx::AS3::Instances::fl_geom::Matrix *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix> &);
	Scaleform::GFx::AS3::Instances::fl_geom::Matrix * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_geom::Matrix * operator->();
	Scaleform::GFx::AS3::Instances::fl_geom::Matrix & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_geom::Matrix * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Point>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Point>(Scaleform::GFx::AS3::Instances::fl_geom::Point *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Point>(Scaleform::GFx::AS3::Instances::fl_geom::Point *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Point>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Point> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Point> &);
	Scaleform::GFx::AS3::Instances::fl_geom::Point * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_geom::Point * operator->();
	Scaleform::GFx::AS3::Instances::fl_geom::Point & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_geom::Point * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::BitmapData>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::BitmapData>(Scaleform::GFx::AS3::Instances::fl_display::BitmapData *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::BitmapData>(Scaleform::GFx::AS3::Instances::fl_display::BitmapData *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::BitmapData>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::BitmapData> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::BitmapData> &);
	Scaleform::GFx::AS3::Instances::fl_display::BitmapData * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_display::BitmapData * operator->();
	Scaleform::GFx::AS3::Instances::fl_display::BitmapData & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_display::BitmapData * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo>(Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo>(Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo> &);
	Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo * operator->();
	Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter>(Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter>(Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter> &);
	Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter * operator->();
	Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_filters::BitmapFilter * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D>(Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D>(Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D> &);
	Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D * operator->();
	Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_geom::Matrix3D * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLLoader>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLLoader>(Scaleform::GFx::AS3::Instances::fl_net::URLLoader *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLLoader>(Scaleform::GFx::AS3::Instances::fl_net::URLLoader *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLLoader>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLLoader> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_net::URLLoader> &);
	Scaleform::GFx::AS3::Instances::fl_net::URLLoader * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_net::URLLoader * operator->();
	Scaleform::GFx::AS3::Instances::fl_net::URLLoader & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_net::URLLoader * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::QName>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl::QName>(Scaleform::GFx::AS3::Instances::fl::QName *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl::QName>(Scaleform::GFx::AS3::Instances::fl::QName *);
	Pickable<Scaleform::GFx::AS3::Instances::fl::QName>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::QName> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::QName> &);
	Scaleform::GFx::AS3::Instances::fl::QName * GetPtr();
	Scaleform::GFx::AS3::Instances::fl::QName * operator->();
	Scaleform::GFx::AS3::Instances::fl::QName & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl::QName * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::GASRefCountBase>
{
public:
	Pickable<Scaleform::GFx::AS3::GASRefCountBase>(Scaleform::GFx::AS3::GASRefCountBase *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::GASRefCountBase>(Scaleform::GFx::AS3::GASRefCountBase *);
	Pickable<Scaleform::GFx::AS3::GASRefCountBase>();
	Scaleform::Pickable<Scaleform::GFx::AS3::GASRefCountBase> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::GASRefCountBase> &);
	Scaleform::GFx::AS3::GASRefCountBase * GetPtr();
	Scaleform::GFx::AS3::GASRefCountBase * operator->();
	Scaleform::GFx::AS3::GASRefCountBase & operator*();
private:
	Scaleform::GFx::AS3::GASRefCountBase * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::Traits const >
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::Traits const >(const Scaleform::GFx::AS3::ClassTraits::Traits *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::Traits const >(const Scaleform::GFx::AS3::ClassTraits::Traits *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::Traits const >();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::Traits const > & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::Traits const > &);
	const Scaleform::GFx::AS3::ClassTraits::Traits * GetPtr();
	const Scaleform::GFx::AS3::ClassTraits::Traits * operator->();
	const Scaleform::GFx::AS3::ClassTraits::Traits & operator*();
private:
	const Scaleform::GFx::AS3::ClassTraits::Traits * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_xml::XMLNode>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl_xml::XMLNode>(Scaleform::GFx::AS3::Instances::fl_xml::XMLNode *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl_xml::XMLNode>(Scaleform::GFx::AS3::Instances::fl_xml::XMLNode *);
	Pickable<Scaleform::GFx::AS3::Instances::fl_xml::XMLNode>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_xml::XMLNode> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_xml::XMLNode> &);
	Scaleform::GFx::AS3::Instances::fl_xml::XMLNode * GetPtr();
	Scaleform::GFx::AS3::Instances::fl_xml::XMLNode * operator->();
	Scaleform::GFx::AS3::Instances::fl_xml::XMLNode & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl_xml::XMLNode * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::Domain>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl::Domain>(Scaleform::GFx::AS3::Instances::fl::Domain *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl::Domain>(Scaleform::GFx::AS3::Instances::fl::Domain *);
	Pickable<Scaleform::GFx::AS3::Instances::fl::Domain>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::Domain> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::Domain> &);
	Scaleform::GFx::AS3::Instances::fl::Domain * GetPtr();
	Scaleform::GFx::AS3::Instances::fl::Domain * operator->();
	Scaleform::GFx::AS3::Instances::fl::Domain & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl::Domain * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Thunk>
{
public:
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Thunk>(Scaleform::GFx::AS3::InstanceTraits::fl::Thunk *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Thunk>(Scaleform::GFx::AS3::InstanceTraits::fl::Thunk *);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Thunk>();
	Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Thunk> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Thunk> &);
	Scaleform::GFx::AS3::InstanceTraits::fl::Thunk * GetPtr();
	Scaleform::GFx::AS3::InstanceTraits::fl::Thunk * operator->();
	Scaleform::GFx::AS3::InstanceTraits::fl::Thunk & operator*();
private:
	Scaleform::GFx::AS3::InstanceTraits::fl::Thunk * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Catch>
{
public:
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Catch>(Scaleform::GFx::AS3::InstanceTraits::fl::Catch *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Catch>(Scaleform::GFx::AS3::InstanceTraits::fl::Catch *);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Catch>();
	Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Catch> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Catch> &);
	Scaleform::GFx::AS3::InstanceTraits::fl::Catch * GetPtr();
	Scaleform::GFx::AS3::InstanceTraits::fl::Catch * operator->();
	Scaleform::GFx::AS3::InstanceTraits::fl::Catch & operator*();
private:
	Scaleform::GFx::AS3::InstanceTraits::fl::Catch * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd>
{
public:
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd>(Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd>(Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd *);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd>();
	Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd> &);
	Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd * GetPtr();
	Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd * operator->();
	Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd & operator*();
private:
	Scaleform::GFx::AS3::InstanceTraits::fl::MethodInd * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::VMAbcFile>
{
public:
	Pickable<Scaleform::GFx::AS3::VMAbcFile>(Scaleform::GFx::AS3::VMAbcFile *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::VMAbcFile>(Scaleform::GFx::AS3::VMAbcFile *);
	Pickable<Scaleform::GFx::AS3::VMAbcFile>();
	Scaleform::Pickable<Scaleform::GFx::AS3::VMAbcFile> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::VMAbcFile> &);
	Scaleform::GFx::AS3::VMAbcFile * GetPtr();
	Scaleform::GFx::AS3::VMAbcFile * operator->();
	Scaleform::GFx::AS3::VMAbcFile & operator*();
private:
	Scaleform::GFx::AS3::VMAbcFile * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd>
{
public:
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd>(Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd>(Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd *);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd>();
	Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd> &);
	Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd * GetPtr();
	Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd * operator->();
	Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd & operator*();
private:
	Scaleform::GFx::AS3::InstanceTraits::fl::VTableInd * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction>
{
public:
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction>(Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction>(Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction *);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction>();
	Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction> &);
	Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction * GetPtr();
	Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction * operator->();
	Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction & operator*();
private:
	Scaleform::GFx::AS3::InstanceTraits::fl::ThunkFunction * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject>
{
public:
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject>(Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject>(Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject *);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject>();
	Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject> &);
	Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject * GetPtr();
	Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject * operator->();
	Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject & operator*();
private:
	Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObject * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::XMLSupport>
{
public:
	Pickable<Scaleform::GFx::AS3::XMLSupport>(Scaleform::GFx::AS3::XMLSupport *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::XMLSupport>(Scaleform::GFx::AS3::XMLSupport *);
	Pickable<Scaleform::GFx::AS3::XMLSupport>();
	Scaleform::Pickable<Scaleform::GFx::AS3::XMLSupport> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::XMLSupport> &);
	Scaleform::GFx::AS3::XMLSupport * GetPtr();
	Scaleform::GFx::AS3::XMLSupport * operator->();
	Scaleform::GFx::AS3::XMLSupport & operator*();
private:
	Scaleform::GFx::AS3::XMLSupport * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain>(Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain>(Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain> &);
	Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl_system::ApplicationDomain * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Catch>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Catch>(Scaleform::GFx::AS3::ClassTraits::fl::Catch *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Catch>(Scaleform::GFx::AS3::ClassTraits::fl::Catch *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Catch>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Catch> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Catch> &);
	Scaleform::GFx::AS3::ClassTraits::fl::Catch * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::Catch * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::Catch & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::Catch * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Array>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Array>(Scaleform::GFx::AS3::ClassTraits::fl::Array *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Array>(Scaleform::GFx::AS3::ClassTraits::fl::Array *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Array>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Array> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Array> &);
	Scaleform::GFx::AS3::ClassTraits::fl::Array * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::Array * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::Array & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::Array * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int> &);
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_int * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XML>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XML>(Scaleform::GFx::AS3::ClassTraits::fl::XML *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XML>(Scaleform::GFx::AS3::ClassTraits::fl::XML *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XML>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XML> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XML> &);
	Scaleform::GFx::AS3::ClassTraits::fl::XML * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::XML * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::XML & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::XML * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::QName>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::QName>(Scaleform::GFx::AS3::ClassTraits::fl::QName *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::QName>(Scaleform::GFx::AS3::ClassTraits::fl::QName *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::QName>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::QName> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::QName> &);
	Scaleform::GFx::AS3::ClassTraits::fl::QName * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::QName * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::QName & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::QName * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::uint>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::uint>(Scaleform::GFx::AS3::ClassTraits::fl::uint *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::uint>(Scaleform::GFx::AS3::ClassTraits::fl::uint *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::uint>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::uint> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::uint> &);
	Scaleform::GFx::AS3::ClassTraits::fl::uint * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::uint * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::uint & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::uint * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double> &);
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_double * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Domain>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Domain>(Scaleform::GFx::AS3::ClassTraits::fl::Domain *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Domain>(Scaleform::GFx::AS3::ClassTraits::fl::Domain *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Domain>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Domain> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Domain> &);
	Scaleform::GFx::AS3::ClassTraits::fl::Domain * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::Domain * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::Domain & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::Domain * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Boolean>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Boolean>(Scaleform::GFx::AS3::ClassTraits::fl::Boolean *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Boolean>(Scaleform::GFx::AS3::ClassTraits::fl::Boolean *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Boolean>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Boolean> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Boolean> &);
	Scaleform::GFx::AS3::ClassTraits::fl::Boolean * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::Boolean * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::Boolean & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::Boolean * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String> &);
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_String * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript>
{
public:
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript>(Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript>(Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript *);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript>();
	Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript> &);
	Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript * GetPtr();
	Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript * operator->();
	Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript & operator*();
private:
	Scaleform::GFx::AS3::InstanceTraits::fl::GlobalObjectScript * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::void_>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::void_>(Scaleform::GFx::AS3::ClassTraits::fl::void_ *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::void_>(Scaleform::GFx::AS3::ClassTraits::fl::void_ *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::void_>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::void_> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::void_> &);
	Scaleform::GFx::AS3::ClassTraits::fl::void_ * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::void_ * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::void_ & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::void_ * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::int_>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::int_>(Scaleform::GFx::AS3::ClassTraits::fl::int_ *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::int_>(Scaleform::GFx::AS3::ClassTraits::fl::int_ *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::int_>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::int_> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::int_> &);
	Scaleform::GFx::AS3::ClassTraits::fl::int_ * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::int_ * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::int_ & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::int_ * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector> &);
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::String>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::String>(Scaleform::GFx::AS3::ClassTraits::fl::String *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::String>(Scaleform::GFx::AS3::ClassTraits::fl::String *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::String>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::String> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::String> &);
	Scaleform::GFx::AS3::ClassTraits::fl::String * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::String * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::String & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::String * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Namespace>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Namespace>(Scaleform::GFx::AS3::ClassTraits::fl::Namespace *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Namespace>(Scaleform::GFx::AS3::ClassTraits::fl::Namespace *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Namespace>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Namespace> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Namespace> &);
	Scaleform::GFx::AS3::ClassTraits::fl::Namespace * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::Namespace * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::Namespace & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::Namespace * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint>(Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint> &);
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl_vec::Vector_uint * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Function>
{
public:
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Function>(Scaleform::GFx::AS3::InstanceTraits::fl::Function *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Function>(Scaleform::GFx::AS3::InstanceTraits::fl::Function *);
	Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Function>();
	Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Function> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::InstanceTraits::fl::Function> &);
	Scaleform::GFx::AS3::InstanceTraits::fl::Function * GetPtr();
	Scaleform::GFx::AS3::InstanceTraits::fl::Function * operator->();
	Scaleform::GFx::AS3::InstanceTraits::fl::Function & operator*();
private:
	Scaleform::GFx::AS3::InstanceTraits::fl::Function * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XMLList>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XMLList>(Scaleform::GFx::AS3::ClassTraits::fl::XMLList *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XMLList>(Scaleform::GFx::AS3::ClassTraits::fl::XMLList *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XMLList>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XMLList> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::XMLList> &);
	Scaleform::GFx::AS3::ClassTraits::fl::XMLList * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::XMLList * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::XMLList & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::XMLList * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP>
{
public:
	Pickable<Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP>(Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP>(Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP *);
	Pickable<Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP> &);
	Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP * GetPtr();
	Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP * operator->();
	Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP & operator*();
private:
	Scaleform::GFx::AS3::Instances::fl::GlobalObjectCPP * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Number>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Number>(Scaleform::GFx::AS3::ClassTraits::fl::Number *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Number>(Scaleform::GFx::AS3::ClassTraits::fl::Number *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Number>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Number> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Number> &);
	Scaleform::GFx::AS3::ClassTraits::fl::Number * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::Number * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::Number & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::Number * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Function>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Function>(Scaleform::GFx::AS3::ClassTraits::fl::Function *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Function>(Scaleform::GFx::AS3::ClassTraits::fl::Function *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Function>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Function> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Function> &);
	Scaleform::GFx::AS3::ClassTraits::fl::Function * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::Function * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::Function & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::Function * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::ClassClass>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::ClassClass>(Scaleform::GFx::AS3::ClassTraits::ClassClass *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::ClassClass>(Scaleform::GFx::AS3::ClassTraits::ClassClass *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::ClassClass>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::ClassClass> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::ClassClass> &);
	Scaleform::GFx::AS3::ClassTraits::ClassClass * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::ClassClass * operator->();
	Scaleform::GFx::AS3::ClassTraits::ClassClass & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::ClassClass * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::Traits>
{
public:
	Pickable<Scaleform::GFx::AS3::Traits>(Scaleform::GFx::AS3::Traits *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::Traits>(Scaleform::GFx::AS3::Traits *);
	Pickable<Scaleform::GFx::AS3::Traits>();
	Scaleform::Pickable<Scaleform::GFx::AS3::Traits> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::Traits> &);
	Scaleform::GFx::AS3::Traits * GetPtr();
	Scaleform::GFx::AS3::Traits * operator->();
	Scaleform::GFx::AS3::Traits & operator*();
private:
	Scaleform::GFx::AS3::Traits * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray>(Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray>(Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray> &);
	Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl_utils::ByteArray * pV; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Object>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Object>(Scaleform::GFx::AS3::ClassTraits::fl::Object *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Object>(Scaleform::GFx::AS3::ClassTraits::fl::Object *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Object>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Object> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::fl::Object> &);
	Scaleform::GFx::AS3::ClassTraits::fl::Object * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::fl::Object * operator->();
	Scaleform::GFx::AS3::ClassTraits::fl::Object & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::fl::Object * pV; // 0x0
};
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo>::operator=(const Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::LoaderInfo> & other); // 0x140456DD0
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::DisplayObject> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::DisplayObject>::operator=(const Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::DisplayObject> & other); // 0x140456DD0
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_net::SharedObject> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_net::SharedObject>::operator=(const Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_net::SharedObject> & other); // 0x140456DD0
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>::operator=(const Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain> & other); // 0x140456DD0
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_text::StyleSheet> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_text::StyleSheet>::operator=(const Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_text::StyleSheet> & other); // 0x140456DD0
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>::operator=(const Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace> & other); // 0x140456DD0
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const > & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const >::operator=(const Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace const > & other); // 0x140456DD0
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_utils::ByteArray> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_utils::ByteArray>::operator=(Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_utils::ByteArray> v); // 0x140456D70
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Namespace>::operator=(Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl::Namespace> v); // 0x140456D70
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_utils::Dictionary> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_utils::Dictionary>::operator=(Scaleform::Pickable<Scaleform::GFx::AS3::Instances::fl_utils::Dictionary> v); // 0x140456D70
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_events::Event> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_events::Event>::SetPtr(Scaleform::GFx::AS3::Instances::fl_events::Event * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Object> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::Object>::SetPtr(Scaleform::GFx::AS3::Instances::fl::Object * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::DisplayObjectContainer> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::DisplayObjectContainer>::SetPtr(Scaleform::GFx::AS3::Instances::fl_display::DisplayObjectContainer * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::BitmapData> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::BitmapData>::SetPtr(Scaleform::GFx::AS3::Instances::fl_display::BitmapData * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_geom::Point> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_geom::Point>::SetPtr(Scaleform::GFx::AS3::Instances::fl_geom::Point * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::InteractiveObject> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_display::InteractiveObject>::SetPtr(Scaleform::GFx::AS3::Instances::fl_display::InteractiveObject * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::VMAppDomain>::SetPtr(Scaleform::GFx::AS3::VMAppDomain * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_text::StyleSheet> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_text::StyleSheet>::SetPtr(Scaleform::GFx::AS3::Instances::fl_text::StyleSheet * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_vec::Vector_String> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl_vec::Vector_String>::SetPtr(Scaleform::GFx::AS3::Instances::fl_vec::Vector_String * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::GlobalObjectScript> & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Instances::fl::GlobalObjectScript>::SetPtr(Scaleform::GFx::AS3::Instances::fl::GlobalObjectScript * p); // 0x1404A9210
Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Traits const > & Scaleform::GFx::AS3::SPtr<Scaleform::GFx::AS3::Traits const >::SetPtr(const Scaleform::GFx::AS3::Traits * p); // 0x1404A9210
class Scaleform::GFx::AS3::GCGuard
{
public:
	GCGuard(Scaleform::GFx::AS3::Object *);
	~GCGuard();
private:
	Scaleform::GFx::AS3::Object * pObject; // 0x0
};
class Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::Traits>
{
public:
	Pickable<Scaleform::GFx::AS3::ClassTraits::Traits>(Scaleform::GFx::AS3::ClassTraits::Traits *, Scaleform::PickType);
	Pickable<Scaleform::GFx::AS3::ClassTraits::Traits>(Scaleform::GFx::AS3::ClassTraits::Traits *);
	Pickable<Scaleform::GFx::AS3::ClassTraits::Traits>();
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::Traits> & operator=(const Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::Traits> &);
	Scaleform::GFx::AS3::ClassTraits::Traits * GetPtr();
	Scaleform::GFx::AS3::ClassTraits::Traits * operator->();
	Scaleform::GFx::AS3::ClassTraits::Traits & operator*();
private:
	Scaleform::GFx::AS3::ClassTraits::Traits * pV; // 0x0
};
struct Scaleform::GFx::AS3::TypeInfo
{
	enum <unnamed-enum-TimeTypeOffset>
	{
		TimeTypeOffset = 0,
		ObjectTypeOffset = 1,
		ImplTypeOffset = 2,
		FinalTypeOffset = 3,
		ClassTypeOffset = 4,
		NotImplTypeOffset = 5,
	};
	enum <unnamed-enum-TimeTypeMask>
	{
		TimeTypeMask = 1,
		ObjectTypeMask = 2,
		ImplTypeMask = 4,
		FinalTypeMask = 8,
		ClassTypeMask = 16,
		NotImplTypeMask = 32,
	};
	enum TimeType
	{
		RunTime = 0,
		CompileTime = 1,
	};
	enum ObjectType
	{
		SealedObject = 0,
		DynamicObject = 2,
	};
	enum ImplType
	{
		Cpp = 0,
		Abc = 4,
	};
	enum FinalType
	{
		Alterable = 0,
		Final = 8,
	};
	enum ClassType
	{
		TypeClass = 0,
		TypeInterface = 16,
	};
	enum NotImplType
	{
		Implemented = 0,
		NotImplemented = 32,
	};
	static const Scaleform::GFx::AS3::TypeInfo * None[0]; // 0xFFFFFFFFFFFFFFFF
	bool IsCompileTime();
	bool IsDynamicObject();
	bool IsAbcObject();
	bool IsFinalType();
	bool IsInterface();
	bool IsClass();
	bool IsNotImplemented();
	bool IsImplemented();
	const char * GetName();
	const char * GetPkgName();
	const Scaleform::GFx::AS3::TypeInfo * GetParent();
	bool IsBoolean();
	bool IsInt();
	bool IsUInt();
	bool IsNumber();
	bool IsString();
	unsigned long Flags; // 0x0
	unsigned short InstanceSize; // 0x4
	unsigned short ClassMethodNum; // 0x6
	unsigned short ClassMemberNum; // 0x8
	unsigned short InstanceMethodNum; // 0xA
	unsigned short InstanceMemberNum; // 0xC
	const char * Name; // 0x10
	const char * PkgName; // 0x18
	const Scaleform::GFx::AS3::TypeInfo * Parent; // 0x20
	const Scaleform::GFx::AS3::TypeInfo * * Implements; // 0x28
};
bool Scaleform::GFx::AS3::TypeInfo::IsInt(); // 0x14048FBB0
bool Scaleform::GFx::AS3::TypeInfo::IsUInt(); // 0x140490740
bool Scaleform::GFx::AS3::TypeInfo::IsNumber(); // 0x14048FDE0
bool Scaleform::GFx::AS3::TypeInfo::IsString(); // 0x140490500
struct Scaleform::GFx::AS3::ClassInfo
{
	const Scaleform::GFx::AS3::TypeInfo * Type; // 0x0
	Scaleform::Pickable<Scaleform::GFx::AS3::ClassTraits::Traits>(*Factory)(Scaleform::GFx::AS3::VM &); // 0x8
	const Scaleform::GFx::AS3::ThunkInfo * ClassMethod; // 0x10
	const Scaleform::GFx::AS3::MemberInfo * ClassMember; // 0x18
	const Scaleform::GFx::AS3::ThunkInfo * InstanceMethod; // 0x20
	const Scaleform::GFx::AS3::MemberInfo * InstanceMember; // 0x28
	bool IsCompileTime();
	bool IsDynamicObject();
	bool IsAbcObject();
	bool IsFinalType();
	bool IsNotImplemented();
	bool IsImplemented();
	const char * GetName();
	const char * GetPkgName();
	const Scaleform::GFx::AS3::TypeInfo * GetParent();
	unsigned short GetInstanceSize();
	unsigned short GetClassMethodNum();
	unsigned short GetClassMemberNum();
	unsigned short GetInstanceMethodNum();
	unsigned short GetInstanceMemberNum();
};
enum Scaleform::GFx::AS3::Abc::NamespaceKind
{
	NS_Undefined = 255,
	NS_Public = 0,
	NS_Protected = 1,
	NS_StaticProtected = 2,
	NS_Private = 3,
	NS_Explicit = 4,
	NS_PackageInternal = 5,
};
class Scaleform::GFx::AS3::Abc::MiInd
{
public:
	MiInd(long);
	bool operator==(const Scaleform::GFx::AS3::Abc::MiInd &);
	unsigned long Get();
	bool IsValid();
private:
	long Ind; // 0x0
public:
	void __dflt_ctor_closure();
};
class Scaleform::GFx::AS3::Abc::MbiInd
{
public:
	MbiInd(long);
	bool operator==(const Scaleform::GFx::AS3::Abc::MbiInd &);
	unsigned long Get();
	bool IsValid();
private:
	long Ind; // 0x0
public:
	void __dflt_ctor_closure();
};
class Scaleform::GFx::AS3::CheckResult
{
public:
	CheckResult(const Scaleform::GFx::AS3::CheckResult &);
	CheckResult(bool);
	~CheckResult();
	void DoNotCheck();
	bool operator bool();
	bool operator==(bool);
	bool operator!();
private:
	Scaleform::GFx::AS3::CheckResult & operator=(const Scaleform::GFx::AS3::CheckResult &);
public:
	Scaleform::GFx::AS3::CheckResult & operator=(bool);
private:
	bool Result; // 0x0
};