#include "dev/kof/master/development/source/baseproject/jni/game/player/chara/actoroption.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/internal/internal_functions.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/cameracheck.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xfacet"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdio.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/globalheapmemory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstdio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/freecameracheck.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_stdio_config.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threadcheck.h"
#include "dev/silverware/git/sdk/agcondition.inl"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_battleonline.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_textlayout.h"

#include "dev/kof/master/development/source/baseproject/jni/framework/memory/heapmemory.h"
#include "dev/kof/master/development/source/ps4project/toolkit/geommath/vector2unaligned.h"
#include "dev/kof/master/development/source/baseproject/jni/game/util/shaderfxhelper.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/lib/etc/randommt.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/ios"
#include "dev/kof/master/development/source/baseproject/jni/game/player/effect/actoreffect.h"
#include "dev/kof/master/development/source/baseproject/jni/game/player/actorobject.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_file.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_resizeimage.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/thread/mutex.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocnum"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_arrayunsafe.h"
#include "dev/kof/master/development/source/baseproject/jni/game/data/savedata.h"
#include "dev/kof/master/development/source/ps4project/baseproject/ag/kofanticheat.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/data/saveplayerdata.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/data/savedata.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/achievementcommonpc.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/achievementsystem.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/debug/gameinfo.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/commonpc.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/taskfunc/generaltask.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/titlestoragesystem.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/heapmemory.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/system/ctasksystem.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/util/easyindicator.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/replace.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/titlestoragetargetpc.cpp"
#include "dev/kof/master/development/source/baseproject/jni/game/network/chkdiscononlinesv.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/rankingsystem.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/rankingreadpc.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/rankingtargetpc.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/network/tusreadps4.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/util/rtc.cpp"

struct GRADESKIP_WIN_TABLE
{
	long win; // 0x0
	RANKMATCH_RANK grade; // 0x4
};
struct ONLINESAVEDATA_WORK
{
	Fw::TS_HANDLE m_Handle; // 0x0
	Fw::cTusReadRequest m_ReadRequest; // 0x8
	Fw::cTusWriteRequest m_WriteRequest; // 0x28
	OnlineProfileData * m_pBuf; // 0x48
	AppMain::ONLINEPROFILE_LOAD_STATE * m_pLoadingState; // 0x50
};
struct OPPONENTUSER_TUS_REQUEST
{
	Fw::TS_HANDLE m_Handle; // 0x0
	Fw::cTusReadRequest m_ReadRequest; // 0x8
	long long * m_pBuf; // 0x28
	bool * m_pLoadingFlag; // 0x30
	bool * m_pErrorFlag; // 0x38
};
struct LIVESTREAMING_TUS_REQUEST
{
	Fw::TS_HANDLE m_Handle; // 0x0
	Fw::cTusReadRequest m_ReadRequest; // 0x8
	Fw::cTusWriteRequest m_WriteRequest; // 0x8
	Fw::cTusResult * m_pTusResult; // 0x28
	bool * m_pLoadingFlag; // 0x30
};
struct RANKMATCH_WIN_MONTH
{
	Fw::cRankingReadRequest m_ReadRequest; // 0x0
	Fw::RANKING_HANDLE m_Handle; // 0x18
	LEADERBOARD_INFO m_Info; // 0x20
	RANKMATCH_WIN_MONTH();
};
void AppMain::ConvertOnlineProfile(long long * pBuf, SaveRecord_PlayerData * pSaveData, unsigned char rankmatch_playing, unsigned char patch_111); // 0x1400FDA50
long GT_TusGetOnlineProfileData(GENERAL_TASK * pGT); // 0x1400FDD10
GENERAL_TASK * AppMain::TusGetOnlineProfile(unsigned long long * pNpId, OnlineProfileData * pBuf, AppMain::ONLINEPROFILE_LOAD_STATE * pLoadingState); // 0x1400FE260
long GT_TusSetOnlineProfileData(GENERAL_TASK * pGT); // 0x1400FE440
void AppMain::TusSetOnlineProfile(); // 0x1400FE4E0
long AppMain::AddGradePointSaveData(long point, bool downRankFlag); // 0x1400FE7C0
long AppMain::GetCalcGradePointSaveData(BATTLE_RESULT_TYPE result, RANKMATCH_RANK myGrade, RANKMATCH_RANK enemyGrade, bool prisonFlag); // 0x1400FEA80
RANKMATCH_RANK AppMain::GetGradeReflectSkip(RANKMATCH_RANK grade, long win_count); // 0x1400FEC00
struct AppMain::GetGradeReflectSkip::__l5::DATA
{
	RANKMATCH_RANK rank; // 0x0
	long cnt; // 0x4
};
std::piecewise_construct_t std::piecewise_construct; // 0x14089B494
Fw::cTusResult::cTusResult(); // 0x1400FE240
Fw::cTusResult::~cTusResult(); // 0x1400FE250
void AppMain::CheckGradePoint4Trophy(); // 0x1400FEC70
void AppMain::CheckDownDisconnectLevel(); // 0x1400FECE0
RANKMATCH_RANK AppMain::GetRankMatchRank(bool f_change); // 0x1400FED70
void AppMain::SetBattleGradeForSkipGradeSaveData(); // 0x1400FEEC0
void AppMain::GetRankMatchGradeRange(RANKMATCH_RANK checkGrade, long times, AppMain::RANK_MATCH_GRADE_RANGE * pOut, NETWORK_GRADE_SELECT gradeSelect); // 0x1400FEFA0
long AppMain::UpdateRankMatchMaxWinsSaveData(); // 0x1400FF2F0
bool AppMain::GetRankMatchHighSuccessRate(); // 0x1400FF3D0
long GT_TusSetGalleryFlag(GENERAL_TASK * pGT); // 0x1400FF470
void AppMain::SetTusGalleryFlag(); // 0x1400FF5A0
long GT_TusGetGalleryFlag(GENERAL_TASK * pGT); // 0x1400FF9F0
