#pragma once

enum SoundId
{
	SND_NONE = 255,
	SND_BGM_CHARACTER_SELECT = 0,
	SND_BGM_TEAM_ELISABETH = 1,
	SND_BGM_NAKORURU = 2,
	SND_BGM_MI_BGM = 3,
	SND_SE_CURSOR = 4,
	SND_SE_DECIDE_TO_CHA = 5,
	SND_SE_DECIDE = 6,
	SND_SE_CANCEL = 7,
	SND_SE_OPTION_CH_VO = 8,
	SND_SE_OPTION_PAD = 9,
	SND_SE_CURSOR_OPT = 10,
	SND_SE_DECIDE_GAL = 11,
	SND_SE_TAB = 12,
	SND_SE_CURSOR_CHA = 13,
	SND_SE_DECIDE_CHA = 14,
	SND_SE_DECIDE_COL = 15,
	SND_SE_DECIDE_ORD = 16,
	SND_SE_DECIDE_ORD_F = 17,
	SND_SE_CURSOR_CON = 18,
	SND_SE_DECIDE_CON = 19,
	SND_SE_CURSOR_STA = 20,
	SND_SE_DECIDE_STA = 21,
	SND_SE_ALLERT = 22,
	SND_SE_ALLERT_YES = 23,
	SND_SE_ALLERT_YES_CHA = 24,
	SND_SE_ALLERT_NO = 25,
	SND_SE_ALLERT_CANCEL = 26,
	SND_SE_REPLAY_LOCK = 27,
	SND_SE_REPLAY_UNLOCK = 28,
	SND_SE_RESULT_NEXT = 29,
	SND_SE_DECIDE_CREATE_ROOM = 30,
	SND_SE_MATCHING_ENTRY = 31,
	SND_SE_MATCHING_VS = 32,
	SND_SE_TITLE_CALL = 33,
	SND_SE_TITLE_PUSH = 34,
	SND_SE_ROOM_IN = 35,
	SND_SE_ROOM_SIT = 36,
	SND_SE_CHEAT_UNLOCK = 37,
	SND_SE_CONTINUE_COUNT = 38,
	SND_SE_RESULT_WINNER = 39,
	SND_SE_GAME_OVER = 40,
	SND_SE_CONTINUE_VANISH = 41,
	SND_SE_HERE_COMES = 42,
	SND_SE_PAUSE = 43,
	SND_SE_PAUSE_OFF = 44,
	SND_SE_PAUSE_DECIDE = 45,
	SND_SE_PAUSE_TO_BACK = 46,
	SND_SE_PAUSE_TO_END = 47,
	SND_BGM_01_NEO_ESAKA = 48,
	SND_BGM_02_RYUKO = 49,
	SND_BGM_03_GAROU = 50,
	SND_BGM_04_IKARI = 51,
	SND_BGM_05_YAGAMI = 52,
	SND_BGM_06_K_DASH = 53,
	SND_BGM_07_SOUTH_TOWN = 54,
	SND_BGM_08_JOKAKU = 55,
	SND_BGM_09_KIM = 56,
	SND_BGM_10_PSYCHO = 57,
	SND_BGM_11_AKUNIN = 58,
	SND_BGM_12_ISEKAI = 59,
	SND_BGM_13_MEXICO = 60,
	SND_BGM_14_CHINA = 61,
	SND_BGM_15_SOUTH_AMERICA = 62,
	SND_BGM_16_OFFICIAL = 63,
	SND_BGM_17_ANTONOV = 64,
	SND_BGM_18_LAST_BOSS = 65,
	SND_BGM_19_ANTONOV_VOICE_LESS = 66,
	SND_BGM_20_PLAYER_SELECT_1 = 67,
	SND_BGM_21_ORDER_SELECT = 68,
	SND_BGM_22_RESULT_VERSUS = 69,
	SND_BGM_24_RIVAL_KYO_VS_IORI = 70,
	SND_BGM_25_RIVAL_RYO_VS_KING = 71,
	SND_BGM_26_RIVAL_TERRY_VS_GEESE = 72,
	SND_BGM_27_RIVAL_RALF_VS_CLARK = 73,
	SND_BGM_28_RIVAL_KULA_VS_ANGEL = 74,
	SND_BGM_29_RIVAL_ATHENA_VS_KENSOU = 75,
	SND_BGM_30_RIVAL_KIM_VS_CHOI = 76,
	SND_BGM_31_RIVAL_DEMO_KYO_VS_IORI = 77,
	SND_BGM_32_RIVAL_DEMO_TERRY_VS_GEESE = 78,
	SND_BGM_33_RIVAL_DEMO_RYO_VS_KING = 79,
	SND_BGM_34_RIVAL_DEMO_KIM_VS_CHOI = 80,
	SND_BGM_35_RIVAL_DEMO_RALF_VS_CLARK = 81,
	SND_BGM_36_RIVAL_DEMO_KULA_VS_ANGEL = 82,
	SND_BGM_ENDING_JAPAN = 83,
	SND_BGM_ENDING_ARTOFFIGHTING = 84,
	SND_BGM_ENDING_FATALFURY = 85,
	SND_BGM_ENDING_IKARIWARRIORS = 86,
	SND_BGM_ENDING_YAGAMI = 87,
	SND_BGM_ENDING_KDS = 88,
	SND_BGM_ENDING_SOUTHOWN = 89,
	SND_BGM_ENDING_WOMENFIGHTERS = 90,
	SND_BGM_ENDING_KIM = 91,
	SND_BGM_ENDING_PSYCHOSOLDIER = 92,
	SND_BGM_ENDING_VILLAINS = 93,
	SND_BGM_ENDING_ANOTHERWORLD = 94,
	SND_BGM_ENDING_MEXICO = 95,
	SND_BGM_ENDING_CHINA = 96,
	SND_BGM_ENDING_SOUTHAMERICAN = 97,
	SND_BGM_ENDING_OFFICIALINVITATION = 98,
	SND_BGM_ENDING_ANTONOV = 99,
	SND_BGM_ENDING_VERSE = 100,
	SND_BGM_CREDIT = 101,
	SND_BGM_MAIN_MENU = 102,
	SND_BGM_RESULT_STORY = 103,
	SND_BGM_DEMO_PROLOGUE = 104,
	SND_BGM_DEMO_INTERLUDE = 105,
	SND_BGM_DEMO_ANTONOV = 106,
	SND_BGM_ORDER_ANTONOV = 107,
	SND_BGM_DEMO_VERSE_1 = 108,
	SND_BGM_DEMO_VERSE_2 = 109,
	SND_BGM_CONTINUE = 110,
	SND_BGM_ORDER_VERSE = 111,
	SND_BGM_ORDER_PROLOGUE = 112,
	SND_BGM_MAIN_MENU_VO = 113,
	SND_BGM_MEMBERSELECT_MISSION = 114,
	SND_BGM_ROCK = 115,
	SND_BGM_YAMAZAKI = 116,
	SND_BGM_WHIP = 117,
	SND_BGM_VANESSA = 118,
	SND_BGM_GTR_STAGE = 119,
	SND_BGM_RIVAL_RYO_VS_GEESE = 120,
	SND_BGM_RIVAL_ANDY_VS_TUN = 121,
	SND_BGM_RIVAL_BILLY_VS_HEIN = 122,
	SND_BGM_RIVAL_DEMO_RYO_VS_GEESE = 123,
	SND_BGM_RIVAL_DEMO_ANDY_VS_TUN = 124,
	SND_BGM_RIVAL_DEMO_BILLY_VS_HEIN = 125,
	SND_BGM_MARY = 126,
	SND_BGM_HEIDERN = 127,
	SND_BGM_OSWALD = 128,
	SND_BGM_NAJD = 129,
	SND_BGM_RIVAL_K_DASH_VS_RALF = 130,
	SND_BGM_RIVAL_SHUNEI_VS_KUKRI = 131,
	SND_BGM_RIVAL_C_KYO_VS_C_IORI = 132,
	SND_BGM_RIVAL_C_IORI_VS_C_KYO = 133,
	SND_BGM_RIVAL_DEMO_K_DASH_VS_RALF = 134,
	SND_SE_HIT_SLASH_L = 135,
	SND_SE_HIT_SLASH_S = 136,
	SND_SE_HIT_FIRE_L = 137,
	SND_SE_HIT_ELE_L = 138,
	SND_SE_FINAL_HIT = 139,
	SND_SE_FINAL_HIT_FIRE = 140,
	SND_SE_FINAL_HIT_SLASH = 141,
	SND_SE_COUNTER_HIT = 142,
	SND_SE_STAGE_BOUND = 143,
	SND_SE_STAGE_LAND = 144,
	SND_SE_DASH_LEFT = 145,
	SND_SE_DASH_RIGHT = 146,
	SND_SE_WALK_LEFT = 147,
	SND_SE_WALK_RIGHT = 148,
	SND_SE_STUN = 149,
	SND_SE_G_CRASH = 150,
	SND_SE_WALL_BOUND = 151,
	SND_SE_GUARD_CANCEL = 152,
	SND_SE_JUST_GUARD = 153,
	SND_SE_EX_ACTION = 154,
	SND_SE_GUARD_L = 155,
	SND_SE_GUARD_S = 156,
	SND_SE_THROW_ESCAPE = 157,
	SND_SE_RYO_SABAKI = 158,
	SND_VO_DAMAGE_NORMAL = 159,
	SND_VO_DAMAGE_SPECIAL = 160,
	SND_VO_DAMAGE_FUKITOBASI = 161,
	SND_VO_DAMAGE_THROW = 162,
	SND_VO_STUN = 163,
	SND_VO_DOWN_LOW = 164,
	SND_VO_DOWN_HI = 165,
	SND_VO_DOWN_LOW_PAD = 166,
	SND_VO_DOWN_HI_PAD = 167,
	SND_VO_KO = 168,
	SND_VO_HIZA_KO = 169,
	SND_VO_FINAL_KO = 170,
	SND_SE_STAGE_GAYA = 171,
	SND_SYSVOICE_READY = 172,
	SND_SYSVOICE_GO = 173,
	SND_SE_SHOW_KO = 174,
	SND_SE_ERASE_KO = 175,
	SND_SE_TIME_UP = 176,
	SND_SE_ROUND = 177,
	SND_SE_READY = 178,
	SND_SE_GO = 179,
	SND_SE_WINS = 180,
	SND_SE_ERASE_WINS = 181,
	SND_SE_GAUGE_CHARGE = 182,
	SND_SE_LAST_10_COUNT = 183,
	SND_SE_COMPLETE = 184,
	SND_SYSVOICE_ROUND_1_M = 185,
	SND_SYSVOICE_ROUND_2_M = 186,
	SND_SYSVOICE_ROUND_3_M = 187,
	SND_SYSVOICE_ROUND_4_M = 188,
	SND_SYSVOICE_ROUND_5_M = 189,
	SND_SYSVOICE_ROUND_6_M = 190,
	SND_SYSVOICE_ROUND_7_M = 191,
	SND_SYSVOICE_ROUND_8_M = 192,
	SND_SYSVOICE_ROUND_9_M = 193,
	SND_SYSVOICE_FINAL_ROUND_M = 194,
	SND_SYSVOICE_EXTRA_ROUND_M = 195,
	SND_SYSVOICE_KO_M = 196,
	SND_SYSVOICE_PERFECT_GAME_M = 197,
	SND_SYSVOICE_PLAYER_1_WINS_M = 198,
	SND_SYSVOICE_PLAYER_2_WINS_M = 199,
	SND_SYSVOICE_YOU_WIN_M = 200,
	SND_SYSVOICE_YOU_LOSE_M = 201,
	SND_SYSVOICE_WINNER_M = 202,
	SND_SYSVOICE_ROUND_1_F = 203,
	SND_SYSVOICE_ROUND_2_F = 204,
	SND_SYSVOICE_ROUND_3_F = 205,
	SND_SYSVOICE_ROUND_4_F = 206,
	SND_SYSVOICE_ROUND_5_F = 207,
	SND_SYSVOICE_ROUND_6_F = 208,
	SND_SYSVOICE_ROUND_7_F = 209,
	SND_SYSVOICE_ROUND_8_F = 210,
	SND_SYSVOICE_ROUND_9_F = 211,
	SND_SYSVOICE_FINAL_ROUND_F = 212,
	SND_SYSVOICE_EXTRA_ROUND_F = 213,
	SND_SYSVOICE_KO_F = 214,
	SND_SYSVOICE_PERFECT_GAME_F = 215,
	SND_SYSVOICE_PLAYER_1_WINS_F = 216,
	SND_SYSVOICE_PLAYER_2_WINS_F = 217,
	SND_SYSVOICE_YOU_WIN_F = 218,
	SND_SYSVOICE_YOU_LOSE_F = 219,
	SND_SYSVOICE_WINNER_F = 220,
	SND_SYSVOICE_ROUND_1 = 221,
	SND_SYSVOICE_ROUND_2 = 222,
	SND_SYSVOICE_ROUND_3 = 223,
	SND_SYSVOICE_ROUND_4 = 224,
	SND_SYSVOICE_ROUND_5 = 225,
	SND_SYSVOICE_ROUND_6 = 226,
	SND_SYSVOICE_ROUND_7 = 227,
	SND_SYSVOICE_ROUND_8 = 228,
	SND_SYSVOICE_ROUND_9 = 229,
	SND_SYSVOICE_FINAL_ROUND = 230,
	SND_SYSVOICE_EXTRA_ROUND = 231,
	SND_SYSVOICE_DOUBLE_KO = 232,
	SND_SYSVOICE_DRAW_GAME = 233,
	SND_SYSVOICE_TIME_UP = 234,
	SND_SYSVOICE_CONTROLLER_SELECT = 235,
	SND_SYSVOICE_MEMBER_SELECT = 236,
	SND_SYSVOICE_ORDER_SELECT = 237,
	SND_SYSVOICE_STAGE_SELECT = 238,
	SND_SYSVOICE_COUNTER = 239,
	SND_SYSVOICE_GUARD_CRASH = 240,
	SND_SYSVOICE_STUN = 241,
	SND_SYSVOICE_CONTINUE = 242,
	SND_SYSVOICE_GAMEOVER = 243,
	SND_SYSVOICE_CONG = 244,
	SND_SYSVOICE_COMPLETE = 245,
	SND_SYSVOICE_NEW_RECORD = 246,
	SND_SYSVOICE_NICE_FIGHT = 247,
	SND_SYSVOICE_NEW_ITEM = 248,
	SND_SYSVOICE_HERE_COMES = 249,
	SND_SYSVOICE_KO_COMMENT_1_M = 250,
	SND_SYSVOICE_KO_COMMENT_2_M = 251,
	SND_SYSVOICE_KO_COMMENT_3_M = 252,
	SND_SYSVOICE_KO_COMMENT_4_M = 253,
	SND_SYSVOICE_KO_COMMENT_5_M = 254,
	SND_SYSVOICE_KO_COMMENT_6_M = 255,
	SND_SYSVOICE_KO_COMMENT_7_M = 256,
	SND_SYSVOICE_KO_COMMENT_8_M = 257,
	SND_SYSVOICE_KO_COMMENT_1_F = 258,
	SND_SYSVOICE_KO_COMMENT_2_F = 259,
	SND_SYSVOICE_KO_COMMENT_3_F = 260,
	SND_SYSVOICE_KO_COMMENT_4_F = 261,
	SND_SYSVOICE_KO_COMMENT_5_F = 262,
	SND_SYSVOICE_KO_COMMENT_6_F = 263,
	SND_SYSVOICE_KO_COMMENT_7_F = 264,
	SND_SYSVOICE_KO_COMMENT_8_F = 265,
	SND_SYSVOICE_COMBO_CALL_1_M = 266,
	SND_SYSVOICE_COMBO_CALL_2_M = 267,
	SND_SYSVOICE_COMBO_CALL_3_M = 268,
	SND_SYSVOICE_COMBO_CALL_4_M = 269,
	SND_SYSVOICE_COMBO_CALL_5_M = 270,
	SND_SYSVOICE_COMBO_CALL_6_M = 271,
	SND_SYSVOICE_COMBO_CALL_7_M = 272,
	SND_SYSVOICE_COMBO_CALL_8_M = 273,
	SND_SYSVOICE_COMBO_CALL_1_F = 274,
	SND_SYSVOICE_COMBO_CALL_2_F = 275,
	SND_SYSVOICE_COMBO_CALL_3_F = 276,
	SND_SYSVOICE_COMBO_CALL_4_F = 277,
	SND_SYSVOICE_COMBO_CALL_5_F = 278,
	SND_SYSVOICE_COMBO_CALL_6_F = 279,
	SND_SYSVOICE_COMBO_CALL_7_F = 280,
	SND_SYSVOICE_COMBO_CALL_8_F = 281,
	SND_MAX = 282,
	SND_SE_COMMON_001 = 4,
};
struct SoundUserFlag
{
	SoundUserFlag(const Actor &);
	SoundUserFlag();
	unsigned long playerID : 2; // 0x0
	unsigned long actChangeStop : 1; // 0x0
	unsigned long damageStop : 1; // 0x0
	unsigned long spCancelStop : 1; // 0x0
	unsigned long charaTag : 1; // 0x0
	unsigned long shotTag : 1; // 0x0
	unsigned long effectTag : 1; // 0x0
	unsigned long optionTag : 1; // 0x0
	unsigned long koStop : 1; // 0x0
	unsigned long reserve : 6; // 0x0
	unsigned long tagID : 16; // 0x0
	unsigned long uiFlag; // 0x0
	void SetActorTag(const Actor &);
	void SetPlayerID(long);
	void SetActionChangeStop();
	void SetDamageStop();
	void SetSuperCancelStop();
	void SetKOStop();
	void SetSoundTagID(unsigned long);
};