#include "dev/kof/master/development/source/baseproject/jni/game/player/chara/actoroption.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/internal/internal_functions.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/cameracheck.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xfacet"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdio.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/globalheapmemory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstdio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/baseproject/jni/game/check/freecameracheck.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_stdio_config.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threadcheck.h"
#include "dev/silverware/git/sdk/agcondition.inl"
#include "dev/kof/master/development/source/baseproject/jni/game/scene/st_battleonline.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_textlayout.h"

	unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> >(void *);
	unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> >();
	std::unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> > & operator=(const std::unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> > &);
	std::unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> > & operator=(std::unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> > &);
	std::unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> > & operator=(void *);
	void swap(std::unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> > &);
	~unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> >();
	FighterOperation::FighterOperationAssignListener & operator*();
	FighterOperation::FighterOperationAssignListener * operator->();
	FighterOperation::FighterOperationAssignListener * get();
	bool operator bool();
	FighterOperation::FighterOperationAssignListener * release();
	void reset(FighterOperation::FighterOperationAssignListener *);
};
class `anonymous-namespace'::SoundVolumeModulation
{
private:
	static `anonymous-namespace'::SoundVolumeModulation * instance; // 0xFFFFFFFFFFFFFFFF
	enum VOLUME_GROUP
	{
		GROUP_BGM = 0,
		GROUP_PAD = 1,
		GROUP_NORMAL_SE = 2,
		GROUP_AMBIENCE = 3,
		GROUP_CHARA_VOICE = 4,
		GROUP_SYSTEM_VOICE = 5,
		GROUP_SYSTEM_SE = 6,
		GROUP_MAX = 7,
	};
public:
	~SoundVolumeModulation();
	static `anonymous-namespace'::SoundVolumeModulation & GetInstance();
	static float ConvSaveDataVolume(long);
	static void SetVolumeModulation(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, float, float);
	static void Update();
	static float * GetOutputVolumeRef(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	static void DisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, bool);
	static bool GetDisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	void setVolumeModulation(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, float, float);
	void update();
	float * getOutputVolumeRef(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	void disableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, bool);
	bool getDisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	struct ModulationParam;
private:
	`anonymous-namespace'::SoundVolumeModulation::ModulationParam modulationParam[7]; // 0x0
	long long lastFrameTimePoint; // 0xA8
	bool lastFrameTimePointIsValid; // 0xB0
	SoundVolumeModulation(const `anonymous-namespace'::SoundVolumeModulation &);
	SoundVolumeModulation();
	`anonymous-namespace'::SoundVolumeModulation & operator=(const `anonymous-namespace'::SoundVolumeModulation &);
};
class `anonymous-namespace'::SoundVolumeModulation
{
private:
	static `anonymous-namespace'::SoundVolumeModulation * instance; // 0xFFFFFFFFFFFFFFFF
	enum VOLUME_GROUP
	{
		GROUP_BGM = 0,
		GROUP_PAD = 1,
		GROUP_NORMAL_SE = 2,
		GROUP_AMBIENCE = 3,
		GROUP_CHARA_VOICE = 4,
		GROUP_SYSTEM_VOICE = 5,
		GROUP_SYSTEM_SE = 6,
		GROUP_MAX = 7,
	};
public:
	~SoundVolumeModulation();
	static `anonymous-namespace'::SoundVolumeModulation & GetInstance();
	static float ConvSaveDataVolume(long);
	static void SetVolumeModulation(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, float, float);
	static void Update();
	static float * GetOutputVolumeRef(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	static void DisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, bool);
	static bool GetDisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	void setVolumeModulation(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, float, float);
	void update();
	float * getOutputVolumeRef(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	void disableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, bool);
	bool getDisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	struct ModulationParam;
private:
	`anonymous-namespace'::SoundVolumeModulation::ModulationParam modulationParam[7]; // 0x0
	long long lastFrameTimePoint; // 0xA8
	bool lastFrameTimePointIsValid; // 0xB0
	SoundVolumeModulation(const `anonymous-namespace'::SoundVolumeModulation &);
	SoundVolumeModulation();
	`anonymous-namespace'::SoundVolumeModulation & operator=(const `anonymous-namespace'::SoundVolumeModulation &);
};
class `anonymous-namespace'::SoundVolumeModulation
{
private:
	static `anonymous-namespace'::SoundVolumeModulation * instance; // 0xFFFFFFFFFFFFFFFF
	enum VOLUME_GROUP
	{
		GROUP_BGM = 0,
		GROUP_PAD = 1,
		GROUP_NORMAL_SE = 2,
		GROUP_AMBIENCE = 3,
		GROUP_CHARA_VOICE = 4,
		GROUP_SYSTEM_VOICE = 5,
		GROUP_SYSTEM_SE = 6,
		GROUP_MAX = 7,
	};
public:
	~SoundVolumeModulation();
	static `anonymous-namespace'::SoundVolumeModulation & GetInstance();
	static float ConvSaveDataVolume(long);
	static void SetVolumeModulation(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, float, float);
	static void Update();
	static float * GetOutputVolumeRef(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	static void DisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, bool);
	static bool GetDisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	void setVolumeModulation(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, float, float);
	void update();
	float * getOutputVolumeRef(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	void disableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, bool);
	bool getDisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	struct ModulationParam;
private:
	`anonymous-namespace'::SoundVolumeModulation::ModulationParam modulationParam[7]; // 0x0
	long long lastFrameTimePoint; // 0xA8
	bool lastFrameTimePointIsValid; // 0xB0
	SoundVolumeModulation(const `anonymous-namespace'::SoundVolumeModulation &);
	SoundVolumeModulation();
	`anonymous-namespace'::SoundVolumeModulation & operator=(const `anonymous-namespace'::SoundVolumeModulation &);
};
class `anonymous-namespace'::SoundVolumeModulation
{
private:
	static `anonymous-namespace'::SoundVolumeModulation * instance; // 0xFFFFFFFFFFFFFFFF
	enum VOLUME_GROUP
	{
		GROUP_BGM = 0,
		GROUP_PAD = 1,
		GROUP_NORMAL_SE = 2,
		GROUP_AMBIENCE = 3,
		GROUP_CHARA_VOICE = 4,
		GROUP_SYSTEM_VOICE = 5,
		GROUP_SYSTEM_SE = 6,
		GROUP_MAX = 7,
	};
public:
	~SoundVolumeModulation();
	static `anonymous-namespace'::SoundVolumeModulation & GetInstance();
	static float ConvSaveDataVolume(long);
	static void SetVolumeModulation(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, float, float);
	static void Update();
	static float * GetOutputVolumeRef(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	static void DisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, bool);
	static bool GetDisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	void setVolumeModulation(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, float, float);
	void update();
	float * getOutputVolumeRef(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	void disableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP, bool);
	bool getDisableVolumeOutput(`anonymous-namespace'::SoundVolumeModulation::VOLUME_GROUP);
	struct ModulationParam;
private:
	`anonymous-namespace'::SoundVolumeModulation::ModulationParam modulationParam[7]; // 0x0
	long long lastFrameTimePoint; // 0xA8
	bool lastFrameTimePointIsValid; // 0xB0
	SoundVolumeModulation(const `anonymous-namespace'::SoundVolumeModulation &);
	SoundVolumeModulation();
	`anonymous-namespace'::SoundVolumeModulation & operator=(const `anonymous-namespace'::SoundVolumeModulation &);
};
void(*s_PadSoundOutputSelector$initializer$)(); // 0x140740858
std::unique_ptr<FighterOperation::FighterOperationAssignListener,std::default_delete<FighterOperation::FighterOperationAssignListener> > s_PadSoundOutputSelector; // 0x140AC6608
std::piecewise_construct_t std::piecewise_construct; // 0x1408AECC0
const char s_menu_bank_path[16]; // 0x1408AECC8
const char s_bgm_bank_path[15]; // 0x1408AECD8
const char s_common_bank_path[18]; // 0x1408AECE8
`anonymous-namespace'::SoundVolumeModulation * SoundVolumeModulation::instance; // 0x140A9B688
const char s_network_bank_path[19]; // 0x1408AED00
class std::chrono::duration<float,std::ratio<1,1> >
{
	class _Myt;
	typedef float rep;
	struct period;
public:
	float count();
	std::chrono::duration<float,std::ratio<1,1> > operator+();
	std::chrono::duration<float,std::ratio<1,1> > operator-();
	std::chrono::duration<float,std::ratio<1,1> > operator++(long);
	std::chrono::duration<float,std::ratio<1,1> > & operator++();
	std::chrono::duration<float,std::ratio<1,1> > operator--(long);
	std::chrono::duration<float,std::ratio<1,1> > & operator--();
	std::chrono::duration<float,std::ratio<1,1> > & operator+=(const std::chrono::duration<float,std::ratio<1,1> > &);
	std::chrono::duration<float,std::ratio<1,1> > & operator-=(const std::chrono::duration<float,std::ratio<1,1> > &);
	std::chrono::duration<float,std::ratio<1,1> > & operator*=(const float &);
	std::chrono::duration<float,std::ratio<1,1> > & operator/=(const float &);
	std::chrono::duration<float,std::ratio<1,1> > & operator%=(const std::chrono::duration<float,std::ratio<1,1> > &);
	std::chrono::duration<float,std::ratio<1,1> > & operator%=(const float &);
	static std::chrono::duration<float,std::ratio<1,1> > zero();
	static std::chrono::duration<float,std::ratio<1,1> > min();
	static std::chrono::duration<float,std::ratio<1,1> > max();
private:
	float _MyRep; // 0x0
};
struct `anonymous-namespace'::SoundVolumeModulation::ModulationParam
{
	float fOutput; // 0x0
	float fMaster; // 0x4
	float fCurrent; // 0x8
	float fTo; // 0xC
	float fStep; // 0x10
	bool bDisable; // 0x14
	ModulationParam();
};
void AppMain::Sound_Create(); // 0x14023F8F0
class AppMain::Sound_Create::__l2::PadOutputSelector :
	FighterOperation::FighterOperationAssignListener
{
public:
	virtual void OnFighterOperationAssignChanged(long, long, long);
	PadOutputSelector();
	virtual ~PadOutputSelector();
};
bool AppMain::Sound_IsLoadComplete(); // 0x1402402C0
void AppMain::Sound_LoadCommon(); // 0x140240360
void AppMain::Sound_LoadStage(const char * bank_file_path); // 0x1402404A0
void AppMain::Sound_LoadPCharacter(long playerIndex, const char * bank_file_path); // 0x140240530
void AppMain::Sound_LoadAppendPCharacter(long playerIndex, const char * bank_file_path); // 0x1402405F0
void AppMain::Sound_UnloadPCharacter(); // 0x1402406A0
class UnloadSoundJob :
	extension::ExThread::Runnable,
	extension::AsyncContentConstants,
	extension::FutureObjectSpec
{
public:
	UnloadSoundJob(UnloadSoundJob &);
	UnloadSoundJob(const UnloadSoundJob &);
	UnloadSoundJob();
	virtual long run();
protected:
	AppMain * instance; // 0x18
public:
	virtual ~UnloadSoundJob();
	UnloadSoundJob & operator=(UnloadSoundJob &);
	UnloadSoundJob & operator=(const UnloadSoundJob &);
};
long UnloadSoundJob::run(); // 0x1402407F0
void AppMain::Sound_UnloadAll(bool keep_resident); // 0x140240820
void AppMain::RequestPlayBGM(SoundId no, float pos, float fadeSeconds, bool bNonStop); // 0x1402408D0
void AppMain::RequestPlaySE(SoundId no); // 0x140240970
extension::SoundHashKey AppMain::Sound_GetName(AppMain::SoundListIndex soundList, long soundIndex); // 0x1402409E0
void AppMain::Sound_PlayBGMByName(const extension::SoundHashKey & soundName, float fadeSeconds, float pos, bool bNonStop); // 0x140240AE0
void AppMain::Sound_PlaySEByName(const char * soundName, const extension::SoundOneshotParameters * optionParams); // 0x140240B60
