#include "dev/kof/master/development/source/ps4project/baseproject/extension/bilinkable.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_glyphparam.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/memory"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xmemory"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_meshcache.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thr/xthread"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_meshcacheconfig.h"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/threading/exwaitcondition.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_hairliner.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/globalheapmemory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_filterdesc.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_styledtext.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/fixmemory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix2x4.h"

#include "program files (x86)/microsoft visual studio 14.0/vc/include/ios"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/imagefiles/render_imagefile.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocnum"
#include "dev/silverware/git/sdk/system/agsysteminfo.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/gfx/gfx_player.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/gfx/gfx_types.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xiosbase"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_types2d.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/gfx/gfx_resource.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_alg.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocale"
#include "program files (x86)/windows kits/8.1/include/um/winbase.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/xlocinfo"
#include "dev/kof/master/development/source/baseproject/jni/framework/ag/3rdparty/vectormath/cpp/mat_aos.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_stroker.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/debug/logging.h"
#include "dev/silverware/git/sdk/agreferenceinl.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vector"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/imagefiles/dds_imagefile.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/ctype.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/memory/heapmemory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_textmeshprovider.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_color.h"
#include "dev/kof/master/development/source/baseproject/jni/framework/thread/mutex.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/thread"
#include "dev/kof/master/development/source/baseproject/jni/framework/ogl/oglvec3.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/sound/ex_sound_bank.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/lib/audio/audiopresenter.cpp"
#include "dev/kof/master/development/source/baseproject/jni/framework/lib/audio/mediamanager.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/threading/exlockable.cpp"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/asyncjob.cpp"

class extension::SoundManager::Player
{
public:
	Player();
private:
	Player(const extension::SoundManager::Player &);
	extension::SoundManager::Player & operator=(const extension::SoundManager::Player &);
	enum SoundBindSpec
	{
		SoundBind_SE = 0,
		SoundBind_BGM = 1,
	};
public:
	~Player();
	void initialize(CMediaManager *, long, const extension::SoundManager::ManagerRealtimeState &);
	void finalize();
	bool isSoundReleased();
	bool isBGM();
	bool isSE();
	bool isLockPeriod();
	bool isSameBankElement(const extension::SoundSource &);
	bool isFadeOutStop();
	float soundLength();
	float playPosition();
	bool setPosition(float);
	float playTime();
	float lockTime();
	float playTimeWeightiness();
	bool isLessImportantPlay(const extension::SoundManager::Player &);
	long priority();
	unsigned long group();
	unsigned long userTag();
	const extension::RefCountablePtr<extension::exsound_detail::RuntimeEffector> runtimeEffector();
	float lastOutputVolume();
	const extension::SoundSource & soundSource();
	bool bindSound(const extension::SoundSource &, extension::SoundManager::Player::SoundBindSpec);
	void releaseSound();
	void setGroup(unsigned long);
	void maskPadOutputUsers(unsigned long);
	void setPriority(long);
	void setUserTag(unsigned long);
	void setBaseVolume(float);
	void setMasterVolume(float *);
	void setLockTime(float);
	void setRuntimeEffector(const extension::RefCountablePtr<extension::exsound_detail::RuntimeEffector> &);
	void play(float, float);
	void stop(float);
	void updatePlayState();
	void updateRealtimeAttribute(const OGLVec3 &);
	void updateRuntimeVolume();
	bool isPaused();
	void pauseStop();
	void pausePlay();
	const extension::SoundHashKey & getSoundHashKey();
	void setStereoChange(bool);
private:
	static const long Max_Login_User; // 0xFFFFFFFFFFFFFFFF
	enum PlayerFlagSet
	{
		PlayerFlag_IsBGM = 1,
		PlayerFlag_IsSE = 2,
		PlayerFlag_IsOutSurround = 16,
		PlayerFlag_Is3DSound = 32,
		PlayerFlag_IsStereoPan = 64,
		PlayerFlag_ReleaseOnFadeOut = -2147483648,
		PlayerFlag_Pause = 1073741824,
	};
	void bindPresenterSound(CAudioPresenter &);
	void bindPresenterSound();
	void releasePresenterSound(CAudioPresenter &);
	long getReverbType();
	const extension::SoundManager::ReverbState * selectReverbState();
	void applyPresenterReverb(CAudioPresenter &, const extension::SoundManager::ReverbState *);
	void applyPresenterReverb(const extension::SoundManager::ReverbState *);
	void startPresenter(CAudioPresenter &, float);
	void setFade(float, float);
	void setStartFade(float, float, float);
	float calcOutputVolume();
	void setOutputVolume(float);
	bool isReverbEnable(const extension::SoundManager::ReverbState *);
	float * m_masterVolumeRef; // 0x0
	const extension::SoundManager::ManagerRealtimeState * m_rtStateRef; // 0x8
	unsigned long m_playerFlags; // 0x10
	unsigned long m_group; // 0x14
	long m_priority; // 0x18
	unsigned long m_userTag; // 0x1C
	extension::RefCountablePtr<extension::exsound_detail::RuntimeEffector> m_runtimeEffector; // 0x20
	float m_baseVolume; // 0x28
	float m_lockTime; // 0x2C
	float m_fadeGoalTime; // 0x30
	float m_fadeGoalVolume; // 0x34
	float m_fadeLastTime; // 0x38
	float m_fadeLastVolume; // 0x3C
	float m_lastOutputVolume; // 0x40
	float m_pauseTime; // 0x44
	float m_pauseTotalTime; // 0x48
	extension::SoundSource m_soundSource; // 0x50
	std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > m_presenter; // 0x80
};
const extension::RefCountablePtr<extension::exsound_detail::RuntimeEffector> extension::SoundManager::Player::runtimeEffector(); // 0x1402BE580
class std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > :
	std::_Unique_ptr_base<CAudioPresenter,std::default_delete<CAudioPresenter> >
{
	class _Myt;
	class _Mybase;
	typedef CAudioPresenter pointer;
	class element_type;
	struct deleter_type;
public:
	unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> >(const std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > &);
	unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> >(std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > &);
	unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> >(CAudioPresenter *, std::default_delete<CAudioPresenter> &);
	unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> >(CAudioPresenter *, const std::default_delete<CAudioPresenter> &);
	unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> >(CAudioPresenter *);
	unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> >(void *);
	unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> >();
	std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > & operator=(const std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > &);
	std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > & operator=(std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > &);
	std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > & operator=(void *);
	void swap(std::unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> > &);
	~unique_ptr<CAudioPresenter,std::default_delete<CAudioPresenter> >();
	CAudioPresenter & operator*();
	CAudioPresenter * operator->();
	CAudioPresenter * get();
	bool operator bool();
	CAudioPresenter * release();
	void reset(CAudioPresenter *);
};
extension::SoundManager::Player::Player(); // 0x1402BE5A0
extension::SoundManager::SERequest::SERequest(const extension::SoundManager::SERequest & __that); // 0x1402BF590
extension::SoundManager::SERequest::SERequest(); // 0x1402C0FB0
extension::SoundManager::Player::~Player(); // 0x1402BE630
extension::SoundManager::SERequest::~SERequest(); // 0x1402BF620
bool extension::SoundManager::Player::isLockPeriod(); // 0x1402BE690
float extension::SoundManager::Player::playPosition(); // 0x1402BE6E0
float extension::SoundManager::Player::playTimeWeightiness(); // 0x1402BE730
bool extension::SoundManager::Player::bindSound(const extension::SoundSource & ss, extension::SoundManager::Player::SoundBindSpec bindSpec); // 0x1402BE7F0
void extension::SoundManager::Player::releaseSound(); // 0x1402BE950
void extension::SoundManager::Player::bindPresenterSound(); // 0x1402BEA50
void extension::SoundManager::Player::applyPresenterReverb(CAudioPresenter & presenter, const extension::SoundManager::ReverbState * refState); // 0x1402BEB80
void extension::SoundManager::Player::play(float fadeTime, float startTime); // 0x1402BED10
void extension::SoundManager::Player::stop(float fadeTime); // 0x1402BEE10
void extension::SoundManager::Player::updateRealtimeAttribute(const OGLVec3 & listenerPosition); // 0x1402BEEA0
void extension::SoundManager::Player::pauseStop(); // 0x1402BEF70
void extension::SoundManager::Player::pausePlay(); // 0x1402BEFF0
void extension::SoundManager::Player::updateRuntimeVolume(); // 0x1402BF0A0
void extension::SoundManager::Player::setOutputVolume(float vol); // 0x1402BF210
class extension::SoundManager::SERequestFilter
{
private:
	extension::SoundManager::SERequest m_pattern; // 0x0
public:
	SERequestFilter(extension::SoundManager::SERequestFilter &);
	SERequestFilter(const extension::SoundManager::SERequestFilter &);
	SERequestFilter(const extension::SoundManager::SERequest &);
	bool operator()(const extension::SoundManager::SERequest &);
	~SERequestFilter();
	extension::SoundManager::SERequestFilter & operator=(extension::SoundManager::SERequestFilter &);
	extension::SoundManager::SERequestFilter & operator=(const extension::SoundManager::SERequestFilter &);
};
bool extension::SoundManager::SERequestFilter::operator()(const extension::SoundManager::SERequest & target); // 0x1402BF4E0
void extension::SoundManager::ReverbState::set(long attenuationPercent, long delayTimeMsec, long repeatCount, long reflectionAttenuationPercent, long fluctuationTimeMsec); // 0x1402BF640
void extension::SoundManager::ManagerRealtimeState::reset(); // 0x1402BF740
extension::SoundManager::SoundManager(); // 0x1402BF7C0
extension::SoundManager::BGMRequest::~BGMRequest(); // 0x1402BFA00
void extension::SoundManager::initialize(CMediaManager * mediaManager); // 0x1402BFA10
bool extension::SoundManager::playBGM(const extension::SoundSource & source, float fadeTime, float startTime, bool bNonStop); // 0x1402BFBA0
void extension::SoundManager::stopBGM(float fadeTime); // 0x1402BFC40
bool extension::SoundManager::playSE(const extension::SoundSource & source, const extension::SoundManager::SEPlayParams & params); // 0x1402BFCD0
bool extension::SoundManager::isPlayingSE(const extension::SoundSource & source, const extension::SoundManager::SEPlayParams & params); // 0x1402BFE80
class extension::SoundManager::isPlayingSE::__l10::<lambda_76ee7a82abe225d7e9baf73e922f0811>
{
public:
	bool operator()(const extension::SoundManager::SERequest &);
	<lambda_76ee7a82abe225d7e9baf73e922f0811>(extension::SoundManager::isPlayingSE::__l10::<lambda_76ee7a82abe225d7e9baf73e922f0811> &);
	<lambda_76ee7a82abe225d7e9baf73e922f0811>();
	<lambda_76ee7a82abe225d7e9baf73e922f0811>(const extension::SoundSource &, const extension::SoundManager::SEPlayParams &);
private:
	const extension::SoundSource & source; // 0x0
	const extension::SoundManager::SEPlayParams & params; // 0x8
public:
	extension::SoundManager::isPlayingSE::__l10::<lambda_76ee7a82abe225d7e9baf73e922f0811> & operator=(const extension::SoundManager::isPlayingSE::__l10::<lambda_76ee7a82abe225d7e9baf73e922f0811> &);
};
std::piecewise_construct_t std::piecewise_construct; // 0x1408AF11F
bool extension::SoundManager::stopSE(const extension::SoundSource & source, const extension::SoundManager::SEStopParams & params); // 0x1402C0070
void extension::SoundManager::stopGroupSE(unsigned long group); // 0x1402C0210
void extension::SoundManager::stopUserTagedSE(unsigned long userTagMask, float fadeTime); // 0x1402C03B0
void extension::SoundManager::stopSE(float fadeTime); // 0x1402C0550
void extension::SoundManager::pauseGroupSE(unsigned long group, bool pause); // 0x1402C0630
float extension::SoundManager::BGMPlay_getPosition(); // 0x1402C0710
extension::SoundHashKey extension::SoundManager::BGMPlay_getSoundHashKey(); // 0x1402C0790
