#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/string.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memcpy_s.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstring.h"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/lua/src/lstring.c"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/lua/src/lgc.c"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/lua/src/lcode.c"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/lua/src/llex.c"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/lua/src/lmem.c"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/lua/src/lstate.c"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/lua/src/lobject.c"
#include "dev/kof/master/development/source/ps4project/baseproject/extension/lua/src/lfunc.c"

struct BlockCnt
{
	BlockCnt * previous; // 0x0
	short firstlabel; // 0x8
	short firstgoto; // 0xA
	unsigned char nactvar; // 0xC
	unsigned char upval; // 0xD
	unsigned char isloop; // 0xE
};
const <unnamed-tag> priority[15]; // 0x1408B0630
void checklimit(FuncState * fs, long v, long l, const char * what); // 0x1402969B0
long testnext(LexState * ls, long c); // 0x140296A30
void checknext(LexState * ls, long c); // 0x140296A80
void check_match(LexState * ls, long what, long who, long where); // 0x140296AF0
TString * str_checkname(LexState * ls); // 0x140296BD0
void codestring(LexState * ls, expdesc * e, TString * s); // 0x140296C60
long registerlocalvar(LexState * ls, TString * varname); // 0x140296CB0
void new_localvar(LexState * ls, TString * name); // 0x140296DB0
long searchupvalue(FuncState * fs, TString * name); // 0x140296EA0
long newupvalue(FuncState * fs, TString * name, expdesc * v); // 0x140296F50
long searchvar(FuncState * fs, TString * n); // 0x1402970E0
long singlevaraux(FuncState * fs, TString * n, expdesc * var, long base); // 0x1402971A0
void singlevar(LexState * ls, expdesc * var); // 0x140297280
void adjust_assign(LexState * ls, long nvars, long nexps, expdesc * e); // 0x140297350
void enterlevel(LexState * ls); // 0x140297420
void closegoto(LexState * ls, long g, Labeldesc * label); // 0x1402974B0
long findlabel(LexState * ls, long g); // 0x1402975C0
long newlabelentry(LexState * ls, Labellist * l, TString * name, long line, long pc); // 0x140297750
void findgotos(LexState * ls, Labeldesc * lb); // 0x140297810
void movegotosout(FuncState * fs, BlockCnt * bl); // 0x1402978D0
void leaveblock(FuncState * fs); // 0x1402979C0
Proto * addprototype(LexState * ls); // 0x140297B60
void open_func(LexState * ls, FuncState * fs, BlockCnt * bl); // 0x140297C70
void close_func(LexState * ls); // 0x140297D60
long block_follow(LexState * ls, long withuntil); // 0x140297FC0
void statlist(LexState * ls); // 0x140297FF0
void fieldsel(LexState * ls, expdesc * v); // 0x140298050
void yindex(LexState * ls, expdesc * v); // 0x140298160
struct ConsControl
{
	expdesc v; // 0x0
	expdesc * t; // 0x10
	long nh; // 0x18
	long na; // 0x1C
	long tostore; // 0x20
};
void recfield(LexState * ls, ConsControl * cc); // 0x140298250
void constructor(LexState * ls, expdesc * t); // 0x140298430
void parlist(LexState * ls); // 0x140298880
void body(LexState * ls, expdesc * e, long ismethod, long line); // 0x140298A00
long explist(LexState * ls, expdesc * v); // 0x140298C10
void funcargs(LexState * ls, expdesc * f, long line); // 0x140298D20
void primaryexp(LexState * ls, expdesc * v); // 0x140298EC0
void suffixedexp(LexState * ls, expdesc * v); // 0x140298F70
void simpleexp(LexState * ls, expdesc * v); // 0x140299210
BinOpr getbinopr(long op); // 0x140299450
BinOpr subexpr(LexState * ls, expdesc * v, long limit); // 0x140299610
void block(LexState * ls); // 0x1402997F0
struct LHS_assign
{
	LHS_assign * prev; // 0x0
	expdesc v; // 0x8
};
void check_conflict(LexState * ls, LHS_assign * lh, expdesc * v); // 0x140299860
void assignment(LexState * ls, LHS_assign * lh, long nvars); // 0x140299930
void gotostat(LexState * ls, long pc); // 0x140299B10
void checkrepeated(FuncState * fs, Labellist * ll, TString * label); // 0x140299BE0
void labelstat(LexState * ls, TString * label, long line); // 0x140299CF0
void whilestat(LexState * ls, long line); // 0x140299E30
void repeatstat(LexState * ls, long line); // 0x14029A030
long exp1(LexState * ls); // 0x14029A210
void forbody(LexState * ls, long base, long line, long nvars, long isnum); // 0x14029A2D0
void fornum(LexState * ls, TString * varname, long line); // 0x14029A590
void forlist(LexState * ls, TString * indexname); // 0x14029A7F0
void forstat(LexState * ls, long line); // 0x14029AA60
void test_then_block(LexState * ls, long * escapelist); // 0x14029AB70
void ifstat(LexState * ls, long line); // 0x14029AE40
