#pragma once

bool Scaleform::GFx::NumberUtil::IsNaN(double v); // 0x1403351F0
union Scaleform::GFx::NumberUtil::IsNaN::__l2::<unnamed-type-u>
{
public:
	unsigned long long I; // 0x0
	double D; // 0x0
};
union Scaleform::GFx::NumberUtil::IsPOSITIVE_INFINITY::__l2::<unnamed-type-u>
{
public:
	unsigned long long I; // 0x0
	double D; // 0x0
};
union Scaleform::GFx::NumberUtil::IsNEGATIVE_INFINITY::__l2::<unnamed-type-u>
{
public:
	unsigned long long I; // 0x0
	double D; // 0x0
};
union Scaleform::GFx::NumberUtil::IsNaNOrInfinity::__l2::<unnamed-type-u>
{
public:
	unsigned long long I; // 0x0
	double D; // 0x0
};
enum Scaleform::GFx::NumberUtil::<unnamed-enum-TOSTRING_BUF_SIZE>
{
	TOSTRING_BUF_SIZE = 64,
};