#pragma once

enum LEADERBOARD_AREA
{
	LEADERBOARD_AREA_OTHER = 0,
	LEADERBOARD_AREA_ASIA = 1,
	LEADERBOARD_AREA_NORTHAMERICA = 2,
	LEADERBOARD_AREA_EUROPE = 3,
};
enum LEADERBOARD_ID
{
	LEADERBOARD_ID_RANKMATCH_WIN_TOTAL_ALL = 1,
	LEADERBOARD_ID_RANKMATCH_WIN_TOTAL_ASIA = 2,
	LEADERBOARD_ID_RANKMATCH_WIN_TOTAL_EUROPE = 3,
	LEADERBOARD_ID_RANKMATCH_WIN_TOTAL_NORTHAMERICA = 4,
	LEADERBOARD_ID_RANKMATCH_WIN_TOTAL_OTHER = 5,
	LEADERBOARD_ID_RANKMATCH_WIN_MONTHLY_ALL = 6,
	LEADERBOARD_ID_RANKMATCH_WIN_MONTHLY_ASIA = 7,
	LEADERBOARD_ID_RANKMATCH_WIN_MONTHLY_EUROPE = 8,
	LEADERBOARD_ID_RANKMATCH_WIN_MONTHLY_NORTHAMERICA = 9,
	LEADERBOARD_ID_RANKMATCH_WIN_MONTHLY_OTHER = 10,
	LEADERBOARD_ID_RANKMATCH_WINS_TOTAL_ALL = 11,
	LEADERBOARD_ID_RANKMATCH_WINS_TOTAL_ASIA = 12,
	LEADERBOARD_ID_RANKMATCH_WINS_TOTAL_EUROPE = 13,
	LEADERBOARD_ID_RANKMATCH_WINS_TOTAL_NORTHAMERICA = 14,
	LEADERBOARD_ID_RANKMATCH_WINS_TOTAL_OTHER = 15,
	LEADERBOARD_ID_GRADE_ALL = 16,
	LEADERBOARD_ID_GRADE_ASIA = 17,
	LEADERBOARD_ID_GRADE_EUROPE = 18,
	LEADERBOARD_ID_GRADE_NORTHAMERICA = 19,
	LEADERBOARD_ID_GRADE_OTHER = 20,
	LEADERBOARD_ID_SURVIVAL_SCORE_ALL = 21,
	LEADERBOARD_ID_SURVIVAL_SCORE_ASIA = 22,
	LEADERBOARD_ID_SURVIVAL_SCORE_EUROPE = 23,
	LEADERBOARD_ID_SURVIVAL_SCORE_NORTHAMERICA = 24,
	LEADERBOARD_ID_SURVIVAL_SCORE_OTHER = 25,
	LEADERBOARD_ID_SURVIVAL_SCORE_ALL_KYO = 26,
	LEADERBOARD_ID_SURVIVAL_SCORE_ALL_BEN = 27,
	LEADERBOARD_ID_SURVIVAL_SCORE_ALL_DMN = 28,

	LEADERBOARD_ID_TIMEATTACK_SCORE_ASIA_YMZ = 559,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ASIA_VNS = 560,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ASIA_WHP = 561,
	LEADERBOARD_ID_TIMEATTACK_SCORE_EUROPE_ROC = 562,
	LEADERBOARD_ID_TIMEATTACK_SCORE_EUROPE_YMZ = 563,
	LEADERBOARD_ID_TIMEATTACK_SCORE_EUROPE_VNS = 564,
	LEADERBOARD_ID_TIMEATTACK_SCORE_EUROPE_WHP = 565,
	LEADERBOARD_ID_TIMEATTACK_SCORE_NORTHAMERICA_ROC = 566,
	LEADERBOARD_ID_TIMEATTACK_SCORE_NORTHAMERICA_YMZ = 567,
	LEADERBOARD_ID_TIMEATTACK_SCORE_NORTHAMERICA_VNS = 568,
	LEADERBOARD_ID_TIMEATTACK_SCORE_NORTHAMERICA_WHP = 569,
	LEADERBOARD_ID_TIMEATTACK_SCORE_OTHER_ROC = 570,
	LEADERBOARD_ID_TIMEATTACK_SCORE_OTHER_YMZ = 571,
	LEADERBOARD_ID_TIMEATTACK_SCORE_OTHER_VNS = 572,
	LEADERBOARD_ID_TIMEATTACK_SCORE_OTHER_WHP = 573,
	LEADERBOARD_ID_SURVIVAL_SCORE_ALL_HDR = 574,
	LEADERBOARD_ID_SURVIVAL_SCORE_ALL_OSW = 575,
	LEADERBOARD_ID_SURVIVAL_SCORE_ALL_MRY = 576,
	LEADERBOARD_ID_SURVIVAL_SCORE_ALL_NJD = 577,
	LEADERBOARD_ID_SURVIVAL_SCORE_ASIA_HDR = 578,
	LEADERBOARD_ID_SURVIVAL_SCORE_ASIA_OSW = 579,
	LEADERBOARD_ID_SURVIVAL_SCORE_ASIA_MRY = 580,
	LEADERBOARD_ID_SURVIVAL_SCORE_ASIA_NJD = 581,
	LEADERBOARD_ID_SURVIVAL_SCORE_EUROPE_HDR = 582,
	LEADERBOARD_ID_SURVIVAL_SCORE_EUROPE_OSW = 583,
	LEADERBOARD_ID_SURVIVAL_SCORE_EUROPE_MRY = 584,
	LEADERBOARD_ID_SURVIVAL_SCORE_EUROPE_NJD = 585,
	LEADERBOARD_ID_SURVIVAL_SCORE_NORTHAMERICA_HDR = 586,
	LEADERBOARD_ID_SURVIVAL_SCORE_NORTHAMERICA_OSW = 587,
	LEADERBOARD_ID_SURVIVAL_SCORE_NORTHAMERICA_MRY = 588,
	LEADERBOARD_ID_SURVIVAL_SCORE_NORTHAMERICA_NJD = 589,
	LEADERBOARD_ID_SURVIVAL_SCORE_OTHER_HDR = 590,
	LEADERBOARD_ID_SURVIVAL_SCORE_OTHER_OSW = 591,
	LEADERBOARD_ID_SURVIVAL_SCORE_OTHER_MRY = 592,
	LEADERBOARD_ID_SURVIVAL_SCORE_OTHER_NJD = 593,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ALL_HDR = 594,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ALL_OSW = 595,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ALL_MRY = 596,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ALL_NJD = 597,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ASIA_HDR = 598,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ASIA_OSW = 599,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ASIA_MRY = 600,
	LEADERBOARD_ID_TIMEATTACK_SCORE_ASIA_NJD = 601,
	LEADERBOARD_ID_TIMEATTACK_SCORE_EUROPE_HDR = 602,
	LEADERBOARD_ID_TIMEATTACK_SCORE_EUROPE_OSW = 603,
	LEADERBOARD_ID_TIMEATTACK_SCORE_EUROPE_MRY = 604,
	LEADERBOARD_ID_TIMEATTACK_SCORE_EUROPE_NJD = 605,
	LEADERBOARD_ID_TIMEATTACK_SCORE_NORTHAMERICA_HDR = 606,
	LEADERBOARD_ID_TIMEATTACK_SCORE_NORTHAMERICA_OSW = 607,
	LEADERBOARD_ID_TIMEATTACK_SCORE_NORTHAMERICA_MRY = 608,
	LEADERBOARD_ID_TIMEATTACK_SCORE_NORTHAMERICA_NJD = 609,
	LEADERBOARD_ID_TIMEATTACK_SCORE_OTHER_HDR = 610,
	LEADERBOARD_ID_TIMEATTACK_SCORE_OTHER_OSW = 611,
	LEADERBOARD_ID_TIMEATTACK_SCORE_OTHER_MRY = 612,
	LEADERBOARD_ID_TIMEATTACK_SCORE_OTHER_NJD = 613,
	LEADERBOARD_ID_MAX = 614,
};
enum <unnamed-enum-LEADERBOARD_REPALY_FORMAT_000>
{
	LEADERBOARD_REPALY_FORMAT_000 = 0,
	LEADERBOARD_REPALY_FORMAT_001 = 1,
	LEADERBOARD_REPALY_FORMAT_002 = 2,
	LEADERBOARD_REPALY_FORMAT_UNKNOWN = 3,
};
struct LEADERBOARD_INFO_RANKMATCH_WIN
{
	unsigned char m_Icon; // 0x0
	unsigned char m_Country; // 0x1
	unsigned char m_DisconnectMarker; // 0x2
};
struct LEADERBOARD_INFO_GRADE
{
	long long m_Point; // 0x0
	unsigned char m_Grade; // 0x8
	unsigned char m_Icon; // 0x9
	unsigned char m_Country; // 0xA
	unsigned char m_DisconnectMarker; // 0xB
};
struct LEADERBOARD_INFO_SURVIVAL
{
	unsigned char m_Icon; // 0x0
	unsigned char m_Country; // 0x1
	unsigned char m_Character; // 0x2
	unsigned char m_DisconnectMarker; // 0x3
};
struct LEADERBOARD_REPLAY_USER_FORMAT_000
{
	unsigned long long onlineId; // 0x0
	unsigned char icon; // 0x8
	unsigned char grade; // 0x9
	unsigned char titileId; // 0xA
};
struct LEADERBOARD_REPLAY_USER_FORMAT_002
{
	unsigned long long onlineId; // 0x0
	unsigned char icon; // 0x8
	unsigned char grade; // 0x9
	unsigned short titileId; // 0xA
};
struct LEADERBOARD_REPLAY_USER2_FORMAT_001
{
	unsigned char disconnectMarker; // 0x0
};
struct LEADERBOARD_REPLAY_CHARACTER_FORMAT_000
{
	unsigned char characterId; // 0x0
};
struct LEADERBOARD_REPLAY_FORMAT_000
{
	unsigned long long m_Date; // 0x0
	LEADERBOARD_REPLAY_USER_FORMAT_000 m_User[3][2]; // 0x8
	LEADERBOARD_REPLAY_CHARACTER_FORMAT_000 m_Character[3][2]; // 0x4A
	unsigned char m_GameMode; // 0x50
	unsigned char m_GameRule; // 0x51
	unsigned char m_Result; // 0x52
	unsigned char m_Ver; // 0x53
};
struct LEADERBOARD_REPLAY_FORMAT_001
{
	unsigned long long m_Date; // 0x0
	LEADERBOARD_REPLAY_USER_FORMAT_000 m_User[3][2]; // 0x8
	LEADERBOARD_REPLAY_CHARACTER_FORMAT_000 m_Character[3][2]; // 0x4A
	unsigned char m_GameMode; // 0x50
	unsigned char m_GameRule; // 0x51
	unsigned char m_Result; // 0x52
	unsigned char m_Ver; // 0x53
	LEADERBOARD_REPLAY_USER2_FORMAT_001 m_User2[3][2]; // 0x54
};
struct LEADERBOARD_REPLAY
{
	unsigned long long m_Date; // 0x0
	LEADERBOARD_REPLAY_USER_FORMAT_002 m_User[3][2]; // 0x8
	LEADERBOARD_REPLAY_CHARACTER_FORMAT_000 m_Character[3][2]; // 0x50
	unsigned char m_GameMode; // 0x56
	unsigned char m_GameRule; // 0x57
	unsigned char m_Result; // 0x58
	unsigned char m_Ver; // 0x59
	LEADERBOARD_REPLAY_USER2_FORMAT_001 m_User2[3][2]; // 0x5A
};
struct LEADERBOARD_INFO
{
	LEADERBOARD_INFO();
	LEADERBOARD_ID m_BoardId; // 0x0
	long long m_Score; // 0x8
	long m_PcId; // 0x10
	LEADERBOARD_AREA m_Area; // 0x14
	LEADERBOARD_INFO_RANKMATCH_WIN m_RankWin; // 0x18
	LEADERBOARD_INFO_GRADE m_Grade; // 0x18
	LEADERBOARD_INFO_SURVIVAL m_Survival; // 0x18
	LEADERBOARD_INFO_SURVIVAL m_TimeAttack; // 0x18
	LEADERBOARD_REPLAY m_Replay; // 0x18
};