#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_sysalloc.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_types2d.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_alg.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/string.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memory.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_memcpy_s.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_wstring.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_string.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocinfo.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_range.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_log.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_math2d.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_toleranceparams.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_memorymanager.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_resizeimage.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_arrayunsafe.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_sync.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_fontmanager.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_font.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_hash.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_cxform.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_color.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_matrix2x4.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_std.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/stdlib.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wstring.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"

enum Scaleform::Render::Text::HTMLElementsEnum
{
	GFxHTML_A = 0,
	GFxHTML_B = 1,
	GFxHTML_BR = 2,
	GFxHTML_FONT = 3,
	GFxHTML_I = 4,
	GFxHTML_IMG = 5,
	GFxHTML_LI = 6,
	GFxHTML_P = 7,
	GFxHTML_SPAN = 8,
	GFxHTML_TAB = 9,
	GFxHTML_TEXTFORMAT = 10,
	GFxHTML_U = 11,
	GFxHTML_ALIGN = 12,
	GFxHTML_ALPHA = 13,
	GFxHTML_BASELINE = 14,
	GFxHTML_BLOCKINDENT = 15,
	GFxHTML_CLASS = 16,
	GFxHTML_COLOR = 17,
	GFxHTML_FACE = 18,
	GFxHTML_HEIGHT = 19,
	GFxHTML_HREF = 20,
	GFxHTML_HSPACE = 21,
	GFxHTML_ID = 22,
	GFxHTML_INDENT = 23,
	GFxHTML_KERNING = 24,
	GFxHTML_LEADING = 25,
	GFxHTML_LEFTMARGIN = 26,
	GFxHTML_LETTERSPACING = 27,
	GFxHTML_RIGHTMARGIN = 28,
	GFxHTML_SRC = 29,
	GFxHTML_SIZE = 30,
	GFxHTML_TARGET = 31,
	GFxHTML_TABSTOPS = 32,
	GFxHTML_VSPACE = 33,
	GFxHTML_WIDTH = 34,
	GFxHTML_LEFT = 35,
	GFxHTML_RIGHT = 36,
	GFxHTML_CENTER = 37,
	GFxHTML_JUSTIFY = 38,
};
struct Scaleform::Render::Text::SGMLElementDesc
{
	const char * ElemName; // 0x0
	Scaleform::Render::Text::HTMLElementsEnum ElemId; // 0x8
	bool ReqEndElement; // 0xC
	bool EmptyElement; // 0xD
};
const Scaleform::Render::Text::SGMLElementDesc * Scaleform::Render::Text::SGMLElementDesc::FindElem<wchar_t>(const wchar_t * lookForElemName, unsigned long long nameSize, const Scaleform::Render::Text::SGMLElementDesc * ptable, unsigned long long tableSize); // 0x1403870C0
struct Scaleform::Render::Text::SGMLElementDesc::Comparable<wchar_t>
{
	const wchar_t * Str; // 0x0
	unsigned long long Size; // 0x8
	Comparable<wchar_t>(const wchar_t *, unsigned long long);
};
struct Scaleform::Render::Text::SGMLElementDesc::Comparator<wchar_t>
{
	static long Compare(const Scaleform::Render::Text::SGMLElementDesc &, const Scaleform::Render::Text::SGMLElementDesc::Comparable<wchar_t> &);
	static long Less(const Scaleform::Render::Text::SGMLElementDesc &, const Scaleform::Render::Text::SGMLElementDesc::Comparable<wchar_t> &);
};
bool Scaleform::Render::Text::StyledText::ParseHtmlImpl<wchar_t>(const wchar_t * phtml, unsigned long long htmlSize, Scaleform::ArrayDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2,Scaleform::ArrayDefaultPolicy> * pimgInfoArr, bool multiline, bool condenseWhite, const Scaleform::Render::Text::StyleManagerBase * pstyleMgr, const Scaleform::Render::Text::TextFormat * defTxtFmt, const Scaleform::Render::Text::ParagraphFormat * defParaFmt); // 0x140387190
Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>::SGMLStackElemDesc<wchar_t>(const Scaleform::Render::Text::SGMLStackElemDesc<wchar_t> & __that); // 0x140388FE0
Scaleform::Render::Text::HTMLImageTagDesc::~HTMLImageTagDesc(); // 0x140389110
Scaleform::Render::Text::StyledText::HTMLImageTagInfo::~HTMLImageTagInfo(); // 0x140389190
struct Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>
{
	const wchar_t * pElemName; // 0x0
	unsigned long long ElemNameSize; // 0x8
	const Scaleform::Render::Text::SGMLElementDesc * pElemDesc; // 0x10
	unsigned long long StartPos; // 0x18
	Scaleform::Render::Text::TextFormat TextFmt; // 0x20
	Scaleform::Render::Text::ParagraphFormat ParaFmt; // 0x70
	SGMLStackElemDesc<wchar_t>(Scaleform::Render::Text::SGMLStackElemDesc<wchar_t> &);
	SGMLStackElemDesc<wchar_t>(const Scaleform::Render::Text::SGMLStackElemDesc<wchar_t> &);
	SGMLStackElemDesc<wchar_t>(Scaleform::MemoryHeap *, const wchar_t *, unsigned long long, const Scaleform::Render::Text::SGMLElementDesc *, unsigned long long);
	SGMLStackElemDesc<wchar_t>();
	~SGMLStackElemDesc<wchar_t>();
	Scaleform::Render::Text::SGMLStackElemDesc<wchar_t> & operator=(Scaleform::Render::Text::SGMLStackElemDesc<wchar_t> &);
	Scaleform::Render::Text::SGMLStackElemDesc<wchar_t> & operator=(const Scaleform::Render::Text::SGMLStackElemDesc<wchar_t> &);
};
class Scaleform::ArrayDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2,Scaleform::ArrayDefaultPolicy> :
	Scaleform::ArrayBase<Scaleform::ArrayDataDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,Scaleform::AllocatorDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2>,Scaleform::ArrayDefaultPolicy> >
{
	struct ValueType;
	struct AllocatorType;
	struct SizePolicyType;
	class SelfType;
	class BaseType;
public:
	ArrayDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2,Scaleform::ArrayDefaultPolicy>(const Scaleform::ArrayDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2,Scaleform::ArrayDefaultPolicy> &);
	ArrayDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2,Scaleform::ArrayDefaultPolicy>(Scaleform::MemoryHeap *, const Scaleform::ArrayDefaultPolicy &);
	ArrayDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2,Scaleform::ArrayDefaultPolicy>(Scaleform::MemoryHeap *, long);
	ArrayDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2,Scaleform::ArrayDefaultPolicy>(Scaleform::MemoryHeap *);
	const Scaleform::ArrayDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2,Scaleform::ArrayDefaultPolicy> & operator=(const Scaleform::ArrayDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2,Scaleform::ArrayDefaultPolicy> &);
	~ArrayDH<Scaleform::Render::Text::SGMLStackElemDesc<wchar_t>,2,Scaleform::ArrayDefaultPolicy>();
};
class Scaleform::Render::Text::SGMLParser<wchar_t>
{
protected:
	Scaleform::MemoryHeap * pHeap; // 0x0
	long CurState; // 0x8
	Scaleform::Render::Text::SGMLCharIter<wchar_t> Iter; // 0x10
	wchar_t * pBuffer; // 0x30
	unsigned long long BufSize; // 0x38
	unsigned long long BufPos; // 0x40
	bool CondenseWhite; // 0x48
	void SkipName();
	void SkipSpaces();
	void SkipComment();
	void SkipAttribute();
	void ParseName(const wchar_t * *, unsigned long long *);
public:
	SGMLParser<wchar_t>(Scaleform::MemoryHeap *, const wchar_t *, unsigned long long);
	~SGMLParser<wchar_t>();
	void ResetBuf();
	void AppendToBuf(const wchar_t *, unsigned long long);
	void AppendCharToBuf(unsigned long);
	long GetNext();
	bool GetNextAttribute(const wchar_t * *, unsigned long long *);
	bool GetNextAttributeValue(const wchar_t * *, unsigned long long *);
	bool ParseStartElement(const wchar_t * *, unsigned long long *);
	bool ParseEndElement(const wchar_t * *, unsigned long long *);
	bool ParseContent(const wchar_t * *, unsigned long long *);
	bool HasAttributes();
	void SetCondenseWhite();
	static long StrCompare(const wchar_t *, unsigned long long, const wchar_t *, unsigned long long);
	static long StrCompare(const wchar_t *, const char *, unsigned long long);
