#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_sgmlparser.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_vertex.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_image.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_texturecache.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_stats.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_threadcommandqueue.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wtime.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_array.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_timer.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_allocator.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_threads.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_file.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_alg.h"

#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_types2d.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_wstring.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_string.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_list.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_simd_sse.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_utf8util.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/sys/stat.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_log.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/wchar.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_refcount.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/corecrt_wconio.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memory.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_highlight.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_memoryheap.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_states.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_atomic.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_statebag.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_context.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_containers.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/text/text_docview.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/cmath"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_range.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_types.h"
#include "program files (x86)/windows kits/10/include/10.0.10240.0/ucrt/math.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/kernel/sf_ampinterface.h"
#include "program files (x86)/microsoft visual studio 14.0/vc/include/vadefs.h"
#include "dev/kof/master/development/source/middleware/autodesk/scaleform/gfx_sdk/src/render/render_constants.h"

Scaleform::Render::Text::DocView::DocView(Scaleform::Render::Text::Allocator * pallocator, Scaleform::Render::Text::FontManagerBase * pfontMgr, Scaleform::Log * plog); // 0x1403011D0
Scaleform::Render::Text::DocView::~DocView(); // 0x1403017F0
struct Scaleform::Render::Text::ImageSubstCmp
{
	struct Comparable;
	static long StrCompare(const wchar_t *, unsigned long long, const wchar_t *, unsigned long long, bool);
	static long InsLess(const Scaleform::Render::Text::DocView::ImageSubstitutor::Element &, const Scaleform::Render::Text::ImageSubstCmp::Comparable &);
	static long Less(const Scaleform::Render::Text::DocView::ImageSubstitutor::Element &, const Scaleform::Render::Text::ImageSubstCmp::Comparable &);
	static long Equals(const Scaleform::Render::Text::DocView::ImageSubstitutor::Element &, const Scaleform::Render::Text::ImageSubstCmp::Comparable &);
};
struct Scaleform::Render::Text::ImageSubstCmp::Comparable
{
	const wchar_t * Str; // 0x0
	unsigned long long MaxSize; // 0x8
	Comparable(const wchar_t *, unsigned long long);
};
void Scaleform::Render::Text::DocView::ImageSubstitutor::AddImageDesc(const Scaleform::Render::Text::DocView::ImageSubstitutor::Element & elem); // 0x140302190
Scaleform::Render::Text::ImageDesc * Scaleform::Render::Text::DocView::ImageSubstitutor::FindImageDesc(const wchar_t * pstr, unsigned long long maxlen, unsigned long long * ptextLen); // 0x140303C40
void Scaleform::Render::Text::DocView::ImageSubstitutor::RemoveImageDesc(Scaleform::Render::Text::ImageDesc * pimgDesc); // 0x1403092D0
void Scaleform::Render::Text::DocView::SetText(const char * putf8String, unsigned long long stringSize); // 0x140309B30
void Scaleform::Render::Text::DocView::SetText(const wchar_t * pstring, unsigned long long length); // 0x140309B60
void Scaleform::Render::Text::DocView::SetTextFormat(const Scaleform::Render::Text::TextFormat & fmt, unsigned long long startPos, unsigned long long endPos); // 0x140309B90
void Scaleform::Render::Text::DocView::SetParagraphFormat(const Scaleform::Render::Text::ParagraphFormat & fmt, unsigned long long startPos, unsigned long long endPos); // 0x140309830
void Scaleform::Render::Text::DocView::DocumentText::OnParagraphRemoving(const Scaleform::Render::Text::Paragraph & para); // 0x140309130
void Scaleform::Render::Text::DocView::DocumentText::OnTextInserting(unsigned long long startPos, unsigned long long length, const char * ptextInserting); // 0x140309140
unsigned long long Scaleform::Render::Text::DocView::EditCommand(Scaleform::Render::Text::DocView::CommandType cmdId, const void * command); // 0x140302AF0
Scaleform::String Scaleform::Render::Text::DocView::GetText(); // 0x1403078C0
Scaleform::String & Scaleform::Render::Text::DocView::GetText(Scaleform::String * retStr); // 0x1403078E0
Scaleform::String Scaleform::Render::Text::DocView::GetHtml(); // 0x1403070D0
void Scaleform::Render::Text::DocView::ParseHtml(const char * putf8Str, unsigned long long utf8Len, bool condenseWhite, Scaleform::ArrayDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2,Scaleform::ArrayDefaultPolicy> * pimgInfoArr, const Scaleform::Render::Text::StyleManagerBase * pstyleMgr, const Scaleform::Render::Text::TextFormat * txtFmt, const Scaleform::Render::Text::ParagraphFormat * paraFmt); // 0x140309150
void Scaleform::Render::Text::DocView::ParseHtml(const wchar_t * pwStr, unsigned long long strLen, bool condenseWhite, Scaleform::ArrayDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2,Scaleform::ArrayDefaultPolicy> * pimgInfoArr, const Scaleform::Render::Text::StyleManagerBase * pstyleMgr, const Scaleform::Render::Text::TextFormat * txtFmt, const Scaleform::Render::Text::ParagraphFormat * paraFmt); // 0x140309210
void Scaleform::Render::Text::DocView::AppendText(const char * putf8Str, unsigned long long utf8Len); // 0x140302330
void Scaleform::Render::Text::DocView::AppendHtml(const char * putf8Str, unsigned long long utf8Len, bool condenseWhite, Scaleform::ArrayDH<Scaleform::Render::Text::StyledText::HTMLImageTagInfo,2,Scaleform::ArrayDefaultPolicy> * pimgInfoArr); // 0x1403022C0
unsigned long long Scaleform::Render::Text::DocView::ReplaceText(const wchar_t * pstr, unsigned long long startPos, unsigned long long endPos, unsigned long long strLen); // 0x140309370
void Scaleform::Render::Text::DocView::Close(); // 0x140302750
bool Scaleform::Render::Text::DocView::ContainsNonLeftAlignment(); // 0x1403027D0
void Scaleform::Render::Text::DocView::SetViewRect(const Scaleform::Render::Rect<float> & rect, Scaleform::Render::Text::DocView::UseType ut); // 0x140309C20
void Scaleform::Render::Text::DocView::OnDocumentChanged(unsigned long notifyMask); // 0x140309080
void Scaleform::Render::Text::DocView::OnDocumentParagraphRemoving(const Scaleform::Render::Text::Paragraph & para); // 0x1403090A0
Scaleform::Render::Text::FontHandle * Scaleform::Render::Text::DocView::FindFont(Scaleform::Render::Text::DocView::FindFontInfo * pfontInfo, bool quietMode); // 0x140303820
class Scaleform::Render::Text::RightToLeftIterator
{
	struct CharacterInfo;
public:
	RightToLeftIterator(Scaleform::Render::Text::RightToLeftIterator &);
	RightToLeftIterator(const Scaleform::Render::Text::RightToLeftIterator &);
	RightToLeftIterator(const Scaleform::Render::Text::Paragraph &, const wchar_t *, unsigned long, const unsigned long *, const bool *);
	RightToLeftIterator();
	void Init(const Scaleform::Render::Text::Paragraph &, const wchar_t *, unsigned long, const unsigned long *, const bool *);
	bool IsFinished();
	const Scaleform::Render::Text::Paragraph::CharacterInfo & operator*();
	Scaleform::Render::Text::Paragraph::CharacterInfo & operator*();
	const Scaleform::Render::Text::Paragraph::CharacterInfo * operator->();
	Scaleform::Render::Text::Paragraph::CharacterInfo * operator->();
	void operator++(long);
	void operator++();
	void operator+=(unsigned long long);
	const wchar_t * GetRemainingTextPtr(unsigned long long *);
	unsigned long long GetCurTextIndex();
protected:
	const Scaleform::Render::Text::Paragraph * pParagraph; // 0x0
	const wchar_t * ParaText; // 0x8
	const unsigned long * IndexMap; // 0x10
	const bool * MirroredBits; // 0x18
	unsigned long ParaLen; // 0x20
	long Index; // 0x24
	unsigned long VIndex; // 0x28
	Scaleform::Render::Text::Paragraph::CharacterInfo PlaceHolder; // 0x30
public:
	~RightToLeftIterator();
	Scaleform::Render::Text::RightToLeftIterator & operator=(Scaleform::Render::Text::RightToLeftIterator &);
	Scaleform::Render::Text::RightToLeftIterator & operator=(const Scaleform::Render::Text::RightToLeftIterator &);
};
Scaleform::Render::Text::Paragraph::CharacterInfo & Scaleform::Render::Text::RightToLeftIterator::operator*(); // 0x140301EB0
class Scaleform::Render::Text::GFxLineCursor
{
public:
	Scaleform::Render::Text::LineBuffer::GlyphEntry * pPrevGrec; // 0x0
	Scaleform::Ptr<Scaleform::Render::Text::FontHandle> pLastFont; // 0x8
	unsigned long LastCharCode; // 0x10
	unsigned long LastGlyphIndex; // 0x14
	float LastAdvance; // 0x18
	long LastGlyphWidth; // 0x1C
	long FirstGlyphWidth; // 0x20
	unsigned long LastColor; // 0x24
	Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> pComposStr; // 0x28
	unsigned long long ComposStrPosition; // 0x30
	unsigned long long ComposStrLength; // 0x38
	unsigned long long ComposStrCurPos; // 0x40
	Scaleform::Render::Text::DocView * pDocView; // 0x48
	const Scaleform::Render::Text::Paragraph * pParagraph; // 0x50
	long LineWidth; // 0x58
	long LineWidthWithoutTrailingSpaces; // 0x5C
	unsigned long LineLength; // 0x60
	float MaxFontAscent; // 0x64
	float MaxFontDescent; // 0x68
	float MaxFontLeading; // 0x6C
	Scaleform::Render::Text::Paragraph::CharactersIterator CharIter; // 0x70
	Scaleform::Render::Text::Paragraph::CharacterInfo CharInfoHolder; // 0xB0
	long Indent; // 0xC8
	long LeftMargin; // 0xCC
	long RightMargin; // 0xD0
	Scaleform::Render::Text::LineBuffer::GlyphInserter GlyphIns; // 0xD8
	unsigned long NumOfSpaces; // 0xF8
	unsigned long NumOfTrailingSpaces; // 0xFC
	float FontScaleFactor; // 0x100
	Scaleform::Render::Text::RightToLeftIterator RLCharIter; // 0x108
	bool RightToLeft; // 0x150
	bool LastKerning; // 0x151
	bool LineHasNewLine; // 0x152
	unsigned long long NumChars; // 0x158
	GFxLineCursor(const Scaleform::Render::Text::GFxLineCursor &);
	GFxLineCursor(Scaleform::Render::Text::DocView *, const Scaleform::Render::Text::Paragraph *);
	GFxLineCursor();
	~GFxLineCursor();
	bool IsRightToLeft();
	bool IsFinished();
	void operator++();
	void operator+=(unsigned long);
	bool IsInsideComposStr();
	const Scaleform::Render::Text::Paragraph::CharacterInfo & operator*();
	float GetPrevGlyphAdvanceAdj(wchar_t);
	void Reset();
	void TrackFontParams(Scaleform::Render::Font *, float);
	const wchar_t * GetRemainingTextPtr(unsigned long long *);
	Scaleform::Render::Text::GFxLineCursor & operator=(const Scaleform::Render::Text::GFxLineCursor &);
};
class Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase>
{
protected:
	Scaleform::Render::Text::CompositionStringBase * pObject; // 0x0
public:
	Ptr<Scaleform::Render::Text::CompositionStringBase>(const Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> &);
	Ptr<Scaleform::Render::Text::CompositionStringBase>(Scaleform::Render::Text::CompositionStringBase *);
	Ptr<Scaleform::Render::Text::CompositionStringBase>(Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> &, Scaleform::PickType);
	Ptr<Scaleform::Render::Text::CompositionStringBase>(Scaleform::Pickable<Scaleform::Render::Text::CompositionStringBase>);
	Ptr<Scaleform::Render::Text::CompositionStringBase>(Scaleform::Render::Text::CompositionStringBase &);
	Ptr<Scaleform::Render::Text::CompositionStringBase>();
	~Ptr<Scaleform::Render::Text::CompositionStringBase>();
	bool operator==(Scaleform::Render::Text::CompositionStringBase *);
	bool operator==(const Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> &);
	bool operator!=(Scaleform::Render::Text::CompositionStringBase *);
	bool operator!=(const Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> &);
	bool operator<(const Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> &);
	Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & operator=(Scaleform::Pickable<Scaleform::Render::Text::CompositionStringBase>);
	const Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & operator=(Scaleform::Render::Text::CompositionStringBase &);
	const Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & operator=(Scaleform::Render::Text::CompositionStringBase *);
	const Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & operator=(const Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> &);
	Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & SetPtr(Scaleform::Pickable<Scaleform::Render::Text::CompositionStringBase>);
	Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & SetPtr(Scaleform::Render::Text::CompositionStringBase &);
	Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & SetPtr(Scaleform::Render::Text::CompositionStringBase *);
	Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & SetPtr(const Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> &);
	void NullWithoutRelease();
	void Clear();
	Scaleform::Render::Text::CompositionStringBase * & GetRawRef();
	Scaleform::Render::Text::CompositionStringBase * GetPtr();
	Scaleform::Render::Text::CompositionStringBase & operator*();
	Scaleform::Render::Text::CompositionStringBase * operator->();
	Scaleform::Render::Text::CompositionStringBase * operator class Scaleform::Render::Text::CompositionStringBase *();
	Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & Pick(Scaleform::Render::Text::CompositionStringBase *);
	Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & Pick(Scaleform::Pickable<Scaleform::Render::Text::CompositionStringBase>);
	Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> & Pick(Scaleform::Ptr<Scaleform::Render::Text::CompositionStringBase> &);
};
Scaleform::Render::Text::GFxLineCursor::GFxLineCursor(); // 0x1403014D0
Scaleform::Render::Text::GFxLineCursor::GFxLineCursor(Scaleform::Render::Text::DocView * pview, const Scaleform::Render::Text::Paragraph * ppara); // 0x1403013B0
Scaleform::Render::Text::GFxLineCursor::~GFxLineCursor(); // 0x1403018F0
Scaleform::Render::Text::Paragraph::CharacterInfo & Scaleform::Render::Text::Paragraph::CharacterInfo::operator=(const Scaleform::Render::Text::Paragraph::CharacterInfo & __that); // 0x1403019A0
Scaleform::Render::Text::GFxLineCursor & Scaleform::Render::Text::GFxLineCursor::operator=(const Scaleform::Render::Text::GFxLineCursor & __that); // 0x140301A10
void Scaleform::Render::Text::GFxLineCursor::operator+=(unsigned long n); // 0x140301F90
const Scaleform::Render::Text::Paragraph::CharacterInfo & Scaleform::Render::Text::GFxLineCursor::operator*(); // 0x140301CB0
void Scaleform::Render::Text::GFxLineCursor::TrackFontParams(Scaleform::Render::Font * pfont, float scale); // 0x140309E60
class Scaleform::Render::Text::ParagraphFormatter
{
private:
	Scaleform::Render::Text::DocView * pDocView; // 0x0
	const Scaleform::Render::Text::Paragraph * pParagraph; // 0x8
	const Scaleform::Render::Text::ParagraphFormat * pParaFormat; // 0x10
	Scaleform::Render::Text::LineBuffer::Line * pTempLine; // 0x18
	Scaleform::Render::Text::GFxLineCursor LineCursor; // 0x20
	Scaleform::HashIdentityDH<Scaleform::Render::Text::TextFormat const *,Scaleform::Ptr<Scaleform::Render::Text::FontHandle>,74,Scaleform::IdentityHash<Scaleform::Render::Text::TextFormat const *> > FontCache; // 0x180
	Scaleform::Render::Text::DocView::FindFontInfo FindFontInfo; // 0x190
	Scaleform::Render::Text::GFxLineCursor StartPoint; // 0x1B0
	Scaleform::Render::Text::GFxLineCursor HalfPoint; // 0x310
	Scaleform::Render::Text::GFxLineCursor WordWrapPoint; // 0x470
	float TextRectWidth; // 0x5D0
	unsigned long TabStopsNum; // 0x5D4
	unsigned long TabStopsIndex; // 0x5D8
	unsigned long DeltaText; // 0x5DC
	long Pass; // 0x5E0
	bool HyphenationRequested; // 0x5E4
	unsigned long RequestedWordWrapPos; // 0x5E8
	bool HasLineFormatHandler; // 0x5EC
	wchar_t TextBufForCustomFormat[256]; // 0x5EE
	wchar_t * pTextBufForCustomFormat; // 0x7F0
	unsigned long long TextBufLen; // 0x7F8
	unsigned long NewLen; // 0x800
	unsigned long NewSize; // 0x804
	wchar_t * NewParaText; // 0x808
	unsigned long * IndexMap; // 0x810
	bool * MirroredBits; // 0x818
	Scaleform::Render::Font * pFont; // 0x820
	Scaleform::Ptr<Scaleform::Render::Text::FontHandle> pFontHandle; // 0x828
	float Scale; // 0x830
	long GlyphIndex; // 0x834
	float GlyphAdvance; // 0x838
	long LastAdvance; // 0x83C
	long GlyphWidth; // 0x840
	long AdjLineWidth; // 0x844
	long NewLineWidth; // 0x848
	float FontSize; // 0x84C
	bool isSpace; // 0x850
	bool isNbsp; // 0x851
public:
	Scaleform::Render::Text::LineBuffer::Iterator * pLinesIter; // 0x858
	unsigned char TempLineBuff[1024]; // 0x860
	Scaleform::Render::Text::LineBuffer::Line * pDynLine; // 0xC60
	long NextOffsetY; // 0xC68
	long ParaYOffset; // 0xC6C
	Scaleform::Log * pLog; // 0xC70
	long ParaWidth; // 0xC78
	long ParaHeight; // 0xC7C
	unsigned long ParaLines; // 0xC80
	bool NeedRecenterLines; // 0xC84
	bool ForceVerticalCenterAutoSize; // 0xC85
	void FinalizeLine();
	void InitParagraph(const Scaleform::Render::Text::Paragraph &);
	void InitBidiText();
	void InitCustomWordWrapping();
	float GetActualFontSize();
	bool CheckWordWrap();
	bool HandleCustomWordWrap();
	void TreatBidirectionalTextInLine();
	ParagraphFormatter(const Scaleform::Render::Text::ParagraphFormatter &);
	ParagraphFormatter(Scaleform::Render::Text::DocView *, Scaleform::Log *);
	~ParagraphFormatter();
	void Format(const Scaleform::Render::Text::Paragraph &);
	Scaleform::Render::Text::ParagraphFormatter & operator=(const Scaleform::Render::Text::ParagraphFormatter &);
};
Scaleform::Render::Text::ParagraphFormatter::ParagraphFormatter(Scaleform::Render::Text::DocView * pdoc, Scaleform::Log * plog); // 0x1403015F0
void Scaleform::Render::Text::ParagraphFormatter::InitParagraph(const Scaleform::Render::Text::Paragraph & paragraph); // 0x140308650
void Scaleform::Render::Text::ParagraphFormatter::InitBidiText(); // 0x1403082C0
void Scaleform::Render::Text::ParagraphFormatter::InitCustomWordWrapping(); // 0x1403084C0
float Scaleform::Render::Text::ParagraphFormatter::GetActualFontSize(); // 0x140306220
void Scaleform::Render::Text::ParagraphFormatter::TreatBidirectionalTextInLine(); // 0x140309ED0
struct Scaleform::Render::Text::ParagraphFormatter::TreatBidirectionalTextInLine::__l2::FormatDataEntry_
{
	Scaleform::Render::Text::LineBuffer::GlyphEntry Glyph; // 0x0
	Scaleform::Ptr<Scaleform::Render::Text::FontHandle> pFont; // 0x8
	Scaleform::Ptr<Scaleform::Render::Text::ImageDesc> pImage; // 0x10
	unsigned long ColorV; // 0x18
	FormatDataEntry_(Scaleform::Render::Text::ParagraphFormatter::TreatBidirectionalTextInLine::__l2::FormatDataEntry_ &);
	FormatDataEntry_(const Scaleform::Render::Text::ParagraphFormatter::TreatBidirectionalTextInLine::__l2::FormatDataEntry_ &);
	FormatDataEntry_();
	~FormatDataEntry_();
	Scaleform::Render::Text::ParagraphFormatter::TreatBidirectionalTextInLine::__l2::FormatDataEntry_ & operator=(Scaleform::Render::Text::ParagraphFormatter::TreatBidirectionalTextInLine::__l2::FormatDataEntry_ &);
	Scaleform::Render::Text::ParagraphFormatter::TreatBidirectionalTextInLine::__l2::FormatDataEntry_ & operator=(const Scaleform::Render::Text::ParagraphFormatter::TreatBidirectionalTextInLine::__l2::FormatDataEntry_ &);
};
void Scaleform::Render::Text::ParagraphFormatter::FinalizeLine(); // 0x1403030A0
bool Scaleform::Render::Text::ParagraphFormatter::HandleCustomWordWrap(); // 0x1403079E0
